{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\github\foodbi\regression.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}12 Oct 2023, 00:33:39
{txt}
{com}. 
. cd "C:\github\foodbi"
{res}C:\github\foodbi
{txt}
{com}. 
. // 00-15
. use tfpc,clear
{txt}
{com}. duplicates drop disic4_4 year,force

{p 0 4}{txt}Duplicates in terms of {res} disic4_4 year{p_end}

{txt}(74,949 observations deleted)

{com}. xtset disic4_4 year
{res}
{col 1}{txt:Panel variable: }{res:disic4_4}{txt: (strongly balanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2000}}{txt: to }{res:{bind:2015}}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}
{com}. xtreg mui tfpi wa_cr44d,fe
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}       194
{txt}Group variable: {res}disic4_4{txt}{col 49}Number of groups{col 67}={col 69}{res}        13

{txt}R-squared:{col 49}Obs per group:
     Within  = {res}0.1865{col 63}{txt}min{col 67}={col 69}{res}        14
{txt}     Between = {res}0.0082{col 63}{txt}avg{col 67}={col 69}{res}      14.9
{txt}     Overall = {res}0.0007{col 63}{txt}max{col 67}={col 69}{res}        15

{txt}{col 49}F({res}2{txt},{res}179{txt}){col 67}={col 70}{res}    20.51
{txt}corr(u_i, Xb) = {res}-0.7876{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         mui{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}tfpi {c |}{col 14}{res}{space 2} .6839786{col 26}{space 2} .1127741{col 37}{space 1}    6.07{col 46}{space 3}0.000{col 54}{space 4} .4614409{col 67}{space 3} .9065163
{txt}{space 4}wa_cr44d {c |}{col 14}{res}{space 2} .7167534{col 26}{space 2} .5785857{col 37}{space 1}    1.24{col 46}{space 3}0.217{col 54}{space 4}-.4249729{col 67}{space 3}  1.85848
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.931789{col 26}{space 2} 1.064503{col 37}{space 1}   -3.69{col 46}{space 3}0.000{col 54}{space 4}-6.032379{col 67}{space 3}-1.831199
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} 1.6514856
     {txt}sigma_e {c |} {res} .80475611
         {txt}rho {c |} {res} .80811102{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}12{txt}, {res}179{txt}) = {res}23.60{col 62}{txt}Prob > F = {res}0.0000
{txt}
{com}. outreg2 using "reg/regacr4.xls",excel replace
{txt}{browse `"reg/regacr4.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "reg/regacr4.txt""':seeout}

{com}. 
. //xtreg mui tfp wa_hhi4d_y,fe
. //outreg2 using "reg/regahhi.xls",excel replace
. 
. gen lwpi=log(wpio)
{txt}(39 missing values generated)

{com}. 
. // no lags
. 
. xtreg lwpi L.lending mui wa_cr44d,fe
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}       155
{txt}Group variable: {res}disic4_4{txt}{col 49}Number of groups{col 67}={col 69}{res}        13

{txt}R-squared:{col 49}Obs per group:
     Within  = {res}0.6959{col 63}{txt}min{col 67}={col 69}{res}        11
{txt}     Between = {res}0.0014{col 63}{txt}avg{col 67}={col 69}{res}      11.9
{txt}     Overall = {res}0.6581{col 63}{txt}max{col 67}={col 69}{res}        12

{txt}{col 49}F({res}3{txt},{res}139{txt}){col 67}={col 70}{res}   106.01
{txt}corr(u_i, Xb) = {res}-0.1469{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        lwpi{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}lending {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} -.137084{col 26}{space 2} .0078914{col 37}{space 1}  -17.37{col 46}{space 3}0.000{col 54}{space 4}-.1526866{col 67}{space 3}-.1214814
{txt}{space 12} {c |}
{space 9}mui {c |}{col 14}{res}{space 2} .0737928{col 26}{space 2} .0227378{col 37}{space 1}    3.25{col 46}{space 3}0.001{col 54}{space 4} .0288361{col 67}{space 3} .1187495
{txt}{space 4}wa_cr44d {c |}{col 14}{res}{space 2}-.0295057{col 26}{space 2} .1715791{col 37}{space 1}   -0.17{col 46}{space 3}0.864{col 54}{space 4}-.3687481{col 67}{space 3} .3097367
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 7.108949{col 26}{space 2} .1601046{col 37}{space 1}   44.40{col 46}{space 3}0.000{col 54}{space 4} 6.792393{col 67}{space 3} 7.425504
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .08156305
     {txt}sigma_e {c |} {res} .21454579
         {txt}rho {c |} {res} .12627608{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}12{txt}, {res}139{txt}) = {res}1.13{col 62}{txt}Prob > F = {res}0.3410
{txt}
{com}. outreg2 using "reg/regawpi.xls",excel replace
{txt}{browse `"reg/regawpi.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "reg/regawpi.txt""':seeout}

{com}. 
. xtreg lwpi L.birate mui wa_cr44d,fe
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}       155
{txt}Group variable: {res}disic4_4{txt}{col 49}Number of groups{col 67}={col 69}{res}        13

{txt}R-squared:{col 49}Obs per group:
     Within  = {res}0.5552{col 63}{txt}min{col 67}={col 69}{res}        11
{txt}     Between = {res}0.0003{col 63}{txt}avg{col 67}={col 69}{res}      11.9
{txt}     Overall = {res}0.5145{col 63}{txt}max{col 67}={col 69}{res}        12

{txt}{col 49}F({res}3{txt},{res}139{txt}){col 67}={col 70}{res}    57.84
{txt}corr(u_i, Xb) = {res}-0.1825{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        lwpi{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}birate {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}-.0846066{col 26}{space 2}  .006639{col 37}{space 1}  -12.74{col 46}{space 3}0.000{col 54}{space 4}-.0977332{col 67}{space 3}-.0714801
{txt}{space 12} {c |}
{space 9}mui {c |}{col 14}{res}{space 2} .0788987{col 26}{space 2} .0274902{col 37}{space 1}    2.87{col 46}{space 3}0.005{col 54}{space 4} .0245456{col 67}{space 3} .1332518
{txt}{space 4}wa_cr44d {c |}{col 14}{res}{space 2} .0286912{col 26}{space 2} .2073087{col 37}{space 1}    0.14{col 46}{space 3}0.890{col 54}{space 4} -.381195{col 67}{space 3} .4385774
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5.803995{col 26}{space 2} .1362855{col 37}{space 1}   42.59{col 46}{space 3}0.000{col 54}{space 4} 5.534535{col 67}{space 3} 6.073456
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .08721186
     {txt}sigma_e {c |} {res}  .2594467
         {txt}rho {c |} {res} .10152244{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}12{txt}, {res}139{txt}) = {res}0.85{col 62}{txt}Prob > F = {res}0.5991
{txt}
{com}. outreg2 using "reg/regawpibi.xls",excel replace
{txt}{browse `"reg/regawpibi.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "reg/regawpibi.txt""':seeout}

{com}. 
. // lags
. 
. xtreg lwpi L.lending mui wa_cr44d,fe
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}       155
{txt}Group variable: {res}disic4_4{txt}{col 49}Number of groups{col 67}={col 69}{res}        13

{txt}R-squared:{col 49}Obs per group:
     Within  = {res}0.6959{col 63}{txt}min{col 67}={col 69}{res}        11
{txt}     Between = {res}0.0014{col 63}{txt}avg{col 67}={col 69}{res}      11.9
{txt}     Overall = {res}0.6581{col 63}{txt}max{col 67}={col 69}{res}        12

{txt}{col 49}F({res}3{txt},{res}139{txt}){col 67}={col 70}{res}   106.01
{txt}corr(u_i, Xb) = {res}-0.1469{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        lwpi{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}lending {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} -.137084{col 26}{space 2} .0078914{col 37}{space 1}  -17.37{col 46}{space 3}0.000{col 54}{space 4}-.1526866{col 67}{space 3}-.1214814
{txt}{space 12} {c |}
{space 9}mui {c |}{col 14}{res}{space 2} .0737928{col 26}{space 2} .0227378{col 37}{space 1}    3.25{col 46}{space 3}0.001{col 54}{space 4} .0288361{col 67}{space 3} .1187495
{txt}{space 4}wa_cr44d {c |}{col 14}{res}{space 2}-.0295057{col 26}{space 2} .1715791{col 37}{space 1}   -0.17{col 46}{space 3}0.864{col 54}{space 4}-.3687481{col 67}{space 3} .3097367
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 7.108949{col 26}{space 2} .1601046{col 37}{space 1}   44.40{col 46}{space 3}0.000{col 54}{space 4} 6.792393{col 67}{space 3} 7.425504
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .08156305
     {txt}sigma_e {c |} {res} .21454579
         {txt}rho {c |} {res} .12627608{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}12{txt}, {res}139{txt}) = {res}1.13{col 62}{txt}Prob > F = {res}0.3410
{txt}
{com}. outreg2 using "reg/regawpil.xls",excel replace
{txt}{browse `"reg/regawpil.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "reg/regawpil.txt""':seeout}

{com}. 
. xtreg lwpi L.birate mui wa_cr44d,fe
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}       155
{txt}Group variable: {res}disic4_4{txt}{col 49}Number of groups{col 67}={col 69}{res}        13

{txt}R-squared:{col 49}Obs per group:
     Within  = {res}0.5552{col 63}{txt}min{col 67}={col 69}{res}        11
{txt}     Between = {res}0.0003{col 63}{txt}avg{col 67}={col 69}{res}      11.9
{txt}     Overall = {res}0.5145{col 63}{txt}max{col 67}={col 69}{res}        12

{txt}{col 49}F({res}3{txt},{res}139{txt}){col 67}={col 70}{res}    57.84
{txt}corr(u_i, Xb) = {res}-0.1825{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        lwpi{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}birate {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}-.0846066{col 26}{space 2}  .006639{col 37}{space 1}  -12.74{col 46}{space 3}0.000{col 54}{space 4}-.0977332{col 67}{space 3}-.0714801
{txt}{space 12} {c |}
{space 9}mui {c |}{col 14}{res}{space 2} .0788987{col 26}{space 2} .0274902{col 37}{space 1}    2.87{col 46}{space 3}0.005{col 54}{space 4} .0245456{col 67}{space 3} .1332518
{txt}{space 4}wa_cr44d {c |}{col 14}{res}{space 2} .0286912{col 26}{space 2} .2073087{col 37}{space 1}    0.14{col 46}{space 3}0.890{col 54}{space 4} -.381195{col 67}{space 3} .4385774
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5.803995{col 26}{space 2} .1362855{col 37}{space 1}   42.59{col 46}{space 3}0.000{col 54}{space 4} 5.534535{col 67}{space 3} 6.073456
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .08721186
     {txt}sigma_e {c |} {res}  .2594467
         {txt}rho {c |} {res} .10152244{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}12{txt}, {res}139{txt}) = {res}0.85{col 62}{txt}Prob > F = {res}0.5991
{txt}
{com}. outreg2 using "reg/regawpibil.xls",excel replace
{txt}{browse `"reg/regawpibil.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "reg/regawpibil.txt""':seeout}

{com}. 
. // 17-21
. 
. use tfpd,clear
{txt}
{com}. duplicates drop Disic4 year,force

{p 0 4}{txt}Duplicates in terms of {res} Disic4 year{p_end}

{txt}(31,602 observations deleted)

{com}. xtset Disic4 year
{res}
{col 1}{txt:Panel variable: }{res:Disic4}{txt: (strongly balanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2017}}{txt: to }{res:{bind:2021}}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}
{com}. xtreg mui tfpi wa_cr44d,fe
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}       144
{txt}Group variable: {res}Disic4{txt}{col 49}Number of groups{col 67}={col 69}{res}        30

{txt}R-squared:{col 49}Obs per group:
     Within  = {res}0.0693{col 63}{txt}min{col 67}={col 69}{res}         3
{txt}     Between = {res}0.1040{col 63}{txt}avg{col 67}={col 69}{res}       4.8
{txt}     Overall = {res}0.0092{col 63}{txt}max{col 67}={col 69}{res}         5

{txt}{col 49}F({res}2{txt},{res}112{txt}){col 67}={col 70}{res}     4.17
{txt}corr(u_i, Xb) = {res}-0.6057{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0179

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         mui{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}tfpi {c |}{col 14}{res}{space 2}-.3512961{col 26}{space 2} .3202166{col 37}{space 1}   -1.10{col 46}{space 3}0.275{col 54}{space 4}-.9857642{col 67}{space 3}  .283172
{txt}{space 4}wa_cr44d {c |}{col 14}{res}{space 2} 5.184918{col 26}{space 2} 2.003212{col 37}{space 1}    2.59{col 46}{space 3}0.011{col 54}{space 4}  1.21581{col 67}{space 3} 9.154025
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5.451882{col 26}{space 2} 2.618308{col 37}{space 1}    2.08{col 46}{space 3}0.040{col 54}{space 4} .2640413{col 67}{space 3} 10.63972
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} 2.5526835
     {txt}sigma_e {c |} {res} 1.9217617
         {txt}rho {c |} {res}  .6382567{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}29{txt}, {res}112{txt}) = {res}4.51{col 62}{txt}Prob > F = {res}0.0000
{txt}
{com}. outreg2 using "reg/regbcr4.xls",excel replace
{txt}{browse `"reg/regbcr4.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "reg/regbcr4.txt""':seeout}

{com}. 
. //xtreg mui tfp wa_hhi4d_y,fe
. //outreg2 using "reg/regbhhi.xls",excel replace
. 
. gen lwpi=log(wpi)
{txt}(24 missing values generated)

{com}. 
. //no lags
. 
. xtreg lwpi lending mui tfpi wa_cr44d,fe
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}       123
{txt}Group variable: {res}Disic4{txt}{col 49}Number of groups{col 67}={col 69}{res}        28

{txt}R-squared:{col 49}Obs per group:
     Within  = {res}0.5564{col 63}{txt}min{col 67}={col 69}{res}         2
{txt}     Between = {res}0.3779{col 63}{txt}avg{col 67}={col 69}{res}       4.4
{txt}     Overall = {res}0.4279{col 63}{txt}max{col 67}={col 69}{res}         5

{txt}{col 49}F({res}4{txt},{res}91{txt}){col 67}={col 70}{res}    28.53
{txt}corr(u_i, Xb) = {res}0.1040{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        lwpi{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}lending {c |}{col 14}{res}{space 2} .1931448{col 26}{space 2} .0183029{col 37}{space 1}   10.55{col 46}{space 3}0.000{col 54}{space 4} .1567884{col 67}{space 3} .2295012
{txt}{space 9}mui {c |}{col 14}{res}{space 2}-.0011299{col 26}{space 2} .0083604{col 37}{space 1}   -0.14{col 46}{space 3}0.893{col 54}{space 4}-.0177368{col 67}{space 3}  .015477
{txt}{space 8}tfpi {c |}{col 14}{res}{space 2}-.0259915{col 26}{space 2} .0299601{col 37}{space 1}   -0.87{col 46}{space 3}0.388{col 54}{space 4}-.0855036{col 67}{space 3} .0335205
{txt}{space 4}wa_cr44d {c |}{col 14}{res}{space 2}-.0176324{col 26}{space 2} .1760033{col 37}{space 1}   -0.10{col 46}{space 3}0.920{col 54}{space 4}-.3672414{col 67}{space 3} .3319765
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 3.138059{col 26}{space 2} .2687369{col 37}{space 1}   11.68{col 46}{space 3}0.000{col 54}{space 4} 2.604246{col 67}{space 3} 3.671872
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .17357223
     {txt}sigma_e {c |} {res} .14629553
         {txt}rho {c |} {res}  .5846593{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}27{txt}, {res}91{txt}) = {res}4.38{col 62}{txt}Prob > F = {res}0.0000
{txt}
{com}. outreg2 using "reg/regbwpi.xls",excel replace
{txt}{browse `"reg/regbwpi.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "reg/regbwpi.txt""':seeout}

{com}. 
. xtreg lwpi L.birate mui tfpi wa_cr44d,fe
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}        99
{txt}Group variable: {res}Disic4{txt}{col 49}Number of groups{col 67}={col 69}{res}        28

{txt}R-squared:{col 49}Obs per group:
     Within  = {res}0.0273{col 63}{txt}min{col 67}={col 69}{res}         2
{txt}     Between = {res}0.0190{col 63}{txt}avg{col 67}={col 69}{res}       3.5
{txt}     Overall = {res}0.0259{col 63}{txt}max{col 67}={col 69}{res}         4

{txt}{col 49}F({res}4{txt},{res}67{txt}){col 67}={col 70}{res}     0.47
{txt}corr(u_i, Xb) = {res}-0.1666{txt}{col 49}Prob > F{col 67}={col 73}{res}0.7570

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        lwpi{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}birate {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}-.0464474{col 26}{space 2} .0456021{col 37}{space 1}   -1.02{col 46}{space 3}0.312{col 54}{space 4}-.1374697{col 67}{space 3} .0445748
{txt}{space 12} {c |}
{space 9}mui {c |}{col 14}{res}{space 2} .0001688{col 26}{space 2} .0205167{col 37}{space 1}    0.01{col 46}{space 3}0.993{col 54}{space 4}-.0407827{col 67}{space 3} .0411203
{txt}{space 8}tfpi {c |}{col 14}{res}{space 2} -.041035{col 26}{space 2} .0677503{col 37}{space 1}   -0.61{col 46}{space 3}0.547{col 54}{space 4}-.1762652{col 67}{space 3} .0941952
{txt}{space 4}wa_cr44d {c |}{col 14}{res}{space 2}  .063788{col 26}{space 2} .3672318{col 37}{space 1}    0.17{col 46}{space 3}0.863{col 54}{space 4}-.6692098{col 67}{space 3} .7967857
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  5.32454{col 26}{space 2} .5176604{col 37}{space 1}   10.29{col 46}{space 3}0.000{col 54}{space 4} 4.291285{col 67}{space 3} 6.357794
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .21224313
     {txt}sigma_e {c |} {res} .22810772
         {txt}rho {c |} {res} .46401954{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}27{txt}, {res}67{txt}) = {res}1.82{col 62}{txt}Prob > F = {res}0.0254
{txt}
{com}. outreg2 using "reg/regbwpibi.xls",excel replace
{txt}{browse `"reg/regbwpibi.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "reg/regbwpibi.txt""':seeout}

{com}. 
. // lags
. 
. xtreg lwpi lending mui tfpi wa_cr44d,fe
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}       123
{txt}Group variable: {res}Disic4{txt}{col 49}Number of groups{col 67}={col 69}{res}        28

{txt}R-squared:{col 49}Obs per group:
     Within  = {res}0.5564{col 63}{txt}min{col 67}={col 69}{res}         2
{txt}     Between = {res}0.3779{col 63}{txt}avg{col 67}={col 69}{res}       4.4
{txt}     Overall = {res}0.4279{col 63}{txt}max{col 67}={col 69}{res}         5

{txt}{col 49}F({res}4{txt},{res}91{txt}){col 67}={col 70}{res}    28.53
{txt}corr(u_i, Xb) = {res}0.1040{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        lwpi{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}lending {c |}{col 14}{res}{space 2} .1931448{col 26}{space 2} .0183029{col 37}{space 1}   10.55{col 46}{space 3}0.000{col 54}{space 4} .1567884{col 67}{space 3} .2295012
{txt}{space 9}mui {c |}{col 14}{res}{space 2}-.0011299{col 26}{space 2} .0083604{col 37}{space 1}   -0.14{col 46}{space 3}0.893{col 54}{space 4}-.0177368{col 67}{space 3}  .015477
{txt}{space 8}tfpi {c |}{col 14}{res}{space 2}-.0259915{col 26}{space 2} .0299601{col 37}{space 1}   -0.87{col 46}{space 3}0.388{col 54}{space 4}-.0855036{col 67}{space 3} .0335205
{txt}{space 4}wa_cr44d {c |}{col 14}{res}{space 2}-.0176324{col 26}{space 2} .1760033{col 37}{space 1}   -0.10{col 46}{space 3}0.920{col 54}{space 4}-.3672414{col 67}{space 3} .3319765
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 3.138059{col 26}{space 2} .2687369{col 37}{space 1}   11.68{col 46}{space 3}0.000{col 54}{space 4} 2.604246{col 67}{space 3} 3.671872
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .17357223
     {txt}sigma_e {c |} {res} .14629553
         {txt}rho {c |} {res}  .5846593{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}27{txt}, {res}91{txt}) = {res}4.38{col 62}{txt}Prob > F = {res}0.0000
{txt}
{com}. outreg2 using "reg/regbwpi.xls",excel replace
{txt}{browse `"reg/regbwpi.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "reg/regbwpi.txt""':seeout}

{com}. 
. xtreg lwpi L.birate mui tfpi wa_cr44d,fe
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}        99
{txt}Group variable: {res}Disic4{txt}{col 49}Number of groups{col 67}={col 69}{res}        28

{txt}R-squared:{col 49}Obs per group:
     Within  = {res}0.0273{col 63}{txt}min{col 67}={col 69}{res}         2
{txt}     Between = {res}0.0190{col 63}{txt}avg{col 67}={col 69}{res}       3.5
{txt}     Overall = {res}0.0259{col 63}{txt}max{col 67}={col 69}{res}         4

{txt}{col 49}F({res}4{txt},{res}67{txt}){col 67}={col 70}{res}     0.47
{txt}corr(u_i, Xb) = {res}-0.1666{txt}{col 49}Prob > F{col 67}={col 73}{res}0.7570

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        lwpi{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}birate {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}-.0464474{col 26}{space 2} .0456021{col 37}{space 1}   -1.02{col 46}{space 3}0.312{col 54}{space 4}-.1374697{col 67}{space 3} .0445748
{txt}{space 12} {c |}
{space 9}mui {c |}{col 14}{res}{space 2} .0001688{col 26}{space 2} .0205167{col 37}{space 1}    0.01{col 46}{space 3}0.993{col 54}{space 4}-.0407827{col 67}{space 3} .0411203
{txt}{space 8}tfpi {c |}{col 14}{res}{space 2} -.041035{col 26}{space 2} .0677503{col 37}{space 1}   -0.61{col 46}{space 3}0.547{col 54}{space 4}-.1762652{col 67}{space 3} .0941952
{txt}{space 4}wa_cr44d {c |}{col 14}{res}{space 2}  .063788{col 26}{space 2} .3672318{col 37}{space 1}    0.17{col 46}{space 3}0.863{col 54}{space 4}-.6692098{col 67}{space 3} .7967857
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  5.32454{col 26}{space 2} .5176604{col 37}{space 1}   10.29{col 46}{space 3}0.000{col 54}{space 4} 4.291285{col 67}{space 3} 6.357794
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .21224313
     {txt}sigma_e {c |} {res} .22810772
         {txt}rho {c |} {res} .46401954{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}27{txt}, {res}67{txt}) = {res}1.82{col 62}{txt}Prob > F = {res}0.0254
{txt}
{com}. outreg2 using "reg/regbwpibi.xls",excel replace
{txt}{browse `"reg/regbwpibi.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "reg/regbwpibi.txt""':seeout}

{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\github\foodbi\regression.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}12 Oct 2023, 00:33:40
{txt}{.-}
{smcl}
{txt}{sf}{ul off}