{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\github\foodbi\regression.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 2 Nov 2023, 16:42:26
{txt}
{com}. 
. cd "C:\github\foodbi"
{res}C:\github\foodbi
{txt}
{com}. 
. // 00-15
. use tfpc,clear
{txt}
{com}. 
. xtset psid year
{res}
{col 1}{txt:Panel variable: }{res:psid}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2000}}{txt: to }{res:{bind:2015}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}
{com}. xtreg pcm mu lending wa_cr44d i.disic4_4,fe
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}    74,942
{txt}Group variable: {res}psid{txt}{col 49}Number of groups{col 67}={col 69}{res}    10,946

{txt}R-squared:{col 49}Obs per group:
     Within  = {res}0.2015{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     Between = {res}0.1490{col 63}{txt}avg{col 67}={col 69}{res}       6.8
{txt}     Overall = {res}0.1676{col 63}{txt}max{col 67}={col 69}{res}        16

{txt}{col 49}F({res}15{txt},{res}63981{txt}){col 67}={col 70}{res}  1076.32
{txt}corr(u_i, Xb) = {res}-0.1030{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         pcm{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}mu {c |}{col 14}{res}{space 2}  .058515{col 26}{space 2} .0004617{col 37}{space 1}  126.75{col 46}{space 3}0.000{col 54}{space 4} .0576102{col 67}{space 3} .0594199
{txt}{space 5}lending {c |}{col 14}{res}{space 2} .0001021{col 26}{space 2}  .000296{col 37}{space 1}    0.34{col 46}{space 3}0.730{col 54}{space 4}-.0004781{col 67}{space 3} .0006822
{txt}{space 4}wa_cr44d {c |}{col 14}{res}{space 2} .0344615{col 26}{space 2} .0047845{col 37}{space 1}    7.20{col 46}{space 3}0.000{col 54}{space 4} .0250838{col 67}{space 3} .0438391
{txt}{space 12} {c |}
{space 4}disic4_4 {c |}
{space 7}1020  {c |}{col 14}{res}{space 2} .0236977{col 26}{space 2} .0148922{col 37}{space 1}    1.59{col 46}{space 3}0.112{col 54}{space 4}-.0054911{col 67}{space 3} .0528865
{txt}{space 7}1030  {c |}{col 14}{res}{space 2} -.019751{col 26}{space 2} .0171359{col 37}{space 1}   -1.15{col 46}{space 3}0.249{col 54}{space 4}-.0533373{col 67}{space 3} .0138354
{txt}{space 7}1040  {c |}{col 14}{res}{space 2} .0119211{col 26}{space 2} .0214269{col 37}{space 1}    0.56{col 46}{space 3}0.578{col 54}{space 4}-.0300756{col 67}{space 3} .0539179
{txt}{space 7}1050  {c |}{col 14}{res}{space 2} .0426446{col 26}{space 2} .0252346{col 37}{space 1}    1.69{col 46}{space 3}0.091{col 54}{space 4}-.0068153{col 67}{space 3} .0921045
{txt}{space 7}1061  {c |}{col 14}{res}{space 2}-.0052699{col 26}{space 2}  .017267{col 37}{space 1}   -0.31{col 46}{space 3}0.760{col 54}{space 4}-.0391133{col 67}{space 3} .0285734
{txt}{space 7}1062  {c |}{col 14}{res}{space 2} .0178302{col 26}{space 2} .0192164{col 37}{space 1}    0.93{col 46}{space 3}0.353{col 54}{space 4}-.0198338{col 67}{space 3} .0554943
{txt}{space 7}1071  {c |}{col 14}{res}{space 2} .0605169{col 26}{space 2} .0158138{col 37}{space 1}    3.83{col 46}{space 3}0.000{col 54}{space 4} .0295219{col 67}{space 3} .0915119
{txt}{space 7}1072  {c |}{col 14}{res}{space 2} .0273277{col 26}{space 2} .0238656{col 37}{space 1}    1.15{col 46}{space 3}0.252{col 54}{space 4}-.0194489{col 67}{space 3} .0741043
{txt}{space 7}1073  {c |}{col 14}{res}{space 2} .0064954{col 26}{space 2} .0196587{col 37}{space 1}    0.33{col 46}{space 3}0.741{col 54}{space 4}-.0320358{col 67}{space 3} .0450265
{txt}{space 7}1074  {c |}{col 14}{res}{space 2} .0497098{col 26}{space 2} .0192148{col 37}{space 1}    2.59{col 46}{space 3}0.010{col 54}{space 4} .0120487{col 67}{space 3} .0873708
{txt}{space 7}1079  {c |}{col 14}{res}{space 2} .0638379{col 26}{space 2} .0148915{col 37}{space 1}    4.29{col 46}{space 3}0.000{col 54}{space 4} .0346505{col 67}{space 3} .0930252
{txt}{space 7}1080  {c |}{col 14}{res}{space 2} .0177893{col 26}{space 2} .0235113{col 37}{space 1}    0.76{col 46}{space 3}0.449{col 54}{space 4}-.0282929{col 67}{space 3} .0638715
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0596522{col 26}{space 2} .0150987{col 37}{space 1}    3.95{col 46}{space 3}0.000{col 54}{space 4} .0300588{col 67}{space 3} .0892456
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .11666884
     {txt}sigma_e {c |} {res} .14567429
         {txt}rho {c |} {res}  .3907722{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}10945{txt}, {res}63981{txt}) = {res}3.35{col 62}{txt}Prob > F = {res}0.0000
{txt}
{com}. outreg2 using "reg/regapcmfirm.xls",excel replace
{txt}{browse `"reg/regapcmfirm.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "reg/regapcmfirm.txt""':seeout}

{com}. 
. duplicates drop disic4_4 year,force

{p 0 4}{txt}Duplicates in terms of {res} disic4_4 year{p_end}

{txt}(74,949 observations deleted)

{com}. xtset disic4_4 year
{res}
{col 1}{txt:Panel variable: }{res:disic4_4}{txt: (strongly balanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2000}}{txt: to }{res:{bind:2015}}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}
{com}. xtreg mui tfpi wa_cr44d,fe
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}       194
{txt}Group variable: {res}disic4_4{txt}{col 49}Number of groups{col 67}={col 69}{res}        13

{txt}R-squared:{col 49}Obs per group:
     Within  = {res}0.1863{col 63}{txt}min{col 67}={col 69}{res}        14
{txt}     Between = {res}0.0079{col 63}{txt}avg{col 67}={col 69}{res}      14.9
{txt}     Overall = {res}0.0008{col 63}{txt}max{col 67}={col 69}{res}        15

{txt}{col 49}F({res}2{txt},{res}179{txt}){col 67}={col 70}{res}    20.49
{txt}corr(u_i, Xb) = {res}-0.7873{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         mui{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}tfpi {c |}{col 14}{res}{space 2} .6834563{col 26}{space 2} .1127674{col 37}{space 1}    6.06{col 46}{space 3}0.000{col 54}{space 4} .4609318{col 67}{space 3} .9059808
{txt}{space 4}wa_cr44d {c |}{col 14}{res}{space 2} .7171288{col 26}{space 2} .5786528{col 37}{space 1}    1.24{col 46}{space 3}0.217{col 54}{space 4}  -.42473{col 67}{space 3} 1.858988
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.930051{col 26}{space 2} 1.064936{col 37}{space 1}   -3.69{col 46}{space 3}0.000{col 54}{space 4}-6.031495{col 67}{space 3}-1.828607
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} 1.6501453
     {txt}sigma_e {c |} {res} .80485271
         {txt}rho {c |} {res} .80782183{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}12{txt}, {res}179{txt}) = {res}23.58{col 62}{txt}Prob > F = {res}0.0000
{txt}
{com}. outreg2 using "reg/regacr4.xls",excel replace
{txt}{browse `"reg/regacr4.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "reg/regacr4.txt""':seeout}

{com}. 
. xtreg wa_pcm lending mui wa_cr44d,fe
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}       207
{txt}Group variable: {res}disic4_4{txt}{col 49}Number of groups{col 67}={col 69}{res}        13

{txt}R-squared:{col 49}Obs per group:
     Within  = {res}0.2565{col 63}{txt}min{col 67}={col 69}{res}        15
{txt}     Between = {res}0.0051{col 63}{txt}avg{col 67}={col 69}{res}      15.9
{txt}     Overall = {res}0.0903{col 63}{txt}max{col 67}={col 69}{res}        16

{txt}{col 49}F({res}3{txt},{res}191{txt}){col 67}={col 70}{res}    21.97
{txt}corr(u_i, Xb) = {res}-0.4162{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      wa_pcm{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}lending {c |}{col 14}{res}{space 2} -.005504{col 26}{space 2} .0023023{col 37}{space 1}   -2.39{col 46}{space 3}0.018{col 54}{space 4}-.0100453{col 67}{space 3}-.0009628
{txt}{space 9}mui {c |}{col 14}{res}{space 2} .0211408{col 26}{space 2} .0063954{col 37}{space 1}    3.31{col 46}{space 3}0.001{col 54}{space 4} .0085261{col 67}{space 3} .0337555
{txt}{space 4}wa_cr44d {c |}{col 14}{res}{space 2} .3095808{col 26}{space 2} .0506356{col 37}{space 1}    6.11{col 46}{space 3}0.000{col 54}{space 4}  .209704{col 67}{space 3} .4094576
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .1300541{col 26}{space 2} .0465652{col 37}{space 1}    2.79{col 46}{space 3}0.006{col 54}{space 4} .0382061{col 67}{space 3} .2219022
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .08191953
     {txt}sigma_e {c |} {res} .07600958
         {txt}rho {c |} {res} .53736919{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}12{txt}, {res}191{txt}) = {res}12.55{col 62}{txt}Prob > F = {res}0.0000
{txt}
{com}. outreg2 using "reg/regapcmind.xls",excel replace
{txt}{browse `"reg/regapcmind.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "reg/regapcmind.txt""':seeout}

{com}. 
. //xtreg mui tfp wa_hhi4d_y,fe
. //outreg2 using "reg/regahhi.xls",excel replace
. 
. gen lwpi=log(wpio)
{txt}(39 missing values generated)

{com}. 
. // no lags
. 
. xtreg lwpi lending mui wa_cr44d,fe
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}       168
{txt}Group variable: {res}disic4_4{txt}{col 49}Number of groups{col 67}={col 69}{res}        13

{txt}R-squared:{col 49}Obs per group:
     Within  = {res}0.7070{col 63}{txt}min{col 67}={col 69}{res}        12
{txt}     Between = {res}0.0162{col 63}{txt}avg{col 67}={col 69}{res}      12.9
{txt}     Overall = {res}0.6718{col 63}{txt}max{col 67}={col 69}{res}        13

{txt}{col 49}F({res}3{txt},{res}152{txt}){col 67}={col 70}{res}   122.28
{txt}corr(u_i, Xb) = {res}-0.1361{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        lwpi{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}lending {c |}{col 14}{res}{space 2}-.1369421{col 26}{space 2} .0073967{col 37}{space 1}  -18.51{col 46}{space 3}0.000{col 54}{space 4}-.1515557{col 67}{space 3}-.1223285
{txt}{space 9}mui {c |}{col 14}{res}{space 2} .0687111{col 26}{space 2} .0219402{col 37}{space 1}    3.13{col 46}{space 3}0.002{col 54}{space 4} .0253639{col 67}{space 3} .1120583
{txt}{space 4}wa_cr44d {c |}{col 14}{res}{space 2} .0946567{col 26}{space 2} .1703093{col 37}{space 1}    0.56{col 46}{space 3}0.579{col 54}{space 4}-.2418223{col 67}{space 3} .4311357
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 6.982446{col 26}{space 2} .1489217{col 37}{space 1}   46.89{col 46}{space 3}0.000{col 54}{space 4} 6.688222{col 67}{space 3} 7.276669
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .08135415
     {txt}sigma_e {c |} {res} .22021351
         {txt}rho {c |} {res} .12009071{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}12{txt}, {res}152{txt}) = {res}1.12{col 62}{txt}Prob > F = {res}0.3505
{txt}
{com}. outreg2 using "reg/regawpi.xls",excel replace
{txt}{browse `"reg/regawpi.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "reg/regawpi.txt""':seeout}

{com}. 
. xtreg lwpi birate mui wa_cr44d,fe
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}       168
{txt}Group variable: {res}disic4_4{txt}{col 49}Number of groups{col 67}={col 69}{res}        13

{txt}R-squared:{col 49}Obs per group:
     Within  = {res}0.6036{col 63}{txt}min{col 67}={col 69}{res}        12
{txt}     Between = {res}0.0000{col 63}{txt}avg{col 67}={col 69}{res}      12.9
{txt}     Overall = {res}0.5694{col 63}{txt}max{col 67}={col 69}{res}        13

{txt}{col 49}F({res}3{txt},{res}152{txt}){col 67}={col 70}{res}    77.16
{txt}corr(u_i, Xb) = {res}-0.1638{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        lwpi{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}birate {c |}{col 14}{res}{space 2}-.0893647{col 26}{space 2} .0061134{col 37}{space 1}  -14.62{col 46}{space 3}0.000{col 54}{space 4}-.1014428{col 67}{space 3}-.0772866
{txt}{space 9}mui {c |}{col 14}{res}{space 2} .0792585{col 26}{space 2} .0254787{col 37}{space 1}    3.11{col 46}{space 3}0.002{col 54}{space 4} .0289203{col 67}{space 3} .1295966
{txt}{space 4}wa_cr44d {c |}{col 14}{res}{space 2}-.0260198{col 26}{space 2} .1981225{col 37}{space 1}   -0.13{col 46}{space 3}0.896{col 54}{space 4}-.4174492{col 67}{space 3} .3654097
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5.804711{col 26}{space 2} .1275013{col 37}{space 1}   45.53{col 46}{space 3}0.000{col 54}{space 4} 5.552807{col 67}{space 3} 6.056614
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .08221265
     {txt}sigma_e {c |} {res}  .2561486
         {txt}rho {c |} {res} .09339261{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}12{txt}, {res}152{txt}) = {res}0.86{col 62}{txt}Prob > F = {res}0.5894
{txt}
{com}. outreg2 using "reg/regawpibi.xls",excel replace
{txt}{browse `"reg/regawpibi.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "reg/regawpibi.txt""':seeout}

{com}. 
. // lags
. 
. xtreg lwpi L.lending mui wa_cr44d,fe
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}       155
{txt}Group variable: {res}disic4_4{txt}{col 49}Number of groups{col 67}={col 69}{res}        13

{txt}R-squared:{col 49}Obs per group:
     Within  = {res}0.6959{col 63}{txt}min{col 67}={col 69}{res}        11
{txt}     Between = {res}0.0014{col 63}{txt}avg{col 67}={col 69}{res}      11.9
{txt}     Overall = {res}0.6581{col 63}{txt}max{col 67}={col 69}{res}        12

{txt}{col 49}F({res}3{txt},{res}139{txt}){col 67}={col 70}{res}   106.01
{txt}corr(u_i, Xb) = {res}-0.1469{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        lwpi{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}lending {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} -.137084{col 26}{space 2} .0078914{col 37}{space 1}  -17.37{col 46}{space 3}0.000{col 54}{space 4}-.1526866{col 67}{space 3}-.1214814
{txt}{space 12} {c |}
{space 9}mui {c |}{col 14}{res}{space 2} .0737928{col 26}{space 2} .0227378{col 37}{space 1}    3.25{col 46}{space 3}0.001{col 54}{space 4} .0288361{col 67}{space 3} .1187495
{txt}{space 4}wa_cr44d {c |}{col 14}{res}{space 2}-.0295057{col 26}{space 2} .1715791{col 37}{space 1}   -0.17{col 46}{space 3}0.864{col 54}{space 4}-.3687481{col 67}{space 3} .3097367
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 7.108949{col 26}{space 2} .1601046{col 37}{space 1}   44.40{col 46}{space 3}0.000{col 54}{space 4} 6.792393{col 67}{space 3} 7.425504
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .08156305
     {txt}sigma_e {c |} {res} .21454579
         {txt}rho {c |} {res} .12627608{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}12{txt}, {res}139{txt}) = {res}1.13{col 62}{txt}Prob > F = {res}0.3410
{txt}
{com}. outreg2 using "reg/regawpil.xls",excel replace
{txt}{browse `"reg/regawpil.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "reg/regawpil.txt""':seeout}

{com}. 
. xtreg lwpi L.birate mui wa_cr44d,fe
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}       155
{txt}Group variable: {res}disic4_4{txt}{col 49}Number of groups{col 67}={col 69}{res}        13

{txt}R-squared:{col 49}Obs per group:
     Within  = {res}0.5552{col 63}{txt}min{col 67}={col 69}{res}        11
{txt}     Between = {res}0.0003{col 63}{txt}avg{col 67}={col 69}{res}      11.9
{txt}     Overall = {res}0.5145{col 63}{txt}max{col 67}={col 69}{res}        12

{txt}{col 49}F({res}3{txt},{res}139{txt}){col 67}={col 70}{res}    57.84
{txt}corr(u_i, Xb) = {res}-0.1825{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        lwpi{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}birate {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}-.0846066{col 26}{space 2}  .006639{col 37}{space 1}  -12.74{col 46}{space 3}0.000{col 54}{space 4}-.0977332{col 67}{space 3}-.0714801
{txt}{space 12} {c |}
{space 9}mui {c |}{col 14}{res}{space 2} .0788987{col 26}{space 2} .0274902{col 37}{space 1}    2.87{col 46}{space 3}0.005{col 54}{space 4} .0245456{col 67}{space 3} .1332518
{txt}{space 4}wa_cr44d {c |}{col 14}{res}{space 2} .0286912{col 26}{space 2} .2073087{col 37}{space 1}    0.14{col 46}{space 3}0.890{col 54}{space 4} -.381195{col 67}{space 3} .4385774
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5.803995{col 26}{space 2} .1362855{col 37}{space 1}   42.59{col 46}{space 3}0.000{col 54}{space 4} 5.534535{col 67}{space 3} 6.073456
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .08721186
     {txt}sigma_e {c |} {res}  .2594467
         {txt}rho {c |} {res} .10152244{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}12{txt}, {res}139{txt}) = {res}0.85{col 62}{txt}Prob > F = {res}0.5991
{txt}
{com}. outreg2 using "reg/regawpibil.xls",excel replace
{txt}{browse `"reg/regawpibil.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "reg/regawpibil.txt""':seeout}

{com}. 
. // 17-21
. 
. use tfpd,clear
{txt}
{com}. 
. xtset Noobs year
{res}
{col 1}{txt:Panel variable: }{res:Noobs}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2017}}{txt: to }{res:{bind:2021}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}
{com}. xtreg pcm mu lending wa_cr44d i.Disic4,fe
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}    31,624
{txt}Group variable: {res}Noobs{txt}{col 49}Number of groups{col 67}={col 69}{res}     9,992

{txt}R-squared:{col 49}Obs per group:
     Within  = {res}0.1653{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     Between = {res}0.1616{col 63}{txt}avg{col 67}={col 69}{res}       3.2
{txt}     Overall = {res}0.1611{col 63}{txt}max{col 67}={col 69}{res}         5

{txt}{col 49}F({res}32{txt},{res}21600{txt}){col 67}={col 70}{res}   133.72
{txt}corr(u_i, Xb) = {res}-0.1039{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         pcm{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}mu {c |}{col 14}{res}{space 2} .1489585{col 26}{space 2} .0022924{col 37}{space 1}   64.98{col 46}{space 3}0.000{col 54}{space 4} .1444652{col 67}{space 3} .1534517
{txt}{space 5}lending {c |}{col 14}{res}{space 2}-.0018136{col 26}{space 2} .0074963{col 37}{space 1}   -0.24{col 46}{space 3}0.809{col 54}{space 4}-.0165069{col 67}{space 3} .0128797
{txt}{space 4}wa_cr44d {c |}{col 14}{res}{space 2} .1159009{col 26}{space 2} .0737948{col 37}{space 1}    1.57{col 46}{space 3}0.116{col 54}{space 4}-.0287424{col 67}{space 3} .2605442
{txt}{space 12} {c |}
{space 6}Disic4 {c |}
{space 7}1012  {c |}{col 14}{res}{space 2} .0727893{col 26}{space 2} .4257672{col 37}{space 1}    0.17{col 46}{space 3}0.864{col 54}{space 4}-.7617458{col 67}{space 3} .9073245
{txt}{space 7}1013  {c |}{col 14}{res}{space 2} .0134584{col 26}{space 2} .4332831{col 37}{space 1}    0.03{col 46}{space 3}0.975{col 54}{space 4}-.8358084{col 67}{space 3} .8627252
{txt}{space 7}1021  {c |}{col 14}{res}{space 2}-.0030029{col 26}{space 2} .4364792{col 37}{space 1}   -0.01{col 46}{space 3}0.995{col 54}{space 4}-.8585343{col 67}{space 3} .8525285
{txt}{space 7}1022  {c |}{col 14}{res}{space 2}-.1052974{col 26}{space 2} .4455122{col 37}{space 1}   -0.24{col 46}{space 3}0.813{col 54}{space 4}-.9785343{col 67}{space 3} .7679394
{txt}{space 7}1029  {c |}{col 14}{res}{space 2} .0381485{col 26}{space 2} .4388687{col 37}{space 1}    0.09{col 46}{space 3}0.931{col 54}{space 4}-.8220666{col 67}{space 3} .8983636
{txt}{space 7}1031  {c |}{col 14}{res}{space 2}-.1246221{col 26}{space 2} .4535038{col 37}{space 1}   -0.27{col 46}{space 3}0.783{col 54}{space 4}-1.013523{col 67}{space 3} .7642787
{txt}{space 7}1032  {c |}{col 14}{res}{space 2}-.5337842{col 26}{space 2} .5585318{col 37}{space 1}   -0.96{col 46}{space 3}0.339{col 54}{space 4}-1.628548{col 67}{space 3} .5609795
{txt}{space 7}1033  {c |}{col 14}{res}{space 2} .0151834{col 26}{space 2} .5697006{col 37}{space 1}    0.03{col 46}{space 3}0.979{col 54}{space 4}-1.101472{col 67}{space 3} 1.131839
{txt}{space 7}1039  {c |}{col 14}{res}{space 2} .0554772{col 26}{space 2} .4586657{col 37}{space 1}    0.12{col 46}{space 3}0.904{col 54}{space 4}-.8435414{col 67}{space 3} .9544958
{txt}{space 7}1041  {c |}{col 14}{res}{space 2} .1446598{col 26}{space 2}  .502027{col 37}{space 1}    0.29{col 46}{space 3}0.773{col 54}{space 4}-.8393502{col 67}{space 3}  1.12867
{txt}{space 7}1042  {c |}{col 14}{res}{space 2}  .055446{col 26}{space 2} .4762978{col 37}{space 1}    0.12{col 46}{space 3}0.907{col 54}{space 4}-.8781329{col 67}{space 3} .9890249
{txt}{space 7}1043  {c |}{col 14}{res}{space 2}-.3674619{col 26}{space 2} .4916815{col 37}{space 1}   -0.75{col 46}{space 3}0.455{col 54}{space 4}-1.331194{col 67}{space 3} .5962702
{txt}{space 7}1049  {c |}{col 14}{res}{space 2} .1911873{col 26}{space 2} .5756118{col 37}{space 1}    0.33{col 46}{space 3}0.740{col 54}{space 4}-.9370542{col 67}{space 3} 1.319429
{txt}{space 7}1051  {c |}{col 14}{res}{space 2} .1063319{col 26}{space 2} .5728893{col 37}{space 1}    0.19{col 46}{space 3}0.853{col 54}{space 4}-1.016573{col 67}{space 3} 1.229237
{txt}{space 7}1052  {c |}{col 14}{res}{space 2}  1.22978{col 26}{space 2}  .918582{col 37}{space 1}    1.34{col 46}{space 3}0.181{col 54}{space 4}-.5707088{col 67}{space 3} 3.030268
{txt}{space 7}1053  {c |}{col 14}{res}{space 2} .3918079{col 26}{space 2}  .617589{col 37}{space 1}    0.63{col 46}{space 3}0.526{col 54}{space 4}-.8187122{col 67}{space 3} 1.602328
{txt}{space 7}1059  {c |}{col 14}{res}{space 2} .3009916{col 26}{space 2} .5681067{col 37}{space 1}    0.53{col 46}{space 3}0.596{col 54}{space 4}-.8125394{col 67}{space 3} 1.414523
{txt}{space 7}1061  {c |}{col 14}{res}{space 2} .1865313{col 26}{space 2}  .457835{col 37}{space 1}    0.41{col 46}{space 3}0.684{col 54}{space 4}-.7108591{col 67}{space 3} 1.083922
{txt}{space 7}1062  {c |}{col 14}{res}{space 2} .2177045{col 26}{space 2} .4726238{col 37}{space 1}    0.46{col 46}{space 3}0.645{col 54}{space 4} -.708673{col 67}{space 3} 1.144082
{txt}{space 7}1063  {c |}{col 14}{res}{space 2}  .030596{col 26}{space 2} .4941345{col 37}{space 1}    0.06{col 46}{space 3}0.951{col 54}{space 4} -.937944{col 67}{space 3} .9991361
{txt}{space 7}1071  {c |}{col 14}{res}{space 2} .0806593{col 26}{space 2} .4445328{col 37}{space 1}    0.18{col 46}{space 3}0.856{col 54}{space 4}-.7906577{col 67}{space 3} .9519764
{txt}{space 7}1072  {c |}{col 14}{res}{space 2} -.036487{col 26}{space 2} .4692831{col 37}{space 1}   -0.08{col 46}{space 3}0.938{col 54}{space 4}-.9563166{col 67}{space 3} .8833426
{txt}{space 7}1073  {c |}{col 14}{res}{space 2} .0677183{col 26}{space 2} .4592791{col 37}{space 1}    0.15{col 46}{space 3}0.883{col 54}{space 4}-.8325027{col 67}{space 3} .9679394
{txt}{space 7}1074  {c |}{col 14}{res}{space 2}-.1444376{col 26}{space 2} .4507423{col 37}{space 1}   -0.32{col 46}{space 3}0.749{col 54}{space 4}-1.027926{col 67}{space 3} .7390505
{txt}{space 7}1075  {c |}{col 14}{res}{space 2}-.0741648{col 26}{space 2} .4422941{col 37}{space 1}   -0.17{col 46}{space 3}0.867{col 54}{space 4} -.941094{col 67}{space 3} .7927643
{txt}{space 7}1076  {c |}{col 14}{res}{space 2}-.1809044{col 26}{space 2}  .478343{col 37}{space 1}   -0.38{col 46}{space 3}0.705{col 54}{space 4}-1.118492{col 67}{space 3} .7566831
{txt}{space 7}1077  {c |}{col 14}{res}{space 2}  .126789{col 26}{space 2} .4453111{col 37}{space 1}    0.28{col 46}{space 3}0.776{col 54}{space 4}-.7460536{col 67}{space 3} .9996317
{txt}{space 7}1079  {c |}{col 14}{res}{space 2}-.0242987{col 26}{space 2} .4427761{col 37}{space 1}   -0.05{col 46}{space 3}0.956{col 54}{space 4}-.8921725{col 67}{space 3}  .843575
{txt}{space 7}1080  {c |}{col 14}{res}{space 2}-.1278913{col 26}{space 2}    .5123{col 37}{space 1}   -0.25{col 46}{space 3}0.803{col 54}{space 4}-1.132037{col 67}{space 3} .8762545
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0047103{col 26}{space 2} .4505931{col 37}{space 1}    0.01{col 46}{space 3}0.992{col 54}{space 4}-.8784854{col 67}{space 3}  .887906
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .81878052
     {txt}sigma_e {c |} {res} .87014442
         {txt}rho {c |} {res} .46961591{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}9991{txt}, {res}21600{txt}) = {res}1.81{col 62}{txt}Prob > F = {res}0.0000
{txt}
{com}. outreg2 using "reg/regbpcmfirm.xls",excel replace
{txt}{browse `"reg/regbpcmfirm.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "reg/regbpcmfirm.txt""':seeout}

{com}. 
. duplicates drop Disic4 year,force

{p 0 4}{txt}Duplicates in terms of {res} Disic4 year{p_end}

{txt}(31,602 observations deleted)

{com}. xtset Disic4 year
{res}
{col 1}{txt:Panel variable: }{res:Disic4}{txt: (strongly balanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2017}}{txt: to }{res:{bind:2021}}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}
{com}. xtreg mui tfpi wa_cr44d,fe
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}       144
{txt}Group variable: {res}Disic4{txt}{col 49}Number of groups{col 67}={col 69}{res}        30

{txt}R-squared:{col 49}Obs per group:
     Within  = {res}0.0693{col 63}{txt}min{col 67}={col 69}{res}         3
{txt}     Between = {res}0.1040{col 63}{txt}avg{col 67}={col 69}{res}       4.8
{txt}     Overall = {res}0.0092{col 63}{txt}max{col 67}={col 69}{res}         5

{txt}{col 49}F({res}2{txt},{res}112{txt}){col 67}={col 70}{res}     4.17
{txt}corr(u_i, Xb) = {res}-0.6058{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0179

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         mui{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}tfpi {c |}{col 14}{res}{space 2}-.3514401{col 26}{space 2} .3202011{col 37}{space 1}   -1.10{col 46}{space 3}0.275{col 54}{space 4}-.9858774{col 67}{space 3} .2829973
{txt}{space 4}wa_cr44d {c |}{col 14}{res}{space 2} 5.184853{col 26}{space 2} 2.003202{col 37}{space 1}    2.59{col 46}{space 3}0.011{col 54}{space 4} 1.215765{col 67}{space 3}  9.15394
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5.452858{col 26}{space 2} 2.618122{col 37}{space 1}    2.08{col 46}{space 3}0.040{col 54}{space 4} .2653854{col 67}{space 3} 10.64033
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} 2.5528356
     {txt}sigma_e {c |} {res} 1.9217523
         {txt}rho {c |} {res} .63828646{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}29{txt}, {res}112{txt}) = {res}4.51{col 62}{txt}Prob > F = {res}0.0000
{txt}
{com}. outreg2 using "reg/regbcr4.xls",excel replace
{txt}{browse `"reg/regbcr4.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "reg/regbcr4.txt""':seeout}

{com}. 
. //xtreg mui tfp wa_hhi4d_y,fe
. //outreg2 using "reg/regbhhi.xls",excel replace
. 
. 
. 
. xtreg wa_pcm lending mui wa_cr44d,fe
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}       146
{txt}Group variable: {res}Disic4{txt}{col 49}Number of groups{col 67}={col 69}{res}        30

{txt}R-squared:{col 49}Obs per group:
     Within  = {res}0.1001{col 63}{txt}min{col 67}={col 69}{res}         3
{txt}     Between = {res}0.0013{col 63}{txt}avg{col 67}={col 69}{res}       4.9
{txt}     Overall = {res}0.0149{col 63}{txt}max{col 67}={col 69}{res}         5

{txt}{col 49}F({res}3{txt},{res}113{txt}){col 67}={col 70}{res}     4.19
{txt}corr(u_i, Xb) = {res}-0.6714{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0075

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      wa_pcm{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}lending {c |}{col 14}{res}{space 2} .8493486{col 26}{space 2} 1.176101{col 37}{space 1}    0.72{col 46}{space 3}0.472{col 54}{space 4} -1.48072{col 67}{space 3} 3.179418
{txt}{space 9}mui {c |}{col 14}{res}{space 2}  .943621{col 26}{space 2} .5022425{col 37}{space 1}    1.88{col 46}{space 3}0.063{col 54}{space 4}-.0514121{col 67}{space 3} 1.938654
{txt}{space 4}wa_cr44d {c |}{col 14}{res}{space 2} 27.41644{col 26}{space 2} 11.49956{col 37}{space 1}    2.38{col 46}{space 3}0.019{col 54}{space 4} 4.633735{col 67}{space 3} 50.19915
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-26.27117{col 26}{space 2} 13.68498{col 37}{space 1}   -1.92{col 46}{space 3}0.057{col 54}{space 4}-53.38359{col 67}{space 3} .8412563
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} 7.8984806
     {txt}sigma_e {c |} {res} 10.787423
         {txt}rho {c |} {res} .34900379{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}29{txt}, {res}113{txt}) = {res}1.20{col 62}{txt}Prob > F = {res}0.2482
{txt}
{com}. outreg2 using "reg/regbpcmind.xls",excel replace
{txt}{browse `"reg/regbpcmind.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "reg/regbpcmind.txt""':seeout}

{com}. 
. gen lwpi=log(wpi)
{txt}(24 missing values generated)

{com}. 
. //no lags
. 
. xtreg lwpi lending mui tfpi wa_cr44d,fe
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}       123
{txt}Group variable: {res}Disic4{txt}{col 49}Number of groups{col 67}={col 69}{res}        28

{txt}R-squared:{col 49}Obs per group:
     Within  = {res}0.5564{col 63}{txt}min{col 67}={col 69}{res}         2
{txt}     Between = {res}0.3781{col 63}{txt}avg{col 67}={col 69}{res}       4.4
{txt}     Overall = {res}0.4279{col 63}{txt}max{col 67}={col 69}{res}         5

{txt}{col 49}F({res}4{txt},{res}91{txt}){col 67}={col 70}{res}    28.53
{txt}corr(u_i, Xb) = {res}0.1041{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        lwpi{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}lending {c |}{col 14}{res}{space 2} .1931462{col 26}{space 2} .0183031{col 37}{space 1}   10.55{col 46}{space 3}0.000{col 54}{space 4} .1567894{col 67}{space 3} .2295031
{txt}{space 9}mui {c |}{col 14}{res}{space 2}-.0011306{col 26}{space 2} .0083605{col 37}{space 1}   -0.14{col 46}{space 3}0.893{col 54}{space 4}-.0177376{col 67}{space 3} .0154764
{txt}{space 8}tfpi {c |}{col 14}{res}{space 2}-.0259923{col 26}{space 2}  .029957{col 37}{space 1}   -0.87{col 46}{space 3}0.388{col 54}{space 4}-.0854983{col 67}{space 3} .0335136
{txt}{space 4}wa_cr44d {c |}{col 14}{res}{space 2}-.0176327{col 26}{space 2}  .176003{col 37}{space 1}   -0.10{col 46}{space 3}0.920{col 54}{space 4}-.3672409{col 67}{space 3} .3319756
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 3.138049{col 26}{space 2} .2687146{col 37}{space 1}   11.68{col 46}{space 3}0.000{col 54}{space 4} 2.604281{col 67}{space 3} 3.671818
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .17356822
     {txt}sigma_e {c |} {res} .14629537
         {txt}rho {c |} {res}  .5846486{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}27{txt}, {res}91{txt}) = {res}4.38{col 62}{txt}Prob > F = {res}0.0000
{txt}
{com}. outreg2 using "reg/regbwpi.xls",excel replace
{txt}{browse `"reg/regbwpi.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "reg/regbwpi.txt""':seeout}

{com}. 
. xtreg lwpi L.birate mui tfpi wa_cr44d,fe
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}        99
{txt}Group variable: {res}Disic4{txt}{col 49}Number of groups{col 67}={col 69}{res}        28

{txt}R-squared:{col 49}Obs per group:
     Within  = {res}0.0273{col 63}{txt}min{col 67}={col 69}{res}         2
{txt}     Between = {res}0.0190{col 63}{txt}avg{col 67}={col 69}{res}       3.5
{txt}     Overall = {res}0.0259{col 63}{txt}max{col 67}={col 69}{res}         4

{txt}{col 49}F({res}4{txt},{res}67{txt}){col 67}={col 70}{res}     0.47
{txt}corr(u_i, Xb) = {res}-0.1662{txt}{col 49}Prob > F{col 67}={col 73}{res}0.7572

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        lwpi{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}birate {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}-.0464549{col 26}{space 2} .0456019{col 37}{space 1}   -1.02{col 46}{space 3}0.312{col 54}{space 4}-.1374766{col 67}{space 3} .0445668
{txt}{space 12} {c |}
{space 9}mui {c |}{col 14}{res}{space 2} .0001706{col 26}{space 2} .0205167{col 37}{space 1}    0.01{col 46}{space 3}0.993{col 54}{space 4}-.0407809{col 67}{space 3} .0411222
{txt}{space 8}tfpi {c |}{col 14}{res}{space 2}-.0409932{col 26}{space 2} .0677438{col 37}{space 1}   -0.61{col 46}{space 3}0.547{col 54}{space 4}-.1762104{col 67}{space 3} .0942239
{txt}{space 4}wa_cr44d {c |}{col 14}{res}{space 2}  .063776{col 26}{space 2} .3672334{col 37}{space 1}    0.17{col 46}{space 3}0.863{col 54}{space 4}-.6692249{col 67}{space 3}  .796777
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  5.32426{col 26}{space 2} .5176193{col 37}{space 1}   10.29{col 46}{space 3}0.000{col 54}{space 4} 4.291087{col 67}{space 3} 6.357432
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .21223051
     {txt}sigma_e {c |} {res} .22810886
         {txt}rho {c |} {res} .46398747{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}27{txt}, {res}67{txt}) = {res}1.82{col 62}{txt}Prob > F = {res}0.0254
{txt}
{com}. outreg2 using "reg/regbwpibi.xls",excel replace
{txt}{browse `"reg/regbwpibi.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "reg/regbwpibi.txt""':seeout}

{com}. 
. // lags
. 
. xtreg lwpi lending mui tfpi wa_cr44d,fe
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}       123
{txt}Group variable: {res}Disic4{txt}{col 49}Number of groups{col 67}={col 69}{res}        28

{txt}R-squared:{col 49}Obs per group:
     Within  = {res}0.5564{col 63}{txt}min{col 67}={col 69}{res}         2
{txt}     Between = {res}0.3781{col 63}{txt}avg{col 67}={col 69}{res}       4.4
{txt}     Overall = {res}0.4279{col 63}{txt}max{col 67}={col 69}{res}         5

{txt}{col 49}F({res}4{txt},{res}91{txt}){col 67}={col 70}{res}    28.53
{txt}corr(u_i, Xb) = {res}0.1041{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        lwpi{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}lending {c |}{col 14}{res}{space 2} .1931462{col 26}{space 2} .0183031{col 37}{space 1}   10.55{col 46}{space 3}0.000{col 54}{space 4} .1567894{col 67}{space 3} .2295031
{txt}{space 9}mui {c |}{col 14}{res}{space 2}-.0011306{col 26}{space 2} .0083605{col 37}{space 1}   -0.14{col 46}{space 3}0.893{col 54}{space 4}-.0177376{col 67}{space 3} .0154764
{txt}{space 8}tfpi {c |}{col 14}{res}{space 2}-.0259923{col 26}{space 2}  .029957{col 37}{space 1}   -0.87{col 46}{space 3}0.388{col 54}{space 4}-.0854983{col 67}{space 3} .0335136
{txt}{space 4}wa_cr44d {c |}{col 14}{res}{space 2}-.0176327{col 26}{space 2}  .176003{col 37}{space 1}   -0.10{col 46}{space 3}0.920{col 54}{space 4}-.3672409{col 67}{space 3} .3319756
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 3.138049{col 26}{space 2} .2687146{col 37}{space 1}   11.68{col 46}{space 3}0.000{col 54}{space 4} 2.604281{col 67}{space 3} 3.671818
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .17356822
     {txt}sigma_e {c |} {res} .14629537
         {txt}rho {c |} {res}  .5846486{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}27{txt}, {res}91{txt}) = {res}4.38{col 62}{txt}Prob > F = {res}0.0000
{txt}
{com}. outreg2 using "reg/regbwpi.xls",excel replace
{txt}{browse `"reg/regbwpi.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "reg/regbwpi.txt""':seeout}

{com}. 
. xtreg lwpi L.birate mui tfpi wa_cr44d,fe
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}        99
{txt}Group variable: {res}Disic4{txt}{col 49}Number of groups{col 67}={col 69}{res}        28

{txt}R-squared:{col 49}Obs per group:
     Within  = {res}0.0273{col 63}{txt}min{col 67}={col 69}{res}         2
{txt}     Between = {res}0.0190{col 63}{txt}avg{col 67}={col 69}{res}       3.5
{txt}     Overall = {res}0.0259{col 63}{txt}max{col 67}={col 69}{res}         4

{txt}{col 49}F({res}4{txt},{res}67{txt}){col 67}={col 70}{res}     0.47
{txt}corr(u_i, Xb) = {res}-0.1662{txt}{col 49}Prob > F{col 67}={col 73}{res}0.7572

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        lwpi{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}birate {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}-.0464549{col 26}{space 2} .0456019{col 37}{space 1}   -1.02{col 46}{space 3}0.312{col 54}{space 4}-.1374766{col 67}{space 3} .0445668
{txt}{space 12} {c |}
{space 9}mui {c |}{col 14}{res}{space 2} .0001706{col 26}{space 2} .0205167{col 37}{space 1}    0.01{col 46}{space 3}0.993{col 54}{space 4}-.0407809{col 67}{space 3} .0411222
{txt}{space 8}tfpi {c |}{col 14}{res}{space 2}-.0409932{col 26}{space 2} .0677438{col 37}{space 1}   -0.61{col 46}{space 3}0.547{col 54}{space 4}-.1762104{col 67}{space 3} .0942239
{txt}{space 4}wa_cr44d {c |}{col 14}{res}{space 2}  .063776{col 26}{space 2} .3672334{col 37}{space 1}    0.17{col 46}{space 3}0.863{col 54}{space 4}-.6692249{col 67}{space 3}  .796777
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  5.32426{col 26}{space 2} .5176193{col 37}{space 1}   10.29{col 46}{space 3}0.000{col 54}{space 4} 4.291087{col 67}{space 3} 6.357432
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .21223051
     {txt}sigma_e {c |} {res} .22810886
         {txt}rho {c |} {res} .46398747{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}27{txt}, {res}67{txt}) = {res}1.82{col 62}{txt}Prob > F = {res}0.0254
{txt}
{com}. outreg2 using "reg/regbwpibi.xls",excel replace
{txt}{browse `"reg/regbwpibi.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "reg/regbwpibi.txt""':seeout}

{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\github\foodbi\regression.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 2 Nov 2023, 16:42:28
{txt}{.-}
{smcl}
{txt}{sf}{ul off}