{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\github\foodbi\regression.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 1 Nov 2023, 17:32:37
{txt}
{com}. 
. cd "C:\github\foodbi"
{res}C:\github\foodbi
{txt}
{com}. 
. // 00-15
. use tfpa,clear
{txt}
{com}. 
. xtset psid year
{res}
{col 1}{txt:Panel variable: }{res:psid}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2000}}{txt: to }{res:{bind:2015}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}
{com}. xtreg mu tfp wa_cr44d i.disic3_4,fe
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}    47,017
{txt}Group variable: {res}psid{txt}{col 49}Number of groups{col 67}={col 69}{res}     8,438

{txt}R-squared:{col 49}Obs per group:
     Within  = {res}0.0351{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     Between = {res}0.2544{col 63}{txt}avg{col 67}={col 69}{res}       5.6
{txt}     Overall = {res}0.1631{col 63}{txt}max{col 67}={col 69}{res}        15

{txt}{col 49}F({res}9{txt},{res}38570{txt}){col 67}={col 70}{res}   155.99
{txt}corr(u_i, Xb) = {res}0.0435{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         mu1{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}tfp {c |}{col 14}{res}{space 2} .4782385{col 26}{space 2}   .01308{col 37}{space 1}   36.56{col 46}{space 3}0.000{col 54}{space 4} .4526014{col 67}{space 3} .5038755
{txt}{space 4}wa_cr44d {c |}{col 14}{res}{space 2}-.0349603{col 26}{space 2} .0533674{col 37}{space 1}   -0.66{col 46}{space 3}0.512{col 54}{space 4}-.1395619{col 67}{space 3} .0696412
{txt}{space 12} {c |}
{space 4}disic3_4 {c |}
{space 8}102  {c |}{col 14}{res}{space 2}-1.851333{col 26}{space 2} .1579685{col 37}{space 1}  -11.72{col 46}{space 3}0.000{col 54}{space 4}-2.160955{col 67}{space 3}-1.541711
{txt}{space 8}103  {c |}{col 14}{res}{space 2}-2.289786{col 26}{space 2} .1784651{col 37}{space 1}  -12.83{col 46}{space 3}0.000{col 54}{space 4}-2.639582{col 67}{space 3} -1.93999
{txt}{space 8}104  {c |}{col 14}{res}{space 2}-3.103629{col 26}{space 2} .2424192{col 37}{space 1}  -12.80{col 46}{space 3}0.000{col 54}{space 4}-3.578776{col 67}{space 3}-2.628481
{txt}{space 8}105  {c |}{col 14}{res}{space 2} -2.35925{col 26}{space 2} .2956715{col 37}{space 1}   -7.98{col 46}{space 3}0.000{col 54}{space 4}-2.938773{col 67}{space 3}-1.779726
{txt}{space 8}106  {c |}{col 14}{res}{space 2}-2.310699{col 26}{space 2} .1735574{col 37}{space 1}  -13.31{col 46}{space 3}0.000{col 54}{space 4}-2.650876{col 67}{space 3}-1.970522
{txt}{space 8}107  {c |}{col 14}{res}{space 2} -2.92079{col 26}{space 2} .1603972{col 37}{space 1}  -18.21{col 46}{space 3}0.000{col 54}{space 4}-3.235172{col 67}{space 3}-2.606407
{txt}{space 8}108  {c |}{col 14}{res}{space 2}-2.163224{col 26}{space 2} .2409249{col 37}{space 1}   -8.98{col 46}{space 3}0.000{col 54}{space 4}-2.635443{col 67}{space 3}-1.691005
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .4524602{col 26}{space 2}  .159624{col 37}{space 1}    2.83{col 46}{space 3}0.005{col 54}{space 4} .1395932{col 67}{space 3} .7653273
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} 1.0528716
     {txt}sigma_e {c |} {res} 1.1771395
         {txt}rho {c |} {res} .44444726{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}8437{txt}, {res}38570{txt}) = {res}2.47{col 62}{txt}Prob > F = {res}0.0000
{txt}
{com}. outreg2 using "reg/regacr4.xls",excel replace
{txt}{browse `"reg/regacr4.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "reg/regacr4.txt""':seeout}

{com}. 
. xtreg mu tfp wa_hhi4d_y i.ownership i.disic3_4,fe
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}    12,509
{txt}Group variable: {res}psid{txt}{col 49}Number of groups{col 67}={col 69}{res}     6,801

{txt}R-squared:{col 49}Obs per group:
     Within  = {res}0.0462{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     Between = {res}0.2521{col 63}{txt}avg{col 67}={col 69}{res}       1.8
{txt}     Overall = {res}0.1959{col 63}{txt}max{col 67}={col 69}{res}         4

{txt}{col 49}F({res}11{txt},{res}5697{txt}){col 67}={col 70}{res}    25.09
{txt}corr(u_i, Xb) = {res}-0.0280{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         mu1{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}tfp {c |}{col 14}{res}{space 2} .4345673{col 26}{space 2} .0293573{col 37}{space 1}   14.80{col 46}{space 3}0.000{col 54}{space 4} .3770158{col 67}{space 3} .4921188
{txt}{space 2}wa_hhi4d_y {c |}{col 14}{res}{space 2}-.7001669{col 26}{space 2}  .316115{col 37}{space 1}   -2.21{col 46}{space 3}0.027{col 54}{space 4}-1.319872{col 67}{space 3}-.0804613
{txt}{space 12} {c |}
{space 3}ownership {c |}
{space 3}domestic  {c |}{col 14}{res}{space 2} .6045304{col 26}{space 2} .1481336{col 37}{space 1}    4.08{col 46}{space 3}0.000{col 54}{space 4} .3141322{col 67}{space 3} .8949286
{txt}{space 8}SOE  {c |}{col 14}{res}{space 2} .7122724{col 26}{space 2} .1492032{col 37}{space 1}    4.77{col 46}{space 3}0.000{col 54}{space 4} .4197774{col 67}{space 3} 1.004767
{txt}{space 12} {c |}
{space 4}disic3_4 {c |}
{space 8}102  {c |}{col 14}{res}{space 2}-1.931052{col 26}{space 2} .3474776{col 37}{space 1}   -5.56{col 46}{space 3}0.000{col 54}{space 4} -2.61224{col 67}{space 3}-1.249864
{txt}{space 8}103  {c |}{col 14}{res}{space 2}-2.413953{col 26}{space 2}  .387647{col 37}{space 1}   -6.23{col 46}{space 3}0.000{col 54}{space 4}-3.173889{col 67}{space 3}-1.654017
{txt}{space 8}104  {c |}{col 14}{res}{space 2}-2.086145{col 26}{space 2} .6169226{col 37}{space 1}   -3.38{col 46}{space 3}0.001{col 54}{space 4}-3.295548{col 67}{space 3}-.8767416
{txt}{space 8}105  {c |}{col 14}{res}{space 2}-1.913117{col 26}{space 2} .7705195{col 37}{space 1}   -2.48{col 46}{space 3}0.013{col 54}{space 4}-3.423628{col 67}{space 3}-.4026051
{txt}{space 8}106  {c |}{col 14}{res}{space 2}-2.260539{col 26}{space 2} .3865128{col 37}{space 1}   -5.85{col 46}{space 3}0.000{col 54}{space 4}-3.018251{col 67}{space 3}-1.502827
{txt}{space 8}107  {c |}{col 14}{res}{space 2}-3.036608{col 26}{space 2} .3624926{col 37}{space 1}   -8.38{col 46}{space 3}0.000{col 54}{space 4}-3.747231{col 67}{space 3}-2.325985
{txt}{space 8}108  {c |}{col 14}{res}{space 2}-2.122463{col 26}{space 2}  .587541{col 37}{space 1}   -3.61{col 46}{space 3}0.000{col 54}{space 4}-3.274267{col 67}{space 3} -.970659
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .1815597{col 26}{space 2} .3843188{col 37}{space 1}    0.47{col 46}{space 3}0.637{col 54}{space 4}-.5718513{col 67}{space 3} .9349707
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} 1.1343549
     {txt}sigma_e {c |} {res} 1.1116761
         {txt}rho {c |} {res} .51009627{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}6800{txt}, {res}5697{txt}) = {res}1.45{col 62}{txt}Prob > F = {res}0.0000
{txt}
{com}. outreg2 using "reg/regahhi.xls",excel replace
{txt}{browse `"reg/regahhi.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "reg/regahhi.txt""':seeout}

{com}. 
. gen lwpi=log(wpio)
{txt}(15,956 missing values generated)

{com}. 
. xtreg lwpi birate mu wa_cr44d i.disic3_4,fe
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}    58,987
{txt}Group variable: {res}psid{txt}{col 49}Number of groups{col 67}={col 69}{res}     9,994

{txt}R-squared:{col 49}Obs per group:
     Within  = {res}0.4901{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     Between = {res}0.8199{col 63}{txt}avg{col 67}={col 69}{res}       5.9
{txt}     Overall = {res}0.5842{col 63}{txt}max{col 67}={col 69}{res}        13

{txt}{col 49}F({res}10{txt},{res}48983{txt}){col 67}={col 70}{res}  4707.81
{txt}corr(u_i, Xb) = {res}0.3348{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        lwpi{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}birate {c |}{col 14}{res}{space 2}-.0748187{col 26}{space 2} .0003496{col 37}{space 1} -214.03{col 46}{space 3}0.000{col 54}{space 4}-.0755038{col 67}{space 3}-.0741335
{txt}{space 9}mu1 {c |}{col 14}{res}{space 2} .0124997{col 26}{space 2} .0008423{col 37}{space 1}   14.84{col 46}{space 3}0.000{col 54}{space 4} .0108487{col 67}{space 3} .0141507
{txt}{space 4}wa_cr44d {c |}{col 14}{res}{space 2} .2361463{col 26}{space 2} .0096652{col 37}{space 1}   24.43{col 46}{space 3}0.000{col 54}{space 4} .2172023{col 67}{space 3} .2550903
{txt}{space 12} {c |}
{space 4}disic3_4 {c |}
{space 8}102  {c |}{col 14}{res}{space 2}-.0739942{col 26}{space 2}  .031908{col 37}{space 1}   -2.32{col 46}{space 3}0.020{col 54}{space 4}-.1365343{col 67}{space 3}-.0114541
{txt}{space 8}103  {c |}{col 14}{res}{space 2}-.2550606{col 26}{space 2} .0342378{col 37}{space 1}   -7.45{col 46}{space 3}0.000{col 54}{space 4}-.3221671{col 67}{space 3}-.1879541
{txt}{space 8}104  {c |}{col 14}{res}{space 2}-.0435635{col 26}{space 2} .0415726{col 37}{space 1}   -1.05{col 46}{space 3}0.295{col 54}{space 4}-.1250463{col 67}{space 3} .0379193
{txt}{space 8}105  {c |}{col 14}{res}{space 2}-.2924218{col 26}{space 2} .0481296{col 37}{space 1}   -6.08{col 46}{space 3}0.000{col 54}{space 4}-.3867566{col 67}{space 3}-.1980871
{txt}{space 8}106  {c |}{col 14}{res}{space 2}-.1857573{col 26}{space 2} .0337221{col 37}{space 1}   -5.51{col 46}{space 3}0.000{col 54}{space 4} -.251853{col 67}{space 3}-.1196616
{txt}{space 8}107  {c |}{col 14}{res}{space 2}-.1113877{col 26}{space 2} .0310764{col 37}{space 1}   -3.58{col 46}{space 3}0.000{col 54}{space 4}-.1722977{col 67}{space 3}-.0504776
{txt}{space 8}108  {c |}{col 14}{res}{space 2}-.1102893{col 26}{space 2} .0445015{col 37}{space 1}   -2.48{col 46}{space 3}0.013{col 54}{space 4}-.1975127{col 67}{space 3}-.0230658
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 5.879009{col 26}{space 2} .0307102{col 37}{space 1}  191.44{col 46}{space 3}0.000{col 54}{space 4} 5.818816{col 67}{space 3} 5.939201
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .16221768
     {txt}sigma_e {c |} {res} .22708409
         {txt}rho {c |} {res} .33787857{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}9993{txt}, {res}48983{txt}) = {res}1.51{col 62}{txt}Prob > F = {res}0.0000
{txt}
{com}. outreg2 using "reg/regawpi.xls",excel replace
{txt}{browse `"reg/regawpi.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "reg/regawpi.txt""':seeout}

{com}. 
. // 17-21
. 
. use tfpb,clear
{txt}
{com}. 
. xtset nobs year
{res}
{col 1}{txt:Panel variable: }{res:nobs}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2017}}{txt: to }{res:{bind:2021}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}
{com}. xtreg mu tfp wa_cr44d i.disic3_4,fe
{err}variable {bf}wa_cr44d{sf} not found
{txt}{search r(111), local:r(111);}

end of do-file

{search r(111), local:r(111);}

{com}. bro

. exit, clear
