{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\github\foodbi\regression.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 1 Oct 2023, 22:24:39
{txt}
{com}. 
. cd "C:\github\foodbi"
{res}C:\github\foodbi
{txt}
{com}. 
. // 00-15
. use tfpa,clear
{txt}
{com}. 
. xtset psid year
{res}
{col 1}{txt:Panel variable: }{res:psid}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2000}}{txt: to }{res:{bind:2015}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}
{com}. xtreg mu tfp wa_cr44d i.disic3_4,fe
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}    47,017
{txt}Group variable: {res}psid{txt}{col 49}Number of groups{col 67}={col 69}{res}     8,438

{txt}R-squared:{col 49}Obs per group:
     Within  = {res}0.0351{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     Between = {res}0.2544{col 63}{txt}avg{col 67}={col 69}{res}       5.6
{txt}     Overall = {res}0.1631{col 63}{txt}max{col 67}={col 69}{res}        15

{txt}{col 49}F({res}9{txt},{res}38570{txt}){col 67}={col 70}{res}   155.99
{txt}corr(u_i, Xb) = {res}0.0435{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         mu1{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}tfp {c |}{col 14}{res}{space 2} .4782486{col 26}{space 2} .0130801{col 37}{space 1}   36.56{col 46}{space 3}0.000{col 54}{space 4} .4526113{col 67}{space 3} .5038858
{txt}{space 4}wa_cr44d {c |}{col 14}{res}{space 2}-.0349493{col 26}{space 2} .0533674{col 37}{space 1}   -0.65{col 46}{space 3}0.513{col 54}{space 4}-.1395508{col 67}{space 3} .0696522
{txt}{space 12} {c |}
{space 4}disic3_4 {c |}
{space 8}102  {c |}{col 14}{res}{space 2}-1.849058{col 26}{space 2} .1579588{col 37}{space 1}  -11.71{col 46}{space 3}0.000{col 54}{space 4}-2.158661{col 67}{space 3}-1.539455
{txt}{space 8}103  {c |}{col 14}{res}{space 2}-2.285942{col 26}{space 2} .1784444{col 37}{space 1}  -12.81{col 46}{space 3}0.000{col 54}{space 4}-2.635697{col 67}{space 3}-1.936186
{txt}{space 8}104  {c |}{col 14}{res}{space 2}-3.100921{col 26}{space 2} .2424024{col 37}{space 1}  -12.79{col 46}{space 3}0.000{col 54}{space 4}-3.576036{col 67}{space 3}-2.625806
{txt}{space 8}105  {c |}{col 14}{res}{space 2}-2.354858{col 26}{space 2} .2956533{col 37}{space 1}   -7.96{col 46}{space 3}0.000{col 54}{space 4}-2.934346{col 67}{space 3} -1.77537
{txt}{space 8}106  {c |}{col 14}{res}{space 2}-2.307244{col 26}{space 2} .1735376{col 37}{space 1}  -13.30{col 46}{space 3}0.000{col 54}{space 4}-2.647383{col 67}{space 3}-1.967106
{txt}{space 8}107  {c |}{col 14}{res}{space 2}-2.916901{col 26}{space 2} .1603654{col 37}{space 1}  -18.19{col 46}{space 3}0.000{col 54}{space 4}-3.231222{col 67}{space 3}-2.602581
{txt}{space 8}108  {c |}{col 14}{res}{space 2}-2.161594{col 26}{space 2} .2409194{col 37}{space 1}   -8.97{col 46}{space 3}0.000{col 54}{space 4}-2.633803{col 67}{space 3}-1.689386
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .4488354{col 26}{space 2} .1596592{col 37}{space 1}    2.81{col 46}{space 3}0.005{col 54}{space 4} .1358994{col 67}{space 3} .7617715
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} 1.0528522
     {txt}sigma_e {c |} {res}  1.177139
         {txt}rho {c |} {res} .44443837{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}8437{txt}, {res}38570{txt}) = {res}2.47{col 62}{txt}Prob > F = {res}0.0000
{txt}
{com}. outreg2 using "reg/regacr4.xls",excel replace
{txt}{browse `"reg/regacr4.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "reg/regacr4.txt""':seeout}

{com}. 
. xtreg mu tfp wa_hhi4d_y i.ownership i.disic3_4,fe
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}    12,509
{txt}Group variable: {res}psid{txt}{col 49}Number of groups{col 67}={col 69}{res}     6,801

{txt}R-squared:{col 49}Obs per group:
     Within  = {res}0.0462{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     Between = {res}0.2521{col 63}{txt}avg{col 67}={col 69}{res}       1.8
{txt}     Overall = {res}0.1959{col 63}{txt}max{col 67}={col 69}{res}         4

{txt}{col 49}F({res}11{txt},{res}5697{txt}){col 67}={col 70}{res}    25.09
{txt}corr(u_i, Xb) = {res}-0.0280{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         mu1{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}tfp {c |}{col 14}{res}{space 2} .4345583{col 26}{space 2} .0293577{col 37}{space 1}   14.80{col 46}{space 3}0.000{col 54}{space 4}  .377006{col 67}{space 3} .4921106
{txt}{space 2}wa_hhi4d_y {c |}{col 14}{res}{space 2}-.7001393{col 26}{space 2} .3161155{col 37}{space 1}   -2.21{col 46}{space 3}0.027{col 54}{space 4}-1.319846{col 67}{space 3}-.0804326
{txt}{space 12} {c |}
{space 3}ownership {c |}
{space 3}domestic  {c |}{col 14}{res}{space 2} .6045213{col 26}{space 2} .1481338{col 37}{space 1}    4.08{col 46}{space 3}0.000{col 54}{space 4} .3141227{col 67}{space 3} .8949199
{txt}{space 8}SOE  {c |}{col 14}{res}{space 2} .7122593{col 26}{space 2} .1492034{col 37}{space 1}    4.77{col 46}{space 3}0.000{col 54}{space 4} .4197639{col 67}{space 3} 1.004755
{txt}{space 12} {c |}
{space 4}disic3_4 {c |}
{space 8}102  {c |}{col 14}{res}{space 2}-1.929067{col 26}{space 2} .3474571{col 37}{space 1}   -5.55{col 46}{space 3}0.000{col 54}{space 4}-2.610215{col 67}{space 3}-1.247919
{txt}{space 8}103  {c |}{col 14}{res}{space 2}-2.410562{col 26}{space 2} .3876039{col 37}{space 1}   -6.22{col 46}{space 3}0.000{col 54}{space 4}-3.170413{col 67}{space 3}-1.650711
{txt}{space 8}104  {c |}{col 14}{res}{space 2}-2.083764{col 26}{space 2} .6168911{col 37}{space 1}   -3.38{col 46}{space 3}0.001{col 54}{space 4}-3.293105{col 67}{space 3}-.8744226
{txt}{space 8}105  {c |}{col 14}{res}{space 2} -1.90927{col 26}{space 2} .7704868{col 37}{space 1}   -2.48{col 46}{space 3}0.013{col 54}{space 4}-3.419717{col 67}{space 3}-.3988226
{txt}{space 8}106  {c |}{col 14}{res}{space 2} -2.25752{col 26}{space 2} .3864734{col 37}{space 1}   -5.84{col 46}{space 3}0.000{col 54}{space 4}-3.015155{col 67}{space 3}-1.499885
{txt}{space 8}107  {c |}{col 14}{res}{space 2}-3.033173{col 26}{space 2} .3624274{col 37}{space 1}   -8.37{col 46}{space 3}0.000{col 54}{space 4}-3.743669{col 67}{space 3}-2.322678
{txt}{space 8}108  {c |}{col 14}{res}{space 2} -2.12106{col 26}{space 2} .5875315{col 37}{space 1}   -3.61{col 46}{space 3}0.000{col 54}{space 4}-3.272845{col 67}{space 3}-.9692748
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .1785108{col 26}{space 2} .3843907{col 37}{space 1}    0.46{col 46}{space 3}0.642{col 54}{space 4}-.5750413{col 67}{space 3} .9320629
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} 1.1343516
     {txt}sigma_e {c |} {res} 1.1116774
         {txt}rho {c |} {res} .51009417{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}6800{txt}, {res}5697{txt}) = {res}1.45{col 62}{txt}Prob > F = {res}0.0000
{txt}
{com}. outreg2 using "reg/regahhi.xls",excel replace
{txt}{browse `"reg/regahhi.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "reg/regahhi.txt""':seeout}

{com}. 
. gen lwpi=log(wpio)
{txt}(15,956 missing values generated)

{com}. 
. xtreg lwpi birate mu tfp i.disic3_4,fe
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}    36,844
{txt}Group variable: {res}psid{txt}{col 49}Number of groups{col 67}={col 69}{res}     7,664

{txt}R-squared:{col 49}Obs per group:
     Within  = {res}0.4743{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     Between = {res}0.5183{col 63}{txt}avg{col 67}={col 69}{res}       4.8
{txt}     Overall = {res}0.4742{col 63}{txt}max{col 67}={col 69}{res}        12

{txt}{col 49}F({res}10{txt},{res}29170{txt}){col 67}={col 70}{res}  2631.69
{txt}corr(u_i, Xb) = {res}-0.1022{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        lwpi{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}birate {c |}{col 14}{res}{space 2}-.0635271{col 26}{space 2} .0004718{col 37}{space 1} -134.65{col 46}{space 3}0.000{col 54}{space 4}-.0644518{col 67}{space 3}-.0626024
{txt}{space 9}mu1 {c |}{col 14}{res}{space 2} .0028694{col 26}{space 2} .0011502{col 37}{space 1}    2.49{col 46}{space 3}0.013{col 54}{space 4} .0006148{col 67}{space 3} .0051239
{txt}{space 9}tfp {c |}{col 14}{res}{space 2} .1520169{col 26}{space 2} .0033902{col 37}{space 1}   44.84{col 46}{space 3}0.000{col 54}{space 4}  .145372{col 67}{space 3} .1586617
{txt}{space 12} {c |}
{space 4}disic3_4 {c |}
{space 8}102  {c |}{col 14}{res}{space 2}-.4018128{col 26}{space 2} .0427817{col 37}{space 1}   -9.39{col 46}{space 3}0.000{col 54}{space 4} -.485667{col 67}{space 3}-.3179586
{txt}{space 8}103  {c |}{col 14}{res}{space 2}-.6070366{col 26}{space 2} .0456956{col 37}{space 1}  -13.28{col 46}{space 3}0.000{col 54}{space 4}-.6966021{col 67}{space 3} -.517471
{txt}{space 8}104  {c |}{col 14}{res}{space 2}-.7025491{col 26}{space 2} .0600704{col 37}{space 1}  -11.70{col 46}{space 3}0.000{col 54}{space 4}-.8202897{col 67}{space 3}-.5848084
{txt}{space 8}105  {c |}{col 14}{res}{space 2} -.765818{col 26}{space 2} .0706888{col 37}{space 1}  -10.83{col 46}{space 3}0.000{col 54}{space 4}-.9043712{col 67}{space 3}-.6272647
{txt}{space 8}106  {c |}{col 14}{res}{space 2}-.6057663{col 26}{space 2} .0450522{col 37}{space 1}  -13.45{col 46}{space 3}0.000{col 54}{space 4}-.6940706{col 67}{space 3} -.517462
{txt}{space 8}107  {c |}{col 14}{res}{space 2}-.6626728{col 26}{space 2} .0428769{col 37}{space 1}  -15.46{col 46}{space 3}0.000{col 54}{space 4}-.7467134{col 67}{space 3}-.5786321
{txt}{space 8}108  {c |}{col 14}{res}{space 2}-.4788311{col 26}{space 2} .0570664{col 37}{space 1}   -8.39{col 46}{space 3}0.000{col 54}{space 4}-.5906839{col 67}{space 3}-.3669783
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 5.230868{col 26}{space 2} .0426356{col 37}{space 1}  122.69{col 46}{space 3}0.000{col 54}{space 4}   5.1473{col 67}{space 3} 5.314436
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res}  .2282939
     {txt}sigma_e {c |} {res} .22489781
         {txt}rho {c |} {res} .50749329{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}7663{txt}, {res}29170{txt}) = {res}2.02{col 62}{txt}Prob > F = {res}0.0000
{txt}
{com}. outreg2 using "reg/regawpi.xls",excel replace
{txt}{browse `"reg/regawpi.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "reg/regawpi.txt""':seeout}

{com}. 
. // 17-21
. 
. use tfpb,clear
{txt}
{com}. 
. 
. 
. gen lwpi=log(wpio)
{err}wpio not found
{txt}{search r(111), local:r(111);}

end of do-file

{search r(111), local:r(111);}

{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\github\foodbi\regression.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 1 Oct 2023, 22:24:57
{txt}{.-}
{smcl}
{txt}{sf}{ul off}