{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\github\foodbi\tfplog.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 1 Oct 2023, 16:29:36
{txt}
{com}. /*
> ╔╗─────────╔═══╗╔╗────╔═══╗╔╗─────╔╗
> ║║─────────║╔══╝║║────║╔═╗╠╝╚╗───╔╝╚╗
> ║║──╔══╦══╗║╚══╦╣║╔══╗║╚══╬╗╔╬══╦╩╗╔╝
> ║║─╔╣╔╗║╔╗║║╔══╬╣║║║═╣╚══╗║║║║╔╗║╔╣║
> ║╚═╝║╚╝║╚╝║║║──║║╚╣║═╣║╚═╝║║╚╣╔╗║║║╚╗
> ╚═══╩══╩═╗║╚╝──╚╩═╩══╝╚═══╝╚═╩╝╚╩╝╚═╝
> ───────╔═╝║
> ───────╚══╝
> */
. cd "C:\github\foodbi" // Please change this to the proper working directory
{res}C:\github\foodbi
{txt}
{com}. 
. use "new_data/use/data0015.dta" // Pleace change this with the data in
{txt}
{com}. 
. xtset psid year
{res}
{col 1}{txt:Panel variable: }{res:psid}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2000}}{txt: to }{res:{bind:2015}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}
{com}. keep if disic2_4==10 // ISIC Rev. 4. For ISIC rev.3, 15
{txt}(4,985 observations deleted)

{com}. 
. gen cost=it1vcu+rdnvcu+rimvcu+efuvcu+eplvcu+enpvcu+zpdvcu+zndvcu
{txt}(1 missing value generated)

{com}. gen c2=rdnvcu+rimvcu+zpdvcu+zndvcu+it1vcu
{txt}
{com}. gen labshare=(zpdvcu+zndvcu)/cost
{txt}(1 missing value generated)

{com}. gen lab2=(zpdvcu+zndvcu)/c2
{txt}
{com}. gen ln=log(zpdvcu+zndvcu)
{txt}(1 missing value generated)

{com}. gen lk=log(v1115)
{txt}(30,867 missing values generated)

{com}. gen lo=log(output)
{txt}
{com}. gen lm=log(rdnvcu+rimvcu)
{txt}(710 missing values generated)

{com}. gen ll=log(ltlnou)
{txt}
{com}. gen lva=log(vtlvcu)
{txt}
{com}. 
. save pakai,replace
{txt}{p 0 4 2}
file {bf}
pakai.dta{rm}
saved
{p_end}

{com}. 
. prodest lva, free(ln) state(lk) proxy(lm) method(lp) fsresidual(om) va
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}    52357
{txt}Group variable (id): psid{col 49}Number of groups   = {res}     8564
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      6.1
{col 49}{txt}               max = {res}       15

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .4183988{col 26}{space 2} .0044881{col 37}{space 1}   93.22{col 46}{space 3}0.000{col 54}{space 4} .4096023{col 67}{space 3} .4271952
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .1120384{col 26}{space 2} .0052713{col 37}{space 1}   21.25{col 46}{space 3}0.000{col 54}{space 4} .1017069{col 67}{space 3} .1223699
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 2375.07
                                          p = (0.00)

{com}. outreg2 using "tfp2.xls",excel replace
{txt}{browse `"tfp2.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfp2.txt""':seeout}

{com}. 
. predict mu,markups inputvar(ln)
{txt}(1 missing value generated)

{com}. 
. predict tfp,omega
{txt}
{com}. // REMOVE OUTLIERS DUE TO FUNNY INPUT
. // outliers = 5% bot and 5% top
. sum mu,det

                             {txt}mu
{hline 61}
      Percentiles      Smallest
 1%    {res} .0699072       .0000299
{txt} 5%    {res} .4205703       .0004824
{txt}10%    {res} .4774132       .0014273       {txt}Obs         {res}     83,507
{txt}25%    {res} .6369065       .0015586       {txt}Sum of wgt. {res}     83,507

{txt}50%    {res} 1.062654                      {txt}Mean          {res} 7.063753
                        {txt}Largest       Std. dev.     {res} 189.0395
{txt}75%    {res} 2.147371       8226.549
{txt}90%    {res} 5.802135       14468.67       {txt}Variance      {res} 35735.93
{txt}95%    {res} 10.78892       16730.18       {txt}Skewness      {res} 166.6848
{txt}99%    {res} 66.62843       43776.02       {txt}Kurtosis      {res}  35692.6
{txt}
{com}. drop if mu < r(p5) | mu > r(p95)
{txt}(8,351 observations deleted)

{com}. sum mu,det

                             {txt}mu
{hline 61}
      Percentiles      Smallest
 1%    {res} .4314723       .4205703
{txt} 5%    {res} .4723672       .4205747
{txt}10%    {res} .5199187       .4205963       {txt}Obs         {res}     75,157
{txt}25%    {res}  .668201        .420634       {txt}Sum of wgt. {res}     75,157

{txt}50%    {res} 1.062654                      {txt}Mean          {res} 1.748337
                        {txt}Largest       Std. dev.     {res} 1.811976
{txt}75%    {res} 1.996111       10.77864
{txt}90%    {res} 3.886382       10.78768       {txt}Variance      {res} 3.283258
{txt}95%    {res} 6.015707       10.78864       {txt}Skewness      {res} 2.476296
{txt}99%    {res} 9.361674       10.78892       {txt}Kurtosis      {res}  9.43796
{txt}
{com}. 
. save tfp1, replace
{txt}{p 0 4 2}
file {bf}
tfp1.dta{rm}
saved
{p_end}

{com}. 
. clear
{txt}
{com}. 
. 
. import excel "C:\github\Foodbi\new_data\use\mf11krm.xlsx", sheet("Data") firstrow case(lower)
{res}{text}(53 vars, 38,332 obs)

{com}. destring year, replace
{txt}year: all characters numeric; {res}replaced {txt}as {res}int
{txt}
{com}. xtset nobs year
{res}
{col 1}{txt:Panel variable: }{res:nobs}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2017}}{txt: to }{res:{bind:2021}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}
{com}. keep if disic2=="10"
{txt}(3,052 observations deleted)

{com}. gen cost=it1vcu+rdnvcu+rimvcu+efuvcu+eplvcu+enpvcu+zpdvcu+zndvcu
{txt}
{com}. gen labshare=(zpdvcu+zndvcu)/cost
{txt}
{com}. gen ln=log(zpdvcu+zndvcu)
{txt}(2 missing values generated)

{com}. gen lk=log(v1115)
{txt}(14,584 missing values generated)

{com}. gen lo=log(output)
{txt}
{com}. gen lm=log(rdnvcu+rimvcu)
{txt}(401 missing values generated)

{com}. gen ll=log(ltlnou)
{txt}
{com}. gen lva=log(vtlvcu)
{txt}
{com}. gen disic3=substr(disic4, 1, 3)
{txt}
{com}. 
. save pakau,replace
{txt}{p 0 4 2}
file {bf}
pakau.dta{rm}
saved
{p_end}

{com}. 
. prodest lva, free(ln) state(lk) proxy(lm) method(lp) fsresidual(om) va
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}    20413
{txt}Group variable (id): nobs{col 49}Number of groups   = {res}     6288
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      3.2
{col 49}{txt}               max = {res}        5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .6766907{col 26}{space 2} .0060041{col 37}{space 1}  112.70{col 46}{space 3}0.000{col 54}{space 4} .6649229{col 67}{space 3} .6884586
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .0753702{col 26}{space 2} .0065189{col 37}{space 1}   11.56{col 46}{space 3}0.000{col 54}{space 4} .0625934{col 67}{space 3}  .088147
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 1573.13
                                          p = (0.00)

{com}. outreg2 using "tfp2.xls",excel replace
{txt}{browse `"tfp2.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfp2.txt""':seeout}

{com}. 
. predict mu,markups inputvar(ln)
{txt}(2 missing values generated)

{com}. 
. // REMOVE OUTLIERS DUE TO FUNNY INPUT
. // outliers = 5% bot and 5% top
. sum mu,det

                             {txt}mu
{hline 61}
      Percentiles      Smallest
 1%    {res} .6214978         .00639
{txt} 5%    {res} .7190008       .0107513
{txt}10%    {res}  .808042       .0199939       {txt}Obs         {res}     35,278
{txt}25%    {res} 1.148767       .0239348       {txt}Sum of wgt. {res}     35,278

{txt}50%    {res}  2.19636                      {txt}Mean          {res} 7.937924
                        {txt}Largest       Std. dev.     {res} 47.60636
{txt}75%    {res} 5.461792       1927.181
{txt}90%    {res} 13.05225       2193.324       {txt}Variance      {res} 2266.366
{txt}95%    {res}  23.5867       3506.651       {txt}Skewness      {res} 48.05747
{txt}99%    {res} 95.24677       4560.229       {txt}Kurtosis      {res} 3562.053
{txt}
{com}. drop if mu < r(p5) | mu > r(p95)
{txt}(3,528 observations deleted)

{com}. sum mu,det

                             {txt}mu
{hline 61}
      Percentiles      Smallest
 1%    {res} .7326701       .7190008
{txt} 5%    {res} .7988055       .7190165
{txt}10%    {res} .8843135       .7190192       {txt}Obs         {res}     31,752
{txt}25%    {res} 1.227097       .7192531       {txt}Sum of wgt. {res}     31,752

{txt}50%    {res}  2.19636                      {txt}Mean          {res} 3.916971
                        {txt}Largest       Std. dev.     {res} 4.240635
{txt}75%    {res} 4.705549       23.58425
{txt}90%    {res} 9.719423       23.58425       {txt}Variance      {res} 17.98299
{txt}95%    {res} 13.76901       23.58427       {txt}Skewness      {res} 2.154598
{txt}99%    {res} 19.88925        23.5867       {txt}Kurtosis      {res} 7.606108
{txt}
{com}. 
. predict ,parameters
{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .6766907{col 26}{space 2} .0060041{col 37}{space 1}  112.70{col 46}{space 3}0.000{col 54}{space 4} .6649229{col 67}{space 3} .6884586
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .0753702{col 26}{space 2} .0065189{col 37}{space 1}   11.56{col 46}{space 3}0.000{col 54}{space 4} .0625934{col 67}{space 3}  .088147
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. predict tfp,omega
{txt}
{com}. 
. save tfp2, replace
{txt}{p 0 4 2}
file {bf}
tfp2.dta{rm}
saved
{p_end}

{com}. 
. clear all
{res}{txt}
{com}. use pakai
{txt}
{com}. levelsof disic3_4,local(ids)
{res}{txt}101 102 103 104 105 106 107 108

{com}. foreach i in `ids' {c -(}
{txt}  2{com}.         clear all
{txt}  3{com}.         use pakai
{txt}  4{com}.         xtset psid year
{txt}  5{com}.         keep if disic3_4==`i'
{txt}  6{com}.         prodest lva, free(ln) state(lk) proxy(lm) method(lp) fsresidual(om) va
{txt}  7{com}.         predict tfp,omega
{txt}  8{com}.         predict mu1,markups inputvar(ln)
{txt}  9{com}.         
.         save tfpa`i',replace
{txt} 10{com}.         outreg2 using tfpa`i'.xls,replace se bdec(3) tdec(3) excel
{txt} 11{com}. 
. {c )-}
{res}
{col 1}{txt:Panel variable: }{res:psid}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2000}}{txt: to }{res:{bind:2015}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}(82,617 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}      456
{txt}Group variable (id): psid{col 49}Number of groups   = {res}      131
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      3.5
{col 49}{txt}               max = {res}       14

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .5639879{col 26}{space 2} .0416597{col 37}{space 1}   13.54{col 46}{space 3}0.000{col 54}{space 4} .4823364{col 67}{space 3} .6456394
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .1685328{col 26}{space 2} .0369234{col 37}{space 1}    4.56{col 46}{space 3}0.000{col 54}{space 4} .0961642{col 67}{space 3} .2409014
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 23.93
                                          p = (0.00)
{p 0 4 2}
file {bf}
tfpa101.dta{rm}
saved
{p_end}
{browse `"tfpa101.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpa101.txt""':seeout}
{res}
{col 1}{txt:Panel variable: }{res:psid}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2000}}{txt: to }{res:{bind:2015}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}(71,177 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}     7631
{txt}Group variable (id): psid{col 49}Number of groups   = {res}     1474
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      5.2
{col 49}{txt}               max = {res}       15

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .4096068{col 26}{space 2} .0164525{col 37}{space 1}   24.90{col 46}{space 3}0.000{col 54}{space 4} .3773606{col 67}{space 3} .4418531
{txt}{space 10}lk {c |}{col 14}{res}{space 2}  .159511{col 26}{space 2} .0245916{col 37}{space 1}    6.49{col 46}{space 3}0.000{col 54}{space 4} .1113123{col 67}{space 3} .2077097
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 146.41
                                          p = (0.00)
{p 0 4 2}
file {bf}
tfpa102.dta{rm}
saved
{p_end}
{browse `"tfpa102.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpa102.txt""':seeout}
{res}
{col 1}{txt:Panel variable: }{res:psid}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2000}}{txt: to }{res:{bind:2015}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}(82,295 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}      676
{txt}Group variable (id): psid{col 49}Number of groups   = {res}      190
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      3.6
{col 49}{txt}               max = {res}       15

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .4132295{col 26}{space 2} .0340872{col 37}{space 1}   12.12{col 46}{space 3}0.000{col 54}{space 4} .3464199{col 67}{space 3} .4800391
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .1258762{col 26}{space 2} .0266342{col 37}{space 1}    4.73{col 46}{space 3}0.000{col 54}{space 4} .0736742{col 67}{space 3} .1780783
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 1678.04
                                          p = (0.00)
{p 0 4 2}
file {bf}
tfpa103.dta{rm}
saved
{p_end}
{browse `"tfpa103.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpa103.txt""':seeout}
{res}
{col 1}{txt:Panel variable: }{res:psid}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2000}}{txt: to }{res:{bind:2015}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}(75,648 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}     3623
{txt}Group variable (id): psid{col 49}Number of groups   = {res}      721
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      5.0
{col 49}{txt}               max = {res}       15

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2}  .351462{col 26}{space 2} .0191067{col 37}{space 1}   18.39{col 46}{space 3}0.000{col 54}{space 4} .3140136{col 67}{space 3} .3889105
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .0865513{col 26}{space 2} .0206923{col 37}{space 1}    4.18{col 46}{space 3}0.000{col 54}{space 4} .0459952{col 67}{space 3} .1271074
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 202.51
                                          p = (0.00)
(1 missing value generated)
{p 0 4 2}
file {bf}
tfpa104.dta{rm}
saved
{p_end}
{browse `"tfpa104.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpa104.txt""':seeout}
{res}
{col 1}{txt:Panel variable: }{res:psid}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2000}}{txt: to }{res:{bind:2015}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}(82,780 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}      430
{txt}Group variable (id): psid{col 49}Number of groups   = {res}       67
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      6.4
{col 49}{txt}               max = {res}       15

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .4191496{col 26}{space 2} .0162342{col 37}{space 1}   25.82{col 46}{space 3}0.000{col 54}{space 4} .3873311{col 67}{space 3} .4509682
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .0565537{col 26}{space 2} .0369837{col 37}{space 1}    1.53{col 46}{space 3}0.126{col 54}{space 4} -.015933{col 67}{space 3} .1290404
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 110.15
                                          p = (0.00)
{p 0 4 2}
file {bf}
tfpa105.dta{rm}
saved
{p_end}
{browse `"tfpa105.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpa105.txt""':seeout}
{res}
{col 1}{txt:Panel variable: }{res:psid}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2000}}{txt: to }{res:{bind:2015}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}(70,933 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}     8538
{txt}Group variable (id): psid{col 49}Number of groups   = {res}     1471
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      5.8
{col 49}{txt}               max = {res}       15

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2}  .398606{col 26}{space 2} .0222547{col 37}{space 1}   17.91{col 46}{space 3}0.000{col 54}{space 4} .3549876{col 67}{space 3} .4422244
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .1020053{col 26}{space 2} .0276255{col 37}{space 1}    3.69{col 46}{space 3}0.000{col 54}{space 4} .0478604{col 67}{space 3} .1561503
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 1061.43
                                          p = (0.00)
{p 0 4 2}
file {bf}
tfpa106.dta{rm}
saved
{p_end}
{browse `"tfpa106.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpa106.txt""':seeout}
{res}
{col 1}{txt:Panel variable: }{res:psid}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2000}}{txt: to }{res:{bind:2015}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}(37,154 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}    30131
{txt}Group variable (id): psid{col 49}Number of groups   = {res}     4835
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      6.2
{col 49}{txt}               max = {res}       15

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .3514213{col 26}{space 2} .0037214{col 37}{space 1}   94.43{col 46}{space 3}0.000{col 54}{space 4} .3441276{col 67}{space 3} .3587151
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .1049267{col 26}{space 2}  .012928{col 37}{space 1}    8.12{col 46}{space 3}0.000{col 54}{space 4} .0795884{col 67}{space 3}  .130265
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 1173.43
                                          p = (0.00)
{p 0 4 2}
file {bf}
tfpa107.dta{rm}
saved
{p_end}
{browse `"tfpa107.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpa107.txt""':seeout}
{res}
{col 1}{txt:Panel variable: }{res:psid}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2000}}{txt: to }{res:{bind:2015}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}(81,952 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}      872
{txt}Group variable (id): psid{col 49}Number of groups   = {res}      161
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      5.4
{col 49}{txt}               max = {res}       15

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .3522461{col 26}{space 2} .0593777{col 37}{space 1}    5.93{col 46}{space 3}0.000{col 54}{space 4} .2358679{col 67}{space 3} .4686243
{txt}{space 10}lk {c |}{col 14}{res}{space 2}  .207118{col 26}{space 2} .0592926{col 37}{space 1}    3.49{col 46}{space 3}0.000{col 54}{space 4} .0909067{col 67}{space 3} .3233293
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 17.75
                                          p = (0.00)
{p 0 4 2}
file {bf}
tfpa108.dta{rm}
saved
{p_end}
{browse `"tfpa108.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpa108.txt""':seeout}

{com}. 
. clear all
{res}{txt}
{com}. use pakau
{txt}
{com}. destring disic3,replace
{txt}disic3: all characters numeric; {res}replaced {txt}as {res}int
{txt}
{com}. levelsof disic3,local(ids)
{res}{txt}101 102 103 104 105 106 107 108

{com}. foreach i in `ids' {c -(}
{txt}  2{com}.         clear all
{txt}  3{com}.         use pakau
{txt}  4{com}.         xtset nobs year
{txt}  5{com}.         destring disic3,replace
{txt}  6{com}.         keep if disic3==`i'
{txt}  7{com}.         prodest lva, free(ln) state(lk) proxy(lm) method(lp) fsresidual(om) va
{txt}  8{com}.         predict tfp,omega
{txt}  9{com}.         predict mu1,markups inputvar(ln)
{txt} 10{com}.         save tfpb`i',replace
{txt} 11{com}.         outreg2 using tfpb`i'.xls,replace se bdec(3) tdec(3) excel
{txt} 12{com}. 
. {c )-}
{res}
{col 1}{txt:Panel variable: }{res:nobs}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2017}}{txt: to }{res:{bind:2021}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}disic3: all characters numeric; {res}replaced {txt}as {res}int
{txt}(34,619 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}      311
{txt}Group variable (id): nobs{col 49}Number of groups   = {res}      128
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      2.4
{col 49}{txt}               max = {res}        5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .5988942{col 26}{space 2} .0685824{col 37}{space 1}    8.73{col 46}{space 3}0.000{col 54}{space 4} .4644751{col 67}{space 3} .7333133
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .0518451{col 26}{space 2}  .051443{col 37}{space 1}    1.01{col 46}{space 3}0.314{col 54}{space 4}-.0489812{col 67}{space 3} .1526715
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 35.25
                                          p = (0.00)
{p 0 4 2}
file {bf}
tfpb101.dta{rm}
saved
{p_end}
{browse `"tfpb101.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpb101.txt""':seeout}
{res}
{col 1}{txt:Panel variable: }{res:nobs}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2017}}{txt: to }{res:{bind:2021}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}disic3: all characters numeric; {res}replaced {txt}as {res}int
{txt}(29,465 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}     3562
{txt}Group variable (id): nobs{col 49}Number of groups   = {res}     1157
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      3.1
{col 49}{txt}               max = {res}        5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .7087719{col 26}{space 2} .0127112{col 37}{space 1}   55.76{col 46}{space 3}0.000{col 54}{space 4} .6838583{col 67}{space 3} .7336854
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .0697589{col 26}{space 2} .0617004{col 37}{space 1}    1.13{col 46}{space 3}0.258{col 54}{space 4}-.0511717{col 67}{space 3} .1906895
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 9.29
                                          p = (0.00)
{p 0 4 2}
file {bf}
tfpb102.dta{rm}
saved
{p_end}
{browse `"tfpb102.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpb102.txt""':seeout}
{res}
{col 1}{txt:Panel variable: }{res:nobs}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2017}}{txt: to }{res:{bind:2021}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}disic3: all characters numeric; {res}replaced {txt}as {res}int
{txt}(33,944 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}      839
{txt}Group variable (id): nobs{col 49}Number of groups   = {res}      286
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      2.9
{col 49}{txt}               max = {res}        5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .6132293{col 26}{space 2} .0233521{col 37}{space 1}   26.26{col 46}{space 3}0.000{col 54}{space 4} .5674601{col 67}{space 3} .6589986
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .0234925{col 26}{space 2} .0257293{col 37}{space 1}    0.91{col 46}{space 3}0.361{col 54}{space 4}-.0269359{col 67}{space 3}  .073921
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 85.22
                                          p = (0.00)
{p 0 4 2}
file {bf}
tfpb103.dta{rm}
saved
{p_end}
{browse `"tfpb103.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpb103.txt""':seeout}
{res}
{col 1}{txt:Panel variable: }{res:nobs}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2017}}{txt: to }{res:{bind:2021}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}disic3: all characters numeric; {res}replaced {txt}as {res}int
{txt}(29,171 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}     2569
{txt}Group variable (id): nobs{col 49}Number of groups   = {res}      845
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      3.0
{col 49}{txt}               max = {res}        5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .5378713{col 26}{space 2} .0276061{col 37}{space 1}   19.48{col 46}{space 3}0.000{col 54}{space 4} .4837644{col 67}{space 3} .5919783
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .0489594{col 26}{space 2} .0123853{col 37}{space 1}    3.95{col 46}{space 3}0.000{col 54}{space 4} .0246847{col 67}{space 3} .0732341
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 155.77
                                          p = (0.00)
{p 0 4 2}
file {bf}
tfpb104.dta{rm}
saved
{p_end}
{browse `"tfpb104.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpb104.txt""':seeout}
{res}
{col 1}{txt:Panel variable: }{res:nobs}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2017}}{txt: to }{res:{bind:2021}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}disic3: all characters numeric; {res}replaced {txt}as {res}int
{txt}(34,786 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}      209
{txt}Group variable (id): nobs{col 49}Number of groups   = {res}       84
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      2.5
{col 49}{txt}               max = {res}        5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .3193672{col 26}{space 2} .0389772{col 37}{space 1}    8.19{col 46}{space 3}0.000{col 54}{space 4} .2429734{col 67}{space 3} .3957611
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .2510194{col 26}{space 2} .1457985{col 37}{space 1}    1.72{col 46}{space 3}0.085{col 54}{space 4}-.0347404{col 67}{space 3} .5367791
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 9.05
                                          p = (0.00)
{p 0 4 2}
file {bf}
tfpb105.dta{rm}
saved
{p_end}
{browse `"tfpb105.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpb105.txt""':seeout}
{res}
{col 1}{txt:Panel variable: }{res:nobs}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2017}}{txt: to }{res:{bind:2021}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}disic3: all characters numeric; {res}replaced {txt}as {res}int
{txt}(31,257 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}     2596
{txt}Group variable (id): nobs{col 49}Number of groups   = {res}      961
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      2.7
{col 49}{txt}               max = {res}        5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .5124348{col 26}{space 2} .0187588{col 37}{space 1}   27.32{col 46}{space 3}0.000{col 54}{space 4} .4756683{col 67}{space 3} .5492013
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .0405896{col 26}{space 2} .0193957{col 37}{space 1}    2.09{col 46}{space 3}0.036{col 54}{space 4} .0025748{col 67}{space 3} .0786044
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 880.48
                                          p = (0.00)
(2 missing values generated)
{p 0 4 2}
file {bf}
tfpb106.dta{rm}
saved
{p_end}
{browse `"tfpb106.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpb106.txt""':seeout}
{res}
{col 1}{txt:Panel variable: }{res:nobs}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2017}}{txt: to }{res:{bind:2021}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}disic3: all characters numeric; {res}replaced {txt}as {res}int
{txt}(19,259 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}     9935
{txt}Group variable (id): nobs{col 49}Number of groups   = {res}     2981
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      3.3
{col 49}{txt}               max = {res}        5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .6893749{col 26}{space 2} .0094316{col 37}{space 1}   73.09{col 46}{space 3}0.000{col 54}{space 4} .6708892{col 67}{space 3} .7078605
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .0603754{col 26}{space 2}  .012309{col 37}{space 1}    4.90{col 46}{space 3}0.000{col 54}{space 4} .0362503{col 67}{space 3} .0845006
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 291.43
                                          p = (0.00)
{p 0 4 2}
file {bf}
tfpb107.dta{rm}
saved
{p_end}
{browse `"tfpb107.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpb107.txt""':seeout}
{res}
{col 1}{txt:Panel variable: }{res:nobs}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2017}}{txt: to }{res:{bind:2021}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}disic3: all characters numeric; {res}replaced {txt}as {res}int
{txt}(34,459 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}      392
{txt}Group variable (id): nobs{col 49}Number of groups   = {res}      140
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      2.8
{col 49}{txt}               max = {res}        5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .4922353{col 26}{space 2} .0638363{col 37}{space 1}    7.71{col 46}{space 3}0.000{col 54}{space 4} .3671185{col 67}{space 3} .6173522
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .2173326{col 26}{space 2} .0499261{col 37}{space 1}    4.35{col 46}{space 3}0.000{col 54}{space 4} .1194792{col 67}{space 3} .3151859
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 9.06
                                          p = (0.00)
{p 0 4 2}
file {bf}
tfpb108.dta{rm}
saved
{p_end}
{browse `"tfpb108.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpb108.txt""':seeout}

{com}. 
. clear all
{res}{txt}
{com}. use pakau
{txt}
{com}. destring disic3,replace
{txt}disic3: all characters numeric; {res}replaced {txt}as {res}int
{txt}
{com}. levelsof disic3,local(ids)
{res}{txt}101 102 103 104 105 106 107 108

{com}. foreach i in `ids' {c -(}
{txt}  2{com}.         use tfpb`i',clear
{txt}  3{com}.         sum mu1,det
{txt}  4{com}. {c )-}

                             {txt}mu1
{hline 61}
      Percentiles      Smallest
 1%    {res}  .604248       .3824554
{txt} 5%    {res} .6769316       .5357656
{txt}10%    {res} .8133745       .5988942       {txt}Obs         {res}        661
{txt}25%    {res} 1.306128       .6001716       {txt}Sum of wgt. {res}        661

{txt}50%    {res} 2.595154                      {txt}Mean          {res} 4.701015
                        {txt}Largest       Std. dev.     {res} 8.882242
{txt}75%    {res} 5.231443       61.14762
{txt}90%    {res} 7.649765       65.67306       {txt}Variance      {res} 78.89423
{txt}95%    {res} 12.13278       82.00565       {txt}Skewness      {res} 8.346626
{txt}99%    {res} 48.88303       138.5943       {txt}Kurtosis      {res} 99.01586

                             {txt}mu1
{hline 61}
      Percentiles      Smallest
 1%    {res} .6459618       .0319601
{txt} 5%    {res} .7483968       .0486866
{txt}10%    {res} .8315547       .0492378       {txt}Obs         {res}      5,815
{txt}25%    {res} 1.109211       .0619003       {txt}Sum of wgt. {res}      5,815

{txt}50%    {res} 2.008119                      {txt}Mean          {res} 5.105106
                        {txt}Largest       Std. dev.     {res} 33.68991
{txt}75%    {res} 4.412668       290.4837
{txt}90%    {res} 7.866964       373.1037       {txt}Variance      {res}  1135.01
{txt}95%    {res} 12.43137       654.8193       {txt}Skewness      {res} 56.13931
{txt}99%    {res} 44.73721       2297.307       {txt}Kurtosis      {res} 3715.773

                             {txt}mu1
{hline 61}
      Percentiles      Smallest
 1%    {res} .6137202        .064532
{txt} 5%    {res} .6610273       .1127346
{txt}10%    {res}  .752092       .1249181       {txt}Obs         {res}      1,336
{txt}25%    {res} 1.020106       .2251687       {txt}Sum of wgt. {res}      1,336

{txt}50%    {res} 1.738859                      {txt}Mean          {res} 3.118569
                        {txt}Largest       Std. dev.     {res} 7.493124
{txt}75%    {res} 2.378798       96.90044
{txt}90%    {res} 4.850995       102.8143       {txt}Variance      {res}  56.1469
{txt}95%    {res} 11.21299       103.7185       {txt}Skewness      {res} 10.26834
{txt}99%    {res} 26.48388       122.8363       {txt}Kurtosis      {res} 133.3944

                             {txt}mu1
{hline 61}
      Percentiles      Smallest
 1%    {res} .5491043       .0211707
{txt} 5%    {res} .6532819       .0278609
{txt}10%    {res} .8615488       .0567691       {txt}Obs         {res}      6,109
{txt}25%    {res} 1.918448       .0725759       {txt}Sum of wgt. {res}      6,109

{txt}50%    {res} 5.820595                      {txt}Mean          {res} 13.32828
                        {txt}Largest       Std. dev.     {res} 37.57324
{txt}75%    {res} 13.54256       556.5902
{txt}90%    {res} 25.41745       754.8965       {txt}Variance      {res} 1411.748
{txt}95%    {res} 43.91331        827.174       {txt}Skewness      {res} 17.31466
{txt}99%    {res}  133.796        1531.83       {txt}Kurtosis      {res} 529.9155

                             {txt}mu1
{hline 61}
      Percentiles      Smallest
 1%    {res} .2473067       .1447643
{txt} 5%    {res} .3367389       .2431373
{txt}10%    {res} .3927543       .2473067       {txt}Obs         {res}        494
{txt}25%    {res} .7610698       .2473067       {txt}Sum of wgt. {res}        494

{txt}50%    {res} 1.889188                      {txt}Mean          {res} 11.38773
                        {txt}Largest       Std. dev.     {res} 77.60008
{txt}75%    {res} 5.189053       200.8938
{txt}90%    {res} 24.27969       230.3371       {txt}Variance      {res} 6021.772
{txt}95%    {res} 46.57023       332.4499       {txt}Skewness      {res} 19.51696
{txt}99%    {res} 71.82941        1654.98       {txt}Kurtosis      {res} 409.8355

                             {txt}mu1
{hline 61}
      Percentiles      Smallest
 1%    {res} .3182788        .004839
{txt} 5%    {res} .5589356        .018125
{txt}10%    {res} .6730487       .0223486       {txt}Obs         {res}      4,021
{txt}25%    {res} 1.060082       .0223486       {txt}Sum of wgt. {res}      4,021

{txt}50%    {res} 2.114279                      {txt}Mean          {res} 7.488216
                        {txt}Largest       Std. dev.     {res} 43.16746
{txt}75%    {res} 5.654295       809.0642
{txt}90%    {res} 9.884013       809.0642       {txt}Variance      {res} 1863.429
{txt}95%    {res}  16.3232       809.0649       {txt}Skewness      {res} 16.34287
{txt}99%    {res} 64.22184       811.5804       {txt}Kurtosis      {res} 289.0567

                             {txt}mu1
{hline 61}
      Percentiles      Smallest
 1%    {res} .6343694       .0109528
{txt} 5%    {res} .7243932       .0203687
{txt}10%    {res} .7845304       .0250484       {txt}Obs         {res}     16,021
{txt}25%    {res} 1.028665       .0279696       {txt}Sum of wgt. {res}     16,021

{txt}50%    {res} 1.697228                      {txt}Mean          {res} 4.934682
                        {txt}Largest       Std. dev.     {res} 45.61228
{txt}75%    {res} 3.065719       1070.218
{txt}90%    {res} 6.149525       1438.357       {txt}Variance      {res}  2080.48
{txt}95%    {res} 9.785951       1699.048       {txt}Skewness      {res} 73.08406
{txt}99%    {res} 53.09026       4645.708       {txt}Kurtosis      {res} 6906.664

                             {txt}mu1
{hline 61}
      Percentiles      Smallest
 1%    {res} .4946966        .030523
{txt} 5%    {res} .5472013       .4593878
{txt}10%    {res} .6476886       .4922353       {txt}Obs         {res}        821
{txt}25%    {res} 1.369978       .4922353       {txt}Sum of wgt. {res}        821

{txt}50%    {res} 5.508236                      {txt}Mean          {res} 10.50899
                        {txt}Largest       Std. dev.     {res} 21.68435
{txt}75%    {res} 11.33883       202.1983
{txt}90%    {res} 19.83834       204.8145       {txt}Variance      {res}  470.211
{txt}95%    {res} 35.66352       218.0923       {txt}Skewness      {res} 6.532584
{txt}99%    {res} 116.6893       256.9088       {txt}Kurtosis      {res} 56.98931
{txt}
{com}. 
. // COVID IMPACT
. 
. clear all
{res}{txt}
{com}. use pakau
{txt}
{com}. keep if year<2020 // before covid
{txt}(14,175 observations deleted)

{com}. prodest lva, free(ln) state(lk) proxy(lm) method(lp) fsresidual(om) va
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}    12374
{txt}Group variable (id): nobs{col 49}Number of groups   = {res}     5217
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      2.4
{col 49}{txt}               max = {res}        3

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .6950381{col 26}{space 2} .0074538{col 37}{space 1}   93.25{col 46}{space 3}0.000{col 54}{space 4} .6804289{col 67}{space 3} .7096472
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .0357922{col 26}{space 2} .0167339{col 37}{space 1}    2.14{col 46}{space 3}0.032{col 54}{space 4} .0029944{col 67}{space 3}   .06859
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 214.30
                                          p = (0.00)

{com}. predict tfp,omega
{txt}
{com}. predict mu,markups inputvar(ln)
{txt}
{com}. sum mu,det

                             {txt}mu
{hline 61}
      Percentiles      Smallest
 1%    {res} .6976073       .0065633
{txt} 5%    {res} .7521966       .0273568
{txt}10%    {res} .8525056       .0303123       {txt}Obs         {res}     21,105
{txt}25%    {res} 1.222489       .0303124       {txt}Sum of wgt. {res}     21,105

{txt}50%    {res} 2.258009                      {txt}Mean          {res} 8.226924
                        {txt}Largest       Std. dev.     {res} 57.43865
{txt}75%    {res} 5.619496       1979.433
{txt}90%    {res} 13.80829       2252.792       {txt}Variance      {res} 3299.199
{txt}95%    {res} 22.31391       3601.728       {txt}Skewness      {res} 47.36107
{txt}99%    {res}  92.6953       4683.872       {txt}Kurtosis      {res} 3091.234
{txt}
{com}. drop if mu < r(p5) | mu > r(p95)
{txt}(2,110 observations deleted)

{com}. sum mu,det

                             {txt}mu
{hline 61}
      Percentiles      Smallest
 1%    {res} .7688588       .7521966
{txt} 5%    {res} .8419752        .752335
{txt}10%    {res} .9345101       .7523587       {txt}Obs         {res}     18,995
{txt}25%    {res} 1.311194       .7524491       {txt}Sum of wgt. {res}     18,995

{txt}50%    {res} 2.258009                      {txt}Mean          {res} 4.028648
                        {txt}Largest       Std. dev.     {res} 4.282189
{txt}75%    {res} 5.022246         22.218
{txt}90%    {res} 9.597706       22.22766       {txt}Variance      {res} 18.33714
{txt}95%    {res} 14.76093       22.30895       {txt}Skewness      {res}  2.07521
{txt}99%    {res} 19.66321       22.31391       {txt}Kurtosis      {res} 6.972244
{txt}
{com}. bys year: tabstat mu, stats(mean median min max)

{txt}{hline}
-> year = 2017

{ralign 12:Variable} {...}
{c |}      Mean       p50       Min       Max
{hline 13}{c +}{hline 40}
{ralign 12:mu} {...}
{c |}{...}
 {res} 4.392927  2.196624  .7524491  22.30895
{txt}{hline 13}{c BT}{hline 40}

{hline}
-> year = 2018

{ralign 12:Variable} {...}
{c |}      Mean       p50       Min       Max
{hline 13}{c +}{hline 40}
{ralign 12:mu} {...}
{c |}{...}
 {res}  3.88808  2.251876  .7521966  22.22766
{txt}{hline 13}{c BT}{hline 40}

{hline}
-> year = 2019

{ralign 12:Variable} {...}
{c |}      Mean       p50       Min       Max
{hline 13}{c +}{hline 40}
{ralign 12:mu} {...}
{c |}{...}
 {res} 3.768128  2.313871  .7523587  22.31391
{txt}{hline 13}{c BT}{hline 40}

{com}. save before,replace
{txt}{p 0 4 2}
file {bf}
before.dta{rm}
saved
{p_end}

{com}. 
. clear all
{res}{txt}
{com}. use pakau
{txt}
{com}. keep if year>=2020 // after covid
{txt}(21,105 observations deleted)

{com}. prodest lva, free(ln) state(lk) proxy(lm) method(lp) fsresidual(om) va
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}     8039
{txt}Group variable (id): nobs{col 49}Number of groups   = {res}     4798
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      1.7
{col 49}{txt}               max = {res}        2

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .6461098{col 26}{space 2} .0083453{col 37}{space 1}   77.42{col 46}{space 3}0.000{col 54}{space 4} .6297533{col 67}{space 3} .6624663
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .1061564{col 26}{space 2} .0531635{col 37}{space 1}    2.00{col 46}{space 3}0.046{col 54}{space 4}  .001958{col 67}{space 3} .2103549
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 21.50
                                          p = (0.00)

{com}. predict tfp,omega
{txt}
{com}. predict mu,markups inputvar(ln)
{txt}(2 missing values generated)

{com}. sum mu,det

                             {txt}mu
{hline 61}
      Percentiles      Smallest
 1%    {res}  .418775       .0102654
{txt} 5%    {res}  .677923       .0190904
{txt}10%    {res} .7468404       .0228532       {txt}Obs         {res}     14,173
{txt}25%    {res} 1.039884       .0234764       {txt}Sum of wgt. {res}     14,173

{txt}50%    {res} 2.094154                      {txt}Mean          {res} 7.477066
                        {txt}Largest       Std. dev.     {res} 29.95779
{txt}75%    {res} 5.019894       784.4124
{txt}90%    {res} 11.81421        906.201       {txt}Variance      {res} 897.4693
{txt}95%    {res} 24.68535       906.8079       {txt}Skewness      {res} 18.51642
{txt}99%    {res}  96.8119       1348.086       {txt}Kurtosis      {res} 536.6939
{txt}
{com}. drop if mu < r(p5) | mu > r(p95)
{txt}(1,418 observations deleted)

{com}. sum mu,det

                             {txt}mu
{hline 61}
      Percentiles      Smallest
 1%    {res} .6802914        .677923
{txt} 5%    {res} .7391511       .6779274
{txt}10%    {res} .8098871       .6779747       {txt}Obs         {res}     12,757
{txt}25%    {res} 1.109024       .6779966       {txt}Sum of wgt. {res}     12,757

{txt}50%    {res} 2.094154                      {txt}Mean          {res} 3.745254
                        {txt}Largest       Std. dev.     {res} 4.208127
{txt}75%    {res} 4.315406       24.60255
{txt}90%    {res} 9.280183       24.64372       {txt}Variance      {res} 17.70833
{txt}95%    {res} 12.41849       24.66238       {txt}Skewness      {res}  2.34293
{txt}99%    {res} 21.62237       24.68535       {txt}Kurtosis      {res}   9.0373
{txt}
{com}. bys year: tabstat mu, stats(mean median min max)

{txt}{hline}
-> year = 2020

{ralign 12:Variable} {...}
{c |}      Mean       p50       Min       Max
{hline 13}{c +}{hline 40}
{ralign 12:mu} {...}
{c |}{...}
 {res} 3.708621  1.947701  .6781706  24.60255
{txt}{hline 13}{c BT}{hline 40}

{hline}
-> year = 2021

{ralign 12:Variable} {...}
{c |}      Mean       p50       Min       Max
{hline 13}{c +}{hline 40}
{ralign 12:mu} {...}
{c |}{...}
 {res} 3.777084  2.218699   .677923  24.68535
{txt}{hline 13}{c BT}{hline 40}

{com}. save after,replace
{txt}{p 0 4 2}
file {bf}
after.dta{rm}
saved
{p_end}

{com}. 
. 
. /*
> 
> 
> ╔═══╗────╔╗────╔═╗╔╗─────────╔═══╗╔╗
> ║╔══╝────║║────║╔╝║║─────────║╔══╝║║
> ║╚══╦═╗╔═╝║╔══╦╝╚╗║║──╔══╦══╗║╚══╦╣║╔══╗
> ║╔══╣╔╗╣╔╗║║╔╗╠╗╔╝║║─╔╣╔╗║╔╗║║╔══╬╣║║║═╣
> ║╚══╣║║║╚╝║║╚╝║║║─║╚═╝║╚╝║╚╝║║║──║║╚╣║═╣
> ╚═══╩╝╚╩══╝╚══╝╚╝─╚═══╩══╩═╗║╚╝──╚╩═╩══╝
> ─────────────────────────╔═╝║
> ─────────────────────────╚══╝
> 
> 
> zipfile tfp*,saving(For_Krisnav1, replace)
> 
> local list: dir . files "tfp*"
> foreach f of local list {c -(}
>         erase "`f'"
> {c )-}
> */
. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\github\foodbi\tfplog.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 1 Oct 2023, 16:30:14
{txt}{.-}
{smcl}
{txt}{sf}{ul off}