{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\github\foodbi\tfplog.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 7 Oct 2023, 23:54:10
{txt}
{com}. /*
> ╔╗─────────╔═══╗╔╗────╔═══╗╔╗─────╔╗
> ║║─────────║╔══╝║║────║╔═╗╠╝╚╗───╔╝╚╗
> ║║──╔══╦══╗║╚══╦╣║╔══╗║╚══╬╗╔╬══╦╩╗╔╝
> ║║─╔╣╔╗║╔╗║║╔══╬╣║║║═╣╚══╗║║║║╔╗║╔╣║
> ║╚═╝║╚╝║╚╝║║║──║║╚╣║═╣║╚═╝║║╚╣╔╗║║║╚╗
> ╚═══╩══╩═╗║╚╝──╚╩═╩══╝╚═══╝╚═╩╝╚╩╝╚═╝
> ───────╔═╝║
> ───────╚══╝
> */
. cd "C:\github\foodbi" // Please change this to the proper working directory
{res}C:\github\foodbi
{txt}
{com}. 
. import excel "C:\github\Foodbi\new_data\use\makro.xlsx", sheet("compile") firstrow clear
{res}{text}(3 vars, 22 obs)

{com}. tsset year
{res}
{p 0 15 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2000}}{txt: to }{res:{bind:2021}}{p_end}
{txt}{col 9}Delta: {res}1 unit
{txt}
{com}. save birate,replace
{txt}{p 0 4 2}
file {bf}
birate.dta{rm}
saved
{p_end}

{com}. 
. use "new_data/use/data0015.dta",clear // Pleace change this with the data in
{txt}
{com}. 
. xtset psid year
{res}
{col 1}{txt:Panel variable: }{res:psid}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2000}}{txt: to }{res:{bind:2015}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}
{com}. keep if disic2_4==10 // ISIC Rev. 4. For ISIC rev.3, 15
{txt}(4,985 observations deleted)

{com}. 
. gen cost=it1vcu+rdnvcu+rimvcu+efuvcu+eplvcu+enpvcu+zpdvcu+zndvcu
{txt}(1 missing value generated)

{com}. gen c2=rdnvcu+rimvcu+zpdvcu+zndvcu+it1vcu
{txt}
{com}. gen labshare=(zpdvcu+zndvcu)/cost
{txt}(1 missing value generated)

{com}. gen lab2=(zpdvcu+zndvcu)/c2
{txt}
{com}. gen ln=log(zpdvcu+zndvcu)
{txt}(1 missing value generated)

{com}. gen lk=log(v1115)
{txt}(30,867 missing values generated)

{com}. gen lo=log(output)
{txt}
{com}. gen lm=log(rdnvcu+rimvcu)
{txt}(710 missing values generated)

{com}. gen ll=log(ltlnou)
{txt}
{com}. gen lva=log(vtlvcu)
{txt}
{com}. 
. merge m:1 year using birate
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               6
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}               6{txt}  (_merge==2)

{col 5}Matched{col 30}{res}          83,508{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop if psid==. // amid birate 2016++
{txt}(6 observations deleted)

{com}. save pakai,replace
{txt}{p 0 4 2}
file {bf}
pakai.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. prodest lva, free(ln) state(lk) proxy(lm) method(lp) fsresidual(om) va
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}    52357
{txt}Group variable (id): psid{col 49}Number of groups   = {res}     8564
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      6.1
{col 49}{txt}               max = {res}       15

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .4183988{col 26}{space 2} .0082751{col 37}{space 1}   50.56{col 46}{space 3}0.000{col 54}{space 4} .4021799{col 67}{space 3} .4346176
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .1123938{col 26}{space 2} .0095816{col 37}{space 1}   11.73{col 46}{space 3}0.000{col 54}{space 4} .0936142{col 67}{space 3} .1311733
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 6296.84
                                          p = (0.00)

{com}. outreg2 using "tfp1.xls",excel replace
{txt}{browse `"tfp1.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfp1.txt""':seeout}

{com}. 
. predict mu,markups inputvar(ln)
{txt}(1 missing value generated)

{com}. 
. predict tfp,omega
{txt}
{com}. // REMOVE OUTLIERS DUE TO FUNNY INPUT
. // outliers = 5% bot and 5% top
. sum mu,det

                             {txt}mu
{hline 61}
      Percentiles      Smallest
 1%    {res} .0699072       .0000299
{txt} 5%    {res} .4205703       .0004824
{txt}10%    {res} .4774132       .0014273       {txt}Obs         {res}     83,507
{txt}25%    {res} .6369065       .0015586       {txt}Sum of wgt. {res}     83,507

{txt}50%    {res} 1.062654                      {txt}Mean          {res} 7.063753
                        {txt}Largest       Std. dev.     {res} 189.0395
{txt}75%    {res} 2.147371       8226.549
{txt}90%    {res} 5.802135       14468.67       {txt}Variance      {res} 35735.93
{txt}95%    {res} 10.78892       16730.18       {txt}Skewness      {res} 166.6848
{txt}99%    {res} 66.62843       43776.02       {txt}Kurtosis      {res}  35692.6
{txt}
{com}. drop if mu < r(p5) | mu > r(p95)
{txt}(8,351 observations deleted)

{com}. sum mu,det

                             {txt}mu
{hline 61}
      Percentiles      Smallest
 1%    {res} .4314723       .4205703
{txt} 5%    {res} .4723672       .4205747
{txt}10%    {res} .5199187       .4205963       {txt}Obs         {res}     75,157
{txt}25%    {res}  .668201        .420634       {txt}Sum of wgt. {res}     75,157

{txt}50%    {res} 1.062654                      {txt}Mean          {res} 1.748337
                        {txt}Largest       Std. dev.     {res} 1.811976
{txt}75%    {res} 1.996111       10.77864
{txt}90%    {res} 3.886382       10.78768       {txt}Variance      {res} 3.283258
{txt}95%    {res} 6.015707       10.78864       {txt}Skewness      {res} 2.476296
{txt}99%    {res} 9.361674       10.78892       {txt}Kurtosis      {res}  9.43796
{txt}
{com}. 
. save tfp1, replace
{txt}{p 0 4 2}
file {bf}
tfp1.dta{rm}
saved
{p_end}

{com}. 
. clear all
{res}{txt}
{com}. 
. 
. import excel "C:\github\Foodbi\new_data\use\mf11krm.xlsx", sheet("Data") firstrow case(lower)
{res}{text}(53 vars, 38,332 obs)

{com}. destring year, replace
{txt}year: all characters numeric; {res}replaced {txt}as {res}int
{txt}
{com}. xtset nobs year
{res}
{col 1}{txt:Panel variable: }{res:nobs}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2017}}{txt: to }{res:{bind:2021}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}
{com}. keep if disic2=="10"
{txt}(3,052 observations deleted)

{com}. gen cost=it1vcu+rdnvcu+rimvcu+efuvcu+eplvcu+enpvcu+zpdvcu+zndvcu
{txt}
{com}. gen labshare=(zpdvcu+zndvcu)/cost
{txt}
{com}. gen ln=log(zpdvcu+zndvcu)
{txt}(2 missing values generated)

{com}. gen lk=log(v1115)
{txt}(14,584 missing values generated)

{com}. gen lo=log(output)
{txt}
{com}. gen lm=log(rdnvcu+rimvcu)
{txt}(401 missing values generated)

{com}. gen ll=log(ltlnou)
{txt}
{com}. gen lva=log(vtlvcu)
{txt}
{com}. gen disic3=substr(disic4, 1, 3)
{txt}
{com}. merge m:1 year using birate
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}              17
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}              17{txt}  (_merge==2)

{col 5}Matched{col 30}{res}          35,280{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop if nobs==. // amid birate <2017
{txt}(17 observations deleted)

{com}. save pakau,replace
{txt}{p 0 4 2}
file {bf}
pakau.dta{rm}
saved
{p_end}

{com}. 
. prodest lva, free(ln) state(lk) proxy(lm) method(lp) fsresidual(om) va
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}    20413
{txt}Group variable (id): nobs{col 49}Number of groups   = {res}     6288
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      3.2
{col 49}{txt}               max = {res}        5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .6766907{col 26}{space 2} .0082121{col 37}{space 1}   82.40{col 46}{space 3}0.000{col 54}{space 4} .6605953{col 67}{space 3} .6927861
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .0751883{col 26}{space 2} .0091284{col 37}{space 1}    8.24{col 46}{space 3}0.000{col 54}{space 4} .0572969{col 67}{space 3} .0930797
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 239.66
                                          p = (0.00)

{com}. outreg2 using "tfp2.xls",excel replace
{txt}{browse `"tfp2.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfp2.txt""':seeout}

{com}. 
. predict mu,markups inputvar(ln)
{txt}(2 missing values generated)

{com}. 
. // REMOVE OUTLIERS DUE TO FUNNY INPUT
. // outliers = 5% bot and 5% top
. sum mu,det

                             {txt}mu
{hline 61}
      Percentiles      Smallest
 1%    {res} .6214978         .00639
{txt} 5%    {res} .7190008       .0107513
{txt}10%    {res}  .808042       .0199939       {txt}Obs         {res}     35,278
{txt}25%    {res} 1.148767       .0239348       {txt}Sum of wgt. {res}     35,278

{txt}50%    {res}  2.19636                      {txt}Mean          {res} 7.937924
                        {txt}Largest       Std. dev.     {res} 47.60636
{txt}75%    {res} 5.461792       1927.181
{txt}90%    {res} 13.05225       2193.324       {txt}Variance      {res} 2266.366
{txt}95%    {res}  23.5867       3506.651       {txt}Skewness      {res} 48.05747
{txt}99%    {res} 95.24677       4560.229       {txt}Kurtosis      {res} 3562.053
{txt}
{com}. drop if mu < r(p5) | mu > r(p95)
{txt}(3,528 observations deleted)

{com}. sum mu,det

                             {txt}mu
{hline 61}
      Percentiles      Smallest
 1%    {res} .7326701       .7190008
{txt} 5%    {res} .7988055       .7190165
{txt}10%    {res} .8843135       .7190192       {txt}Obs         {res}     31,752
{txt}25%    {res} 1.227097       .7192531       {txt}Sum of wgt. {res}     31,752

{txt}50%    {res}  2.19636                      {txt}Mean          {res} 3.916971
                        {txt}Largest       Std. dev.     {res} 4.240635
{txt}75%    {res} 4.705549       23.58425
{txt}90%    {res} 9.719423       23.58425       {txt}Variance      {res} 17.98299
{txt}95%    {res} 13.76901       23.58427       {txt}Skewness      {res} 2.154598
{txt}99%    {res} 19.88925        23.5867       {txt}Kurtosis      {res} 7.606108
{txt}
{com}. 
. predict ,parameters
{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .6766907{col 26}{space 2} .0082121{col 37}{space 1}   82.40{col 46}{space 3}0.000{col 54}{space 4} .6605953{col 67}{space 3} .6927861
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .0751883{col 26}{space 2} .0091284{col 37}{space 1}    8.24{col 46}{space 3}0.000{col 54}{space 4} .0572969{col 67}{space 3} .0930797
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. predict tfp,omega
{txt}
{com}. 
. bys year: tabstat mu, stats(mean sd median p25 p75 min max)

{txt}{hline}
-> year = 2017

{ralign 12:Variable} {...}
{c |}      Mean        SD       p50       p25       p75       Min       Max
{hline 13}{c +}{hline 70}
{ralign 12:mu} {...}
{c |}{...}
 {res} 4.299449  4.683602  2.101558  1.317278  5.933584  .7190165   23.5867
{txt}{hline 13}{c BT}{hline 70}

{hline}
-> year = 2018

{ralign 12:Variable} {...}
{c |}      Mean        SD       p50       p25       p75       Min       Max
{hline 13}{c +}{hline 70}
{ralign 12:mu} {...}
{c |}{...}
 {res} 3.854475  4.220576   2.17466  1.241025  4.179722  .7190008  23.58427
{txt}{hline 13}{c BT}{hline 70}

{hline}
-> year = 2019

{ralign 12:Variable} {...}
{c |}      Mean        SD       p50       p25       p75       Min       Max
{hline 13}{c +}{hline 70}
{ralign 12:mu} {...}
{c |}{...}
 {res} 3.748883  4.041746  2.240216  1.203584  4.387071  .7198103  23.55842
{txt}{hline 13}{c BT}{hline 70}

{hline}
-> year = 2020

{ralign 12:Variable} {...}
{c |}      Mean        SD       p50       p25       p75       Min       Max
{hline 13}{c +}{hline 70}
{ralign 12:mu} {...}
{c |}{...}
 {res} 3.765194  4.133489  2.067733  1.142713  4.497798  .7194733  23.55168
{txt}{hline 13}{c BT}{hline 70}

{hline}
-> year = 2021

{ralign 12:Variable} {...}
{c |}      Mean        SD       p50       p25       p75       Min       Max
{hline 13}{c +}{hline 70}
{ralign 12:mu} {...}
{c |}{...}
 {res} 3.871677  4.027666  2.327205  1.222622  4.472913  .7190192  23.53888
{txt}{hline 13}{c BT}{hline 70}

{com}. 
. save tfp2, replace
{txt}{p 0 4 2}
file {bf}
tfp2.dta{rm}
saved
{p_end}

{com}. 
. // Regressing by 3-digit KBLI
. 
. clear all
{res}{txt}
{com}. use pakai
{txt}
{com}. levelsof disic3_4,local(ids)
{res}{txt}101 102 103 104 105 106 107 108

{com}. foreach i in `ids' {c -(}
{txt}  2{com}.         clear all
{txt}  3{com}.         use pakai
{txt}  4{com}.         xtset psid year
{txt}  5{com}.         keep if disic3_4==`i'
{txt}  6{com}.         prodest lva, free(ln) state(lk) proxy(lm) method(lp) fsresidual(om) va
{txt}  7{com}.         predict tfp,omega
{txt}  8{com}.         predict mu1,markups inputvar(ln)
{txt}  9{com}.         
.         save tfpa`i',replace
{txt} 10{com}.         outreg2 using tfpa`i'.xls,replace se bdec(3) tdec(3) excel
{txt} 11{com}. 
. {c )-}
{res}
{col 1}{txt:Panel variable: }{res:psid}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2000}}{txt: to }{res:{bind:2015}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}(82,617 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}      456
{txt}Group variable (id): psid{col 49}Number of groups   = {res}      131
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      3.5
{col 49}{txt}               max = {res}       14

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .5639879{col 26}{space 2} .0265403{col 37}{space 1}   21.25{col 46}{space 3}0.000{col 54}{space 4} .5119699{col 67}{space 3} .6160059
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .1692932{col 26}{space 2} .1030532{col 37}{space 1}    1.64{col 46}{space 3}0.100{col 54}{space 4}-.0326874{col 67}{space 3} .3712738
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 5.00
                                          p = (0.03)
{p 0 4 2}
file {bf}
tfpa101.dta{rm}
saved
{p_end}
{browse `"tfpa101.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpa101.txt""':seeout}
{res}
{col 1}{txt:Panel variable: }{res:psid}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2000}}{txt: to }{res:{bind:2015}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}(71,177 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}     7631
{txt}Group variable (id): psid{col 49}Number of groups   = {res}     1474
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      5.2
{col 49}{txt}               max = {res}       15

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .4096068{col 26}{space 2} .0050861{col 37}{space 1}   80.54{col 46}{space 3}0.000{col 54}{space 4} .3996383{col 67}{space 3} .4195753
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .1597146{col 26}{space 2} .0119827{col 37}{space 1}   13.33{col 46}{space 3}0.000{col 54}{space 4} .1362289{col 67}{space 3} .1832002
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 826.10
                                          p = (0.00)
{p 0 4 2}
file {bf}
tfpa102.dta{rm}
saved
{p_end}
{browse `"tfpa102.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpa102.txt""':seeout}
{res}
{col 1}{txt:Panel variable: }{res:psid}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2000}}{txt: to }{res:{bind:2015}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}(82,295 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}      676
{txt}Group variable (id): psid{col 49}Number of groups   = {res}      190
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      3.6
{col 49}{txt}               max = {res}       15

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .4132295{col 26}{space 2} .0316415{col 37}{space 1}   13.06{col 46}{space 3}0.000{col 54}{space 4} .3512133{col 67}{space 3} .4752457
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .1259148{col 26}{space 2} .0402647{col 37}{space 1}    3.13{col 46}{space 3}0.002{col 54}{space 4} .0469975{col 67}{space 3} .2048321
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 48.37
                                          p = (0.00)
{p 0 4 2}
file {bf}
tfpa103.dta{rm}
saved
{p_end}
{browse `"tfpa103.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpa103.txt""':seeout}
{res}
{col 1}{txt:Panel variable: }{res:psid}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2000}}{txt: to }{res:{bind:2015}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}(75,648 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}     3623
{txt}Group variable (id): psid{col 49}Number of groups   = {res}      721
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      5.0
{col 49}{txt}               max = {res}       15

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2}  .351462{col 26}{space 2} .0358532{col 37}{space 1}    9.80{col 46}{space 3}0.000{col 54}{space 4} .2811911{col 67}{space 3} .4217329
{txt}{space 10}lk {c |}{col 14}{res}{space 2}  .086072{col 26}{space 2} .0403349{col 37}{space 1}    2.13{col 46}{space 3}0.033{col 54}{space 4}  .007017{col 67}{space 3}  .165127
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 491.19
                                          p = (0.00)
(1 missing value generated)
{p 0 4 2}
file {bf}
tfpa104.dta{rm}
saved
{p_end}
{browse `"tfpa104.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpa104.txt""':seeout}
{res}
{col 1}{txt:Panel variable: }{res:psid}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2000}}{txt: to }{res:{bind:2015}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}(82,780 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}      430
{txt}Group variable (id): psid{col 49}Number of groups   = {res}       67
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      6.4
{col 49}{txt}               max = {res}       15

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .4191496{col 26}{space 2} .0260722{col 37}{space 1}   16.08{col 46}{space 3}0.000{col 54}{space 4}  .368049{col 67}{space 3} .4702503
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .0565957{col 26}{space 2} .0793778{col 37}{space 1}    0.71{col 46}{space 3}0.476{col 54}{space 4}-.0989819{col 67}{space 3} .2121732
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 33.54
                                          p = (0.00)
{p 0 4 2}
file {bf}
tfpa105.dta{rm}
saved
{p_end}
{browse `"tfpa105.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpa105.txt""':seeout}
{res}
{col 1}{txt:Panel variable: }{res:psid}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2000}}{txt: to }{res:{bind:2015}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}(70,933 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}     8538
{txt}Group variable (id): psid{col 49}Number of groups   = {res}     1471
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      5.8
{col 49}{txt}               max = {res}       15

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2}  .398606{col 26}{space 2} .0138074{col 37}{space 1}   28.87{col 46}{space 3}0.000{col 54}{space 4}  .371544{col 67}{space 3} .4256681
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .1014691{col 26}{space 2} .0149929{col 37}{space 1}    6.77{col 46}{space 3}0.000{col 54}{space 4} .0720834{col 67}{space 3} .1308547
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 1394.57
                                          p = (0.00)
{p 0 4 2}
file {bf}
tfpa106.dta{rm}
saved
{p_end}
{browse `"tfpa106.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpa106.txt""':seeout}
{res}
{col 1}{txt:Panel variable: }{res:psid}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2000}}{txt: to }{res:{bind:2015}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}(37,154 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}    30131
{txt}Group variable (id): psid{col 49}Number of groups   = {res}     4835
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      6.2
{col 49}{txt}               max = {res}       15

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .3514213{col 26}{space 2} .0059997{col 37}{space 1}   58.57{col 46}{space 3}0.000{col 54}{space 4} .3396621{col 67}{space 3} .3631806
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .1048324{col 26}{space 2}  .010646{col 37}{space 1}    9.85{col 46}{space 3}0.000{col 54}{space 4} .0839667{col 67}{space 3} .1256981
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 4179.84
                                          p = (0.00)
{p 0 4 2}
file {bf}
tfpa107.dta{rm}
saved
{p_end}
{browse `"tfpa107.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpa107.txt""':seeout}
{res}
{col 1}{txt:Panel variable: }{res:psid}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2000}}{txt: to }{res:{bind:2015}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}(81,952 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}      872
{txt}Group variable (id): psid{col 49}Number of groups   = {res}      161
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      5.4
{col 49}{txt}               max = {res}       15

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .3522461{col 26}{space 2} .0706262{col 37}{space 1}    4.99{col 46}{space 3}0.000{col 54}{space 4} .2138214{col 67}{space 3} .4906708
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .2061726{col 26}{space 2} .0591411{col 37}{space 1}    3.49{col 46}{space 3}0.000{col 54}{space 4} .0902581{col 67}{space 3}  .322087
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 102.40
                                          p = (0.00)
{p 0 4 2}
file {bf}
tfpa108.dta{rm}
saved
{p_end}
{browse `"tfpa108.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpa108.txt""':seeout}

{com}. 
. clear all
{res}{txt}
{com}. use tfpa101
{txt}
{com}. append using tfpa102 tfpa103 tfpa104 tfpa105 tfpa106 tfpa107 tfpa108
{txt}(label {bf:{txt}ownership} already defined)
(label {bf:{txt}_merge} already defined)
(label {bf:{txt}importdepend} already defined)
(label {bf:{txt}salesorientation} already defined)
(label {bf:{txt}ownership} already defined)
(label {bf:{txt}_merge} already defined)
(label {bf:{txt}importdepend} already defined)
(label {bf:{txt}salesorientation} already defined)
(label {bf:{txt}ownership} already defined)
(label {bf:{txt}_merge} already defined)
(label {bf:{txt}importdepend} already defined)
(label {bf:{txt}salesorientation} already defined)
(label {bf:{txt}ownership} already defined)
(label {bf:{txt}_merge} already defined)
(label {bf:{txt}importdepend} already defined)
(label {bf:{txt}salesorientation} already defined)
(label {bf:{txt}ownership} already defined)
(label {bf:{txt}_merge} already defined)
(label {bf:{txt}importdepend} already defined)
(label {bf:{txt}salesorientation} already defined)
(label {bf:{txt}ownership} already defined)
(label {bf:{txt}_merge} already defined)
(label {bf:{txt}importdepend} already defined)
(label {bf:{txt}salesorientation} already defined)
(label {bf:{txt}ownership} already defined)
(label {bf:{txt}_merge} already defined)
(label {bf:{txt}importdepend} already defined)
(label {bf:{txt}salesorientation} already defined)

{com}. sum mu,det

                             {txt}mu1
{hline 61}
      Percentiles      Smallest
 1%    {res} .0604635       .0000284
{txt} 5%    {res} .3589949       .0004052
{txt}10%    {res} .4176178       .0011988       {txt}Obs         {res}     83,507
{txt}25%    {res} .5607087       .0013091       {txt}Sum of wgt. {res}     83,507

{txt}50%    {res} .9284211                      {txt}Mean          {res}  6.14321
                        {txt}Largest       Std. dev.     {res} 159.6613
{txt}75%    {res} 1.979803       8053.682
{txt}90%    {res} 5.083655       12152.52       {txt}Variance      {res} 25491.72
{txt}95%    {res} 9.533464       14053.63       {txt}Skewness      {res} 164.5825
{txt}99%    {res} 59.16885        36772.6       {txt}Kurtosis      {res} 34960.31
{txt}
{com}. drop if mu < r(p5) | mu > r(p95)
{txt}(8,351 observations deleted)

{com}. sum mu,det

                             {txt}mu1
{hline 61}
      Percentiles      Smallest
 1%    {res} .3724081       .3589949
{txt} 5%    {res} .4131277       .3590471
{txt}10%    {res} .4523737       .3590562       {txt}Obs         {res}     75,157
{txt}25%    {res} .5896324       .3591288       {txt}Sum of wgt. {res}     75,157

{txt}50%    {res} .9284211                      {txt}Mean          {res} 1.552507
                        {txt}Largest       Std. dev.     {res} 1.600437
{txt}75%    {res} 1.777733       9.526954
{txt}90%    {res} 3.533556       9.526954       {txt}Variance      {res} 2.561397
{txt}95%    {res} 5.334764        9.53138       {txt}Skewness      {res} 2.395971
{txt}99%    {res} 8.106676       9.533464       {txt}Kurtosis      {res} 8.973317
{txt}
{com}. save tfpa,replace
{txt}{p 0 4 2}
file {bf}
tfpa.dta{rm}
saved
{p_end}

{com}. 
. clear all
{res}{txt}
{com}. use pakau
{txt}
{com}. destring disic3,replace
{txt}disic3: all characters numeric; {res}replaced {txt}as {res}int
{txt}
{com}. levelsof disic3,local(ids)
{res}{txt}101 102 103 104 105 106 107 108

{com}. foreach i in `ids' {c -(}
{txt}  2{com}.         clear all
{txt}  3{com}.         use pakau
{txt}  4{com}.         xtset nobs year
{txt}  5{com}.         destring disic3,replace
{txt}  6{com}.         keep if disic3==`i'
{txt}  7{com}.         prodest lva, free(ln) state(lk) proxy(lm) method(lp) fsresidual(om) va
{txt}  8{com}.         predict tfp,omega
{txt}  9{com}.         predict mu1,markups inputvar(ln)
{txt} 10{com}.         save tfpb`i',replace
{txt} 11{com}.         outreg2 using tfpb`i'.xls,replace se bdec(3) tdec(3) excel
{txt} 12{com}. 
. {c )-}
{res}
{col 1}{txt:Panel variable: }{res:nobs}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2017}}{txt: to }{res:{bind:2021}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}disic3: all characters numeric; {res}replaced {txt}as {res}int
{txt}(34,619 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}      311
{txt}Group variable (id): nobs{col 49}Number of groups   = {res}      128
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      2.4
{col 49}{txt}               max = {res}        5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .5988942{col 26}{space 2} .0921826{col 37}{space 1}    6.50{col 46}{space 3}0.000{col 54}{space 4} .4182196{col 67}{space 3} .7795689
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .0515194{col 26}{space 2}   .05228{col 37}{space 1}    0.99{col 46}{space 3}0.324{col 54}{space 4}-.0509475{col 67}{space 3} .1539863
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 8.28
                                          p = (0.00)
{p 0 4 2}
file {bf}
tfpb101.dta{rm}
saved
{p_end}
{browse `"tfpb101.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpb101.txt""':seeout}
{res}
{col 1}{txt:Panel variable: }{res:nobs}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2017}}{txt: to }{res:{bind:2021}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}disic3: all characters numeric; {res}replaced {txt}as {res}int
{txt}(29,465 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}     3562
{txt}Group variable (id): nobs{col 49}Number of groups   = {res}     1157
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      3.1
{col 49}{txt}               max = {res}        5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .7087719{col 26}{space 2}  .030531{col 37}{space 1}   23.21{col 46}{space 3}0.000{col 54}{space 4} .6489323{col 67}{space 3} .7686115
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .0695018{col 26}{space 2} .0178857{col 37}{space 1}    3.89{col 46}{space 3}0.000{col 54}{space 4} .0344465{col 67}{space 3} .1045571
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 45.83
                                          p = (0.00)
{p 0 4 2}
file {bf}
tfpb102.dta{rm}
saved
{p_end}
{browse `"tfpb102.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpb102.txt""':seeout}
{res}
{col 1}{txt:Panel variable: }{res:nobs}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2017}}{txt: to }{res:{bind:2021}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}disic3: all characters numeric; {res}replaced {txt}as {res}int
{txt}(33,944 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}      839
{txt}Group variable (id): nobs{col 49}Number of groups   = {res}      286
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      2.9
{col 49}{txt}               max = {res}        5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .6132293{col 26}{space 2} .0182499{col 37}{space 1}   33.60{col 46}{space 3}0.000{col 54}{space 4} .5774601{col 67}{space 3} .6489985
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .0232454{col 26}{space 2} .0261439{col 37}{space 1}    0.89{col 46}{space 3}0.374{col 54}{space 4}-.0279958{col 67}{space 3} .0744865
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 482.07
                                          p = (0.00)
{p 0 4 2}
file {bf}
tfpb103.dta{rm}
saved
{p_end}
{browse `"tfpb103.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpb103.txt""':seeout}
{res}
{col 1}{txt:Panel variable: }{res:nobs}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2017}}{txt: to }{res:{bind:2021}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}disic3: all characters numeric; {res}replaced {txt}as {res}int
{txt}(29,171 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}     2569
{txt}Group variable (id): nobs{col 49}Number of groups   = {res}      845
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      3.0
{col 49}{txt}               max = {res}        5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .5378713{col 26}{space 2} .0454059{col 37}{space 1}   11.85{col 46}{space 3}0.000{col 54}{space 4} .4488774{col 67}{space 3} .6268653
{txt}{space 10}lk {c |}{col 14}{res}{space 2}   .04872{col 26}{space 2} .0257484{col 37}{space 1}    1.89{col 46}{space 3}0.058{col 54}{space 4}-.0017458{col 67}{space 3} .0991859
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 405.67
                                          p = (0.00)
{p 0 4 2}
file {bf}
tfpb104.dta{rm}
saved
{p_end}
{browse `"tfpb104.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpb104.txt""':seeout}
{res}
{col 1}{txt:Panel variable: }{res:nobs}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2017}}{txt: to }{res:{bind:2021}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}disic3: all characters numeric; {res}replaced {txt}as {res}int
{txt}(34,786 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}      209
{txt}Group variable (id): nobs{col 49}Number of groups   = {res}       84
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      2.5
{col 49}{txt}               max = {res}        5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .3193672{col 26}{space 2} .0797391{col 37}{space 1}    4.01{col 46}{space 3}0.000{col 54}{space 4} .1630815{col 67}{space 3}  .475653
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .2512999{col 26}{space 2} .3378164{col 37}{space 1}    0.74{col 46}{space 3}0.457{col 54}{space 4}-.4108081{col 67}{space 3} .9134078
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 1.61
                                          p = (0.20)
{p 0 4 2}
file {bf}
tfpb105.dta{rm}
saved
{p_end}
{browse `"tfpb105.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpb105.txt""':seeout}
{res}
{col 1}{txt:Panel variable: }{res:nobs}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2017}}{txt: to }{res:{bind:2021}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}disic3: all characters numeric; {res}replaced {txt}as {res}int
{txt}(31,257 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}     2596
{txt}Group variable (id): nobs{col 49}Number of groups   = {res}      961
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      2.7
{col 49}{txt}               max = {res}        5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .5124348{col 26}{space 2} .0137151{col 37}{space 1}   37.36{col 46}{space 3}0.000{col 54}{space 4} .4855538{col 67}{space 3} .5393158
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .0402868{col 26}{space 2} .0087974{col 37}{space 1}    4.58{col 46}{space 3}0.000{col 54}{space 4} .0230443{col 67}{space 3} .0575294
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 1015.20
                                          p = (0.00)
(2 missing values generated)
{p 0 4 2}
file {bf}
tfpb106.dta{rm}
saved
{p_end}
{browse `"tfpb106.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpb106.txt""':seeout}
{res}
{col 1}{txt:Panel variable: }{res:nobs}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2017}}{txt: to }{res:{bind:2021}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}disic3: all characters numeric; {res}replaced {txt}as {res}int
{txt}(19,259 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}     9935
{txt}Group variable (id): nobs{col 49}Number of groups   = {res}     2981
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      3.3
{col 49}{txt}               max = {res}        5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .6893749{col 26}{space 2}  .005301{col 37}{space 1}  130.05{col 46}{space 3}0.000{col 54}{space 4} .6789851{col 67}{space 3} .6997646
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .0602043{col 26}{space 2}   .03198{col 37}{space 1}    1.88{col 46}{space 3}0.060{col 54}{space 4}-.0024752{col 67}{space 3} .1228839
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 58.51
                                          p = (0.00)
{p 0 4 2}
file {bf}
tfpb107.dta{rm}
saved
{p_end}
{browse `"tfpb107.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpb107.txt""':seeout}
{res}
{col 1}{txt:Panel variable: }{res:nobs}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2017}}{txt: to }{res:{bind:2021}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}disic3: all characters numeric; {res}replaced {txt}as {res}int
{txt}(34,459 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}      392
{txt}Group variable (id): nobs{col 49}Number of groups   = {res}      140
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      2.8
{col 49}{txt}               max = {res}        5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .4922353{col 26}{space 2} .1083004{col 37}{space 1}    4.55{col 46}{space 3}0.000{col 54}{space 4} .2799705{col 67}{space 3} .7045001
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .2171951{col 26}{space 2} .0169262{col 37}{space 1}   12.83{col 46}{space 3}0.000{col 54}{space 4} .1840205{col 67}{space 3} .2503698
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 8.85
                                          p = (0.00)
{p 0 4 2}
file {bf}
tfpb108.dta{rm}
saved
{p_end}
{browse `"tfpb108.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpb108.txt""':seeout}

{com}. 
. clear all
{res}{txt}
{com}. use tfpb101
{txt}
{com}. append using tfpb102 tfpb103 tfpb104 tfpb105 tfpb106 tfpb107 tfpb108
{txt}(label {bf:{txt}_merge} already defined)
(label {bf:{txt}_merge} already defined)
(label {bf:{txt}_merge} already defined)
(label {bf:{txt}_merge} already defined)
(label {bf:{txt}_merge} already defined)
(label {bf:{txt}_merge} already defined)
(label {bf:{txt}_merge} already defined)

{com}. sum mu,det

                             {txt}mu1
{hline 61}
      Percentiles      Smallest
 1%    {res} .4950048        .004839
{txt} 5%    {res} .7029624       .0109528
{txt}10%    {res} .7810508        .018125       {txt}Obs         {res}     35,278
{txt}25%    {res}  1.10103       .0203687       {txt}Sum of wgt. {res}     35,278

{txt}50%    {res} 2.107759                      {txt}Mean          {res} 6.854257
                        {txt}Largest       Std. dev.     {res} 41.20696
{txt}75%    {res} 4.860591        1654.98
{txt}90%    {res} 11.18688       1699.048       {txt}Variance      {res} 1698.014
{txt}95%    {res} 19.44759       2297.307       {txt}Skewness      {res} 56.32624
{txt}99%    {res} 76.81673       4645.708       {txt}Kurtosis      {res} 5150.167
{txt}
{com}. drop if mu < r(p5) | mu > r(p95)
{txt}(3,528 observations deleted)

{com}. sum mu,det

                             {txt}mu1
{hline 61}
      Percentiles      Smallest
 1%    {res} .7164698       .7029624
{txt} 5%    {res} .7712016       .7029789
{txt}10%    {res} .8547209       .7030078       {txt}Obs         {res}     31,752
{txt}25%    {res} 1.168373       .7030641       {txt}Sum of wgt. {res}     31,752

{txt}50%    {res} 2.107759                      {txt}Mean          {res}  3.48629
                        {txt}Largest       Std. dev.     {res} 3.509988
{txt}75%    {res} 4.357142       19.39946
{txt}90%    {res} 7.824771       19.42163       {txt}Variance      {res} 12.32002
{txt}95%    {res} 11.82817        19.4266       {txt}Skewness      {res} 2.044897
{txt}99%    {res} 16.60521       19.44759       {txt}Kurtosis      {res} 7.151264
{txt}
{com}. save tfpb,replace
{txt}{p 0 4 2}
file {bf}
tfpb.dta{rm}
saved
{p_end}

{com}. 
. tabstat mu if Disic4==1043, stats(mean sd median p25 p75 min max)
{err}Disic4 not found
{txt}{search r(111), local:r(111);}

end of do-file

{search r(111), local:r(111);}

{com}. do "C:\Users\imedk\AppData\Local\Temp\STD467c_000000.tmp"
{txt}
{com}. tabstat mu if disic4==1043, stats(mean sd median p25 p75 min max)
{err}type mismatch
{txt}{search r(109), local:r(109);}

end of do-file

{search r(109), local:r(109);}

{com}. do "C:\Users\imedk\AppData\Local\Temp\STD467c_000000.tmp"
{txt}
{com}. tabstat mu if disic4=="1043", stats(mean sd median p25 p75 min max)

{txt}{ralign 12:Variable} {...}
{c |}      Mean        SD       p50       p25       p75       Min       Max
{hline 13}{c +}{hline 70}
{ralign 12:mu1} {...}
{c |}{...}
 {res} 6.642987  4.793123  5.527736  2.492439  9.336532  .7043817  19.44759
{txt}{hline 13}{c BT}{hline 70}

{com}. 
{txt}end of do-file

{com}. do "C:\Users\imedk\AppData\Local\Temp\STD467c_000000.tmp"
{txt}
{com}. tabstat mu if disic4=="1043", stats(mean sd median p25 p75 min max)

{txt}{ralign 12:Variable} {...}
{c |}      Mean        SD       p50       p25       p75       Min       Max
{hline 13}{c +}{hline 70}
{ralign 12:mu1} {...}
{c |}{...}
 {res} 6.642987  4.793123  5.527736  2.492439  9.336532  .7043817  19.44759
{txt}{hline 13}{c BT}{hline 70}

{com}. tabstat mu if disic4=="1063", stats(mean sd median p25 p75 min max)

{txt}{ralign 12:Variable} {...}
{c |}      Mean        SD       p50       p25       p75       Min       Max
{hline 13}{c +}{hline 70}
{ralign 12:mu1} {...}
{c |}{...}
 {res} 3.924494  3.474773   2.50799  1.317804  5.713231  .7044306  19.37306
{txt}{hline 13}{c BT}{hline 70}

{com}. tabstat mu if disic4=="1072", stats(mean sd median p25 p75 min max)

{txt}{ralign 12:Variable} {...}
{c |}      Mean        SD       p50       p25       p75       Min       Max
{hline 13}{c +}{hline 70}
{ralign 12:mu1} {...}
{c |}{...}
 {res} 3.676576  3.153234  2.612772  1.396396  5.230974  .7069482  18.70456
{txt}{hline 13}{c BT}{hline 70}

{com}. 
. use tfpa,clear
{txt}
{com}. tabstat mu if disic4_4==1040, stats(mean sd median p25 p75 min max)

{txt}{ralign 12:Variable} {...}
{c |}      Mean        SD       p50       p25       p75       Min       Max
{hline 13}{c +}{hline 70}
{ralign 12:mu1} {...}
{c |}{...}
 {res} 3.623707  2.544523   3.24088  1.272254  5.630782  .3590471  9.533464
{txt}{hline 13}{c BT}{hline 70}

{com}. tabstat mu if disic4_4==1062, stats(mean sd median p25 p75 min max)

{txt}{ralign 12:Variable} {...}
{c |}      Mean        SD       p50       p25       p75       Min       Max
{hline 13}{c +}{hline 70}
{ralign 12:mu1} {...}
{c |}{...}
 {res} 1.646224  1.390332  1.225446  .6613379  2.213856  .3624731  9.457652
{txt}{hline 13}{c BT}{hline 70}

{com}. tabstat mu if disic4_4==1072, stats(mean sd median p25 p75 min max)

{txt}{ralign 12:Variable} {...}
{c |}      Mean        SD       p50       p25       p75       Min       Max
{hline 13}{c +}{hline 70}
{ralign 12:mu1} {...}
{c |}{...}
 {res} 1.804893  1.890561  .9909145  .5694063   2.27139  .3592048  9.506977
{txt}{hline 13}{c BT}{hline 70}

{com}. 
. /*
> 
> clear all
> use pakau
> destring disic3,replace
> levelsof disic3,local(ids)
> foreach i in `ids' {c -(}
>         use tfpb`i',clear
>         sum mu1,det
> {c )-}
> 
> // COVID IMPACT
> 
> clear all
> use pakau
> keep if year<2020 // before covid
> prodest lva, free(ln) state(lk) proxy(lm) method(lp) fsresidual(om) va
> predict tfp,omega
> predict mu,markups inputvar(ln)
> sum mu,det
> drop if mu < r(p5) | mu > r(p95)
> sum mu,det
> bys year: tabstat mu, stats(mean median min max)
> save before,replace
> 
> clear all
> use pakau
> keep if year>=2020 // after covid
> prodest lva, free(ln) state(lk) proxy(lm) method(lp) fsresidual(om) va
> predict tfp,omega
> predict mu,markups inputvar(ln)
> sum mu,det
> drop if mu < r(p5) | mu > r(p95)
> sum mu,det
> bys year: tabstat mu, stats(mean median min max)
> save after,replace
> 
> 
> 
> 
> 
> ╔═══╗────╔╗────╔═╗╔╗─────────╔═══╗╔╗
> ║╔══╝────║║────║╔╝║║─────────║╔══╝║║
> ║╚══╦═╗╔═╝║╔══╦╝╚╗║║──╔══╦══╗║╚══╦╣║╔══╗
> ║╔══╣╔╗╣╔╗║║╔╗╠╗╔╝║║─╔╣╔╗║╔╗║║╔══╬╣║║║═╣
> ║╚══╣║║║╚╝║║╚╝║║║─║╚═╝║╚╝║╚╝║║║──║║╚╣║═╣
> ╚═══╩╝╚╩══╝╚══╝╚╝─╚═══╩══╩═╗║╚╝──╚╩═╩══╝
> ─────────────────────────╔═╝║
> ─────────────────────────╚══╝
> 
> 
> zipfile tfp*,saving(For_Krisnav1, replace)
> 
> local list: dir . files "tfp*"
> foreach f of local list {c -(}
>         erase "`f'"
> {c )-}
> */
. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\github\foodbi\tfplog.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 7 Oct 2023, 23:55:46
{txt}{.-}
{smcl}
{txt}{sf}{ul off}