{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\github\foodbi\tfplog.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}17 Nov 2023, 20:38:54
{txt}
{com}. /*
> ╔╗─────────╔═══╗╔╗────╔═══╗╔╗─────╔╗
> ║║─────────║╔══╝║║────║╔═╗╠╝╚╗───╔╝╚╗
> ║║──╔══╦══╗║╚══╦╣║╔══╗║╚══╬╗╔╬══╦╩╗╔╝
> ║║─╔╣╔╗║╔╗║║╔══╬╣║║║═╣╚══╗║║║║╔╗║╔╣║
> ║╚═╝║╚╝║╚╝║║║──║║╚╣║═╣║╚═╝║║╚╣╔╗║║║╚╗
> ╚═══╩══╩═╗║╚╝──╚╩═╩══╝╚═══╝╚═╩╝╚╩╝╚═╝
> ───────╔═╝║
> ───────╚══╝
> */
. cd "C:\github\foodbi" // Please change this to the proper working directory
{res}C:\github\foodbi
{txt}
{com}. 
. import excel "C:\github\Foodbi\new_data\use\makro.xlsx", sheet("compile") firstrow clear
{res}{text}(5 vars, 22 obs)

{com}. tsset year
{res}
{p 0 15 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2000}}{txt: to }{res:{bind:2021}}{p_end}
{txt}{col 9}Delta: {res}1 unit
{txt}
{com}. save birate,replace
{txt}{p 0 4 2}
file {bf}
birate.dta{rm}
saved
{p_end}

{com}. 
. use "new_data/use/data0015.dta",clear // Pleace change this with the data in
{txt}
{com}. 
. xtset psid year
{res}
{col 1}{txt:Panel variable: }{res:psid}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2000}}{txt: to }{res:{bind:2015}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}
{com}. keep if disic2_4==10 // ISIC Rev. 4. For ISIC rev.3, 15
{txt}(4,985 observations deleted)

{com}. 
. gen cost=it1vcu+rdnvcu+rimvcu+efuvcu+eplvcu+enpvcu+zpdvcu+zndvcu
{txt}(1 missing value generated)

{com}. gen c2=rdnvcu+rimvcu+zpdvcu+zndvcu+it1vcu
{txt}
{com}. gen labshare=(zpdvcu+zndvcu)/cost
{txt}(1 missing value generated)

{com}. gen lab2=(zpdvcu+zndvcu)/c2
{txt}
{com}. gen ln=log(zpdvcu+zndvcu)
{txt}(1 missing value generated)

{com}. gen lk=log(v1115)
{txt}(30,867 missing values generated)

{com}. gen lo=log(output)
{txt}
{com}. gen lm=log(rdnvcu+rimvcu)
{txt}(710 missing values generated)

{com}. gen ll=log(ltlnou)
{txt}
{com}. gen lva=log(vtlvcu)
{txt}
{com}. 
. merge m:1 year using birate,nogenerate
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               6
{txt}{col 9}from master{col 30}{res}               0{txt}  
{col 9}from using{col 30}{res}               6{txt}  

{col 5}Matched{col 30}{res}          83,508{txt}  
{col 5}{hline 41}

{com}. drop if psid==. // amid birate 2016++
{txt}(6 observations deleted)

{com}. save pakai,replace
{txt}{p 0 4 2}
file {bf}
pakai.dta{rm}
saved
{p_end}

{com}. 
. prodest lva, free(ln) state(lk) proxy(lm) method(lp) fsresidual(om) va
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}    52357
{txt}Group variable (id): psid{col 49}Number of groups   = {res}     8564
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      6.1
{col 49}{txt}               max = {res}       15

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .4183988{col 26}{space 2} .0060316{col 37}{space 1}   69.37{col 46}{space 3}0.000{col 54}{space 4}  .406577{col 67}{space 3} .4302205
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .1124152{col 26}{space 2} .0101304{col 37}{space 1}   11.10{col 46}{space 3}0.000{col 54}{space 4} .0925599{col 67}{space 3} .1322704
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 5649.57
                                          p = (0.00)

{com}. outreg2 using "tfp1.xls",excel replace
{txt}{browse `"tfp1.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfp1.txt""':seeout}

{com}. 
. predict mu,markups inputvar(ln)
{txt}(1 missing value generated)

{com}. 
. predict tfp,omega
{txt}
{com}. // REMOVE OUTLIERS DUE TO FUNNY INPUT Remove outliers is moved to regressions
. // outliers = 5% bot and 5% top
. sum mu,det

                             {txt}mu
{hline 61}
      Percentiles      Smallest
 1%    {res} .0699072       .0000299
{txt} 5%    {res} .4205703       .0004824
{txt}10%    {res} .4774132       .0014273       {txt}Obs         {res}     83,507
{txt}25%    {res} .6369065       .0015586       {txt}Sum of wgt. {res}     83,507

{txt}50%    {res} 1.062654                      {txt}Mean          {res} 7.063753
                        {txt}Largest       Std. dev.     {res} 189.0395
{txt}75%    {res} 2.147371       8226.549
{txt}90%    {res} 5.802135       14468.67       {txt}Variance      {res} 35735.93
{txt}95%    {res} 10.78892       16730.18       {txt}Skewness      {res} 166.6848
{txt}99%    {res} 66.62843       43776.02       {txt}Kurtosis      {res}  35692.6
{txt}
{com}. // drop if mu < r(p5) | mu > r(p95)
. sum mu,det

                             {txt}mu
{hline 61}
      Percentiles      Smallest
 1%    {res} .0699072       .0000299
{txt} 5%    {res} .4205703       .0004824
{txt}10%    {res} .4774132       .0014273       {txt}Obs         {res}     83,507
{txt}25%    {res} .6369065       .0015586       {txt}Sum of wgt. {res}     83,507

{txt}50%    {res} 1.062654                      {txt}Mean          {res} 7.063753
                        {txt}Largest       Std. dev.     {res} 189.0395
{txt}75%    {res} 2.147371       8226.549
{txt}90%    {res} 5.802135       14468.67       {txt}Variance      {res} 35735.93
{txt}95%    {res} 10.78892       16730.18       {txt}Skewness      {res} 166.6848
{txt}99%    {res} 66.62843       43776.02       {txt}Kurtosis      {res}  35692.6
{txt}
{com}. 
. save tfp1, replace
{txt}{p 0 4 2}
file {bf}
tfp1.dta{rm}
saved
{p_end}

{com}. 
. clear all
{res}{txt}
{com}. 
. 
. use mamin_new.dta,clear
{txt}
{com}. destring year, replace
{txt}year already numeric; no {res}replace
{txt}
{com}. xtset Noobs year
{res}
{col 1}{txt:Panel variable: }{res:Noobs}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2017}}{txt: to }{res:{bind:2021}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}
{com}. keep if Disic2==10
{txt}(3,052 observations deleted)

{com}. gen cost=It1vcu+Rdnvcu+Rimvcu+Efuvcu+Eplvcu+Enpvcu+Zpdvcu+Zndvcu
{txt}
{com}. gen labshare=(Zpdvcu+Zndvcu)/cost
{txt}
{com}. gen ln=log(Zpdvcu+Zndvcu)
{txt}(2 missing values generated)

{com}. gen lk=log(V1115)
{txt}(14,584 missing values generated)

{com}. gen lo=log(Output)
{txt}
{com}. gen lm=log(Rdnvcu+Rimvcu)
{txt}(401 missing values generated)

{com}. gen ll=log(Ltlnou)
{txt}
{com}. gen lva=log(Vtlvcu)
{txt}
{com}. tostring Disic4,replace
{txt}Disic4 was {res:int} now {res:str4}

{com}. gen Disic3=substr(Disic4, 1, 3)
{txt}
{com}. destring Disic4 Disic3,replace
{txt}Disic4: all characters numeric; {res}replaced {txt}as {res}int
{txt}Disic3: all characters numeric; {res}replaced {txt}as {res}int
{txt}
{com}. merge m:1 year using birate,nogenerate
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}              17
{txt}{col 9}from master{col 30}{res}               0{txt}  
{col 9}from using{col 30}{res}              17{txt}  

{col 5}Matched{col 30}{res}          35,280{txt}  
{col 5}{hline 41}

{com}. drop if Noobs==. // amid birate <2017
{txt}(17 observations deleted)

{com}. gen covid=0
{txt}
{com}. replace covid=1 if year>2019
{txt}(14,175 real changes made)

{com}. save pakau,replace
{txt}{p 0 4 2}
file {bf}
pakau.dta{rm}
saved
{p_end}

{com}. 
. prodest lva, free(ln) state(lk) proxy(lm) method(lp) fsresidual(om) va
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}    20413
{txt}Group variable (id): Noobs{col 49}Number of groups   = {res}     6288
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      3.2
{col 49}{txt}               max = {res}        5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .6766907{col 26}{space 2} .0096072{col 37}{space 1}   70.44{col 46}{space 3}0.000{col 54}{space 4}  .657861{col 67}{space 3} .6955205
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .0753849{col 26}{space 2}  .006311{col 37}{space 1}   11.95{col 46}{space 3}0.000{col 54}{space 4} .0630156{col 67}{space 3} .0877542
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 664.46
                                          p = (0.00)

{com}. outreg2 using "tfp2.xls",excel replace
{txt}{browse `"tfp2.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfp2.txt""':seeout}

{com}. 
. predict mu,markups inputvar(ln)
{txt}(2 missing values generated)

{com}. 
. // REMOVE OUTLIERS DUE TO FUNNY INPUT
. // outliers = 5% bot and 5% top
. sum mu,det

                             {txt}mu
{hline 61}
      Percentiles      Smallest
 1%    {res} .6214978         .00639
{txt} 5%    {res} .7190008       .0107513
{txt}10%    {res}  .808042       .0199939       {txt}Obs         {res}     35,278
{txt}25%    {res} 1.148767       .0239348       {txt}Sum of wgt. {res}     35,278

{txt}50%    {res}  2.19636                      {txt}Mean          {res} 7.937924
                        {txt}Largest       Std. dev.     {res} 47.60636
{txt}75%    {res} 5.461792       1927.181
{txt}90%    {res} 13.05225       2193.324       {txt}Variance      {res} 2266.366
{txt}95%    {res}  23.5867       3506.651       {txt}Skewness      {res} 48.05747
{txt}99%    {res} 95.24677       4560.229       {txt}Kurtosis      {res} 3562.053
{txt}
{com}. // drop if mu < r(p5) | mu > r(p95)
. sum mu,det

                             {txt}mu
{hline 61}
      Percentiles      Smallest
 1%    {res} .6214978         .00639
{txt} 5%    {res} .7190008       .0107513
{txt}10%    {res}  .808042       .0199939       {txt}Obs         {res}     35,278
{txt}25%    {res} 1.148767       .0239348       {txt}Sum of wgt. {res}     35,278

{txt}50%    {res}  2.19636                      {txt}Mean          {res} 7.937924
                        {txt}Largest       Std. dev.     {res} 47.60636
{txt}75%    {res} 5.461792       1927.181
{txt}90%    {res} 13.05225       2193.324       {txt}Variance      {res} 2266.366
{txt}95%    {res}  23.5867       3506.651       {txt}Skewness      {res} 48.05747
{txt}99%    {res} 95.24677       4560.229       {txt}Kurtosis      {res} 3562.053
{txt}
{com}. 
. predict ,parameters
{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .6766907{col 26}{space 2} .0096072{col 37}{space 1}   70.44{col 46}{space 3}0.000{col 54}{space 4}  .657861{col 67}{space 3} .6955205
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .0753849{col 26}{space 2}  .006311{col 37}{space 1}   11.95{col 46}{space 3}0.000{col 54}{space 4} .0630156{col 67}{space 3} .0877542
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. predict tfp,omega
{txt}
{com}. 
. bys year: tabstat mu, stats(mean sd median p25 p75 min max)

{txt}{hline}
-> year = 2017

{ralign 12:Variable} {...}
{c |}      Mean        SD       p50       p25       p75       Min       Max
{hline 13}{c +}{hline 70}
{ralign 12:mu} {...}
{c |}{...}
 {res} 8.554142    61.223  2.042428  1.220386  6.515313    .00639  3506.651
{txt}{hline 13}{c BT}{hline 70}

{hline}
-> year = 2018

{ralign 12:Variable} {...}
{c |}      Mean        SD       p50       p25       p75       Min       Max
{hline 13}{c +}{hline 70}
{ralign 12:mu} {...}
{c |}{...}
 {res} 7.673547  43.86751  2.229474   1.21491  5.072389  .0590985  2193.324
{txt}{hline 13}{c BT}{hline 70}

{hline}
-> year = 2019

{ralign 12:Variable} {...}
{c |}      Mean        SD       p50       p25       p75       Min       Max
{hline 13}{c +}{hline 70}
{ralign 12:mu} {...}
{c |}{...}
 {res}  7.74463   60.3243  2.287618  1.146112  5.155698  .3453783  4560.229
{txt}{hline 13}{c BT}{hline 70}

{hline}
-> year = 2020

{ralign 12:Variable} {...}
{c |}      Mean        SD       p50       p25       p75       Min       Max
{hline 13}{c +}{hline 70}
{ralign 12:mu} {...}
{c |}{...}
 {res} 7.797538  28.68913  2.003587  1.036372  5.191251  .0107513   949.728
{txt}{hline 13}{c BT}{hline 70}

{hline}
-> year = 2021

{ralign 12:Variable} {...}
{c |}      Mean        SD       p50       p25       p75       Min       Max
{hline 13}{c +}{hline 70}
{ralign 12:mu} {...}
{c |}{...}
 {res} 7.860735  33.59021  2.335917  1.154682  5.371795  .0239348  1411.892
{txt}{hline 13}{c BT}{hline 70}

{com}. 
. save tfp2, replace
{txt}{p 0 4 2}
file {bf}
tfp2.dta{rm}
saved
{p_end}

{com}. 
. // Regressing by 4-digit KBLI
. 
. clear all
{res}{txt}
{com}. use pakai
{txt}
{com}. levelsof disic4_4,local(ids)
{res}{txt}1010 1020 1030 1040 1050 1061 1062 1071 1072 1073 1074 1079 1080

{com}. foreach i in `ids' {c -(}
{txt}  2{com}.         clear all
{txt}  3{com}.         use pakai
{txt}  4{com}.         xtset psid year
{txt}  5{com}.         keep if disic4_4==`i'
{txt}  6{com}.         prodest lva, free(ln) state(lk) proxy(lm) method(lp) fsresidual(om) va
{txt}  7{com}.         predict tfp,omega
{txt}  8{com}.         predict mu,markups inputvar(ln)
{txt}  9{com}.         
.         save tfpc`i',replace
{txt} 10{com}.         outreg2 using tfpc`i'.xls,replace se bdec(3) tdec(3) excel
{txt} 11{com}. 
. {c )-}
{res}
{col 1}{txt:Panel variable: }{res:psid}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2000}}{txt: to }{res:{bind:2015}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}(82,617 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}      456
{txt}Group variable (id): psid{col 49}Number of groups   = {res}      131
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      3.5
{col 49}{txt}               max = {res}       14

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .5639879{col 26}{space 2} .0396579{col 37}{space 1}   14.22{col 46}{space 3}0.000{col 54}{space 4} .4862599{col 67}{space 3}  .641716
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .1688009{col 26}{space 2}  .060798{col 37}{space 1}    2.78{col 46}{space 3}0.005{col 54}{space 4} .0496391{col 67}{space 3} .2879628
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 16.40
                                          p = (0.00)
{p 0 4 2}
file {bf}
tfpc1010.dta{rm}
saved
{p_end}
{browse `"tfpc1010.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpc1010.txt""':seeout}
{res}
{col 1}{txt:Panel variable: }{res:psid}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2000}}{txt: to }{res:{bind:2015}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}(71,177 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}     7631
{txt}Group variable (id): psid{col 49}Number of groups   = {res}     1474
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      5.2
{col 49}{txt}               max = {res}       15

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .4096068{col 26}{space 2} .0186089{col 37}{space 1}   22.01{col 46}{space 3}0.000{col 54}{space 4}  .373134{col 67}{space 3} .4460796
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .1595326{col 26}{space 2} .0240094{col 37}{space 1}    6.64{col 46}{space 3}0.000{col 54}{space 4} .1124751{col 67}{space 3} .2065901
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 1142.27
                                          p = (0.00)
{p 0 4 2}
file {bf}
tfpc1020.dta{rm}
saved
{p_end}
{browse `"tfpc1020.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpc1020.txt""':seeout}
{res}
{col 1}{txt:Panel variable: }{res:psid}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2000}}{txt: to }{res:{bind:2015}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}(82,295 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}      676
{txt}Group variable (id): psid{col 49}Number of groups   = {res}      190
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      3.6
{col 49}{txt}               max = {res}       15

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .4132295{col 26}{space 2} .0420617{col 37}{space 1}    9.82{col 46}{space 3}0.000{col 54}{space 4}   .33079{col 67}{space 3}  .495669
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .1257278{col 26}{space 2} .0257937{col 37}{space 1}    4.87{col 46}{space 3}0.000{col 54}{space 4} .0751731{col 67}{space 3} .1762825
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 52.43
                                          p = (0.00)
{p 0 4 2}
file {bf}
tfpc1030.dta{rm}
saved
{p_end}
{browse `"tfpc1030.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpc1030.txt""':seeout}
{res}
{col 1}{txt:Panel variable: }{res:psid}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2000}}{txt: to }{res:{bind:2015}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}(75,648 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}     3623
{txt}Group variable (id): psid{col 49}Number of groups   = {res}      721
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      5.0
{col 49}{txt}               max = {res}       15

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2}  .351462{col 26}{space 2} .0208307{col 37}{space 1}   16.87{col 46}{space 3}0.000{col 54}{space 4} .3106347{col 67}{space 3} .3922894
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .0862506{col 26}{space 2} .0184131{col 37}{space 1}    4.68{col 46}{space 3}0.000{col 54}{space 4} .0501617{col 67}{space 3} .1223396
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 264.35
                                          p = (0.00)
(1 missing value generated)
{p 0 4 2}
file {bf}
tfpc1040.dta{rm}
saved
{p_end}
{browse `"tfpc1040.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpc1040.txt""':seeout}
{res}
{col 1}{txt:Panel variable: }{res:psid}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2000}}{txt: to }{res:{bind:2015}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}(82,780 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}      430
{txt}Group variable (id): psid{col 49}Number of groups   = {res}       67
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      6.4
{col 49}{txt}               max = {res}       15

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .4191496{col 26}{space 2} .0745921{col 37}{space 1}    5.62{col 46}{space 3}0.000{col 54}{space 4} .2729518{col 67}{space 3} .5653475
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .0563677{col 26}{space 2} .1056615{col 37}{space 1}    0.53{col 46}{space 3}0.594{col 54}{space 4} -.150725{col 67}{space 3} .2634605
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 26.39
                                          p = (0.00)
{p 0 4 2}
file {bf}
tfpc1050.dta{rm}
saved
{p_end}
{browse `"tfpc1050.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpc1050.txt""':seeout}
{res}
{col 1}{txt:Panel variable: }{res:psid}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2000}}{txt: to }{res:{bind:2015}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}(74,806 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}     6073
{txt}Group variable (id): psid{col 49}Number of groups   = {res}     1034
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      5.9
{col 49}{txt}               max = {res}       15

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .3891369{col 26}{space 2} .0137747{col 37}{space 1}   28.25{col 46}{space 3}0.000{col 54}{space 4} .3621388{col 67}{space 3} .4161349
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .1115554{col 26}{space 2} .0115723{col 37}{space 1}    9.64{col 46}{space 3}0.000{col 54}{space 4} .0888741{col 67}{space 3} .1342368
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 864.82
                                          p = (0.00)
{p 0 4 2}
file {bf}
tfpc1061.dta{rm}
saved
{p_end}
{browse `"tfpc1061.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpc1061.txt""':seeout}
{res}
{col 1}{txt:Panel variable: }{res:psid}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2000}}{txt: to }{res:{bind:2015}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}(79,635 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}     2465
{txt}Group variable (id): psid{col 49}Number of groups   = {res}      459
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      5.4
{col 49}{txt}               max = {res}       15

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .3401186{col 26}{space 2} .0134184{col 37}{space 1}   25.35{col 46}{space 3}0.000{col 54}{space 4}  .313819{col 67}{space 3} .3664181
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .0397096{col 26}{space 2} .0411941{col 37}{space 1}    0.96{col 46}{space 3}0.335{col 54}{space 4}-.0410293{col 67}{space 3} .1204485
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 245.34
                                          p = (0.00)
{p 0 4 2}
file {bf}
tfpc1062.dta{rm}
saved
{p_end}
{browse `"tfpc1062.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpc1062.txt""':seeout}
{res}
{col 1}{txt:Panel variable: }{res:psid}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2000}}{txt: to }{res:{bind:2015}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}(73,892 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}     5841
{txt}Group variable (id): psid{col 49}Number of groups   = {res}     1074
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      5.4
{col 49}{txt}               max = {res}       15

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .3665653{col 26}{space 2} .0059359{col 37}{space 1}   61.75{col 46}{space 3}0.000{col 54}{space 4} .3549311{col 67}{space 3} .3781995
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .0677944{col 26}{space 2} .0163524{col 37}{space 1}    4.15{col 46}{space 3}0.000{col 54}{space 4} .0357442{col 67}{space 3} .0998446
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 2167.79
                                          p = (0.00)
{p 0 4 2}
file {bf}
tfpc1071.dta{rm}
saved
{p_end}
{browse `"tfpc1071.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpc1071.txt""':seeout}
{res}
{col 1}{txt:Panel variable: }{res:psid}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2000}}{txt: to }{res:{bind:2015}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}(81,376 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}     1335
{txt}Group variable (id): psid{col 49}Number of groups   = {res}      265
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      5.0
{col 49}{txt}               max = {res}       15

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .5076193{col 26}{space 2} .0405097{col 37}{space 1}   12.53{col 46}{space 3}0.000{col 54}{space 4} .4282216{col 67}{space 3} .5870169
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .0567182{col 26}{space 2} .0373413{col 37}{space 1}    1.52{col 46}{space 3}0.129{col 54}{space 4}-.0164695{col 67}{space 3} .1299059
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 107.44
                                          p = (0.00)
{p 0 4 2}
file {bf}
tfpc1072.dta{rm}
saved
{p_end}
{browse `"tfpc1072.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpc1072.txt""':seeout}
{res}
{col 1}{txt:Panel variable: }{res:psid}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2000}}{txt: to }{res:{bind:2015}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}(81,989 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}      834
{txt}Group variable (id): psid{col 49}Number of groups   = {res}      153
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      5.5
{col 49}{txt}               max = {res}       15

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .5073636{col 26}{space 2} .0174136{col 37}{space 1}   29.14{col 46}{space 3}0.000{col 54}{space 4} .4732336{col 67}{space 3} .5414935
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .1298376{col 26}{space 2} .0564363{col 37}{space 1}    2.30{col 46}{space 3}0.021{col 54}{space 4} .0192245{col 67}{space 3} .2404507
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 25.35
                                          p = (0.00)
{p 0 4 2}
file {bf}
tfpc1073.dta{rm}
saved
{p_end}
{browse `"tfpc1073.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpc1073.txt""':seeout}
{res}
{col 1}{txt:Panel variable: }{res:psid}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2000}}{txt: to }{res:{bind:2015}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}(78,608 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}     2994
{txt}Group variable (id): psid{col 49}Number of groups   = {res}      443
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      6.8
{col 49}{txt}               max = {res}       15

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .2745736{col 26}{space 2} .0213251{col 37}{space 1}   12.88{col 46}{space 3}0.000{col 54}{space 4} .2327772{col 67}{space 3}   .31637
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .0630015{col 26}{space 2} .0072813{col 37}{space 1}    8.65{col 46}{space 3}0.000{col 54}{space 4} .0487304{col 67}{space 3} .0772726
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 2047.40
                                          p = (0.00)
{p 0 4 2}
file {bf}
tfpc1074.dta{rm}
saved
{p_end}
{browse `"tfpc1074.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpc1074.txt""':seeout}
{res}
{col 1}{txt:Panel variable: }{res:psid}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2000}}{txt: to }{res:{bind:2015}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}(55,321 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}    19127
{txt}Group variable (id): psid{col 49}Number of groups   = {res}     3298
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      5.8
{col 49}{txt}               max = {res}       15

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .3096621{col 26}{space 2} .0071783{col 37}{space 1}   43.14{col 46}{space 3}0.000{col 54}{space 4} .2955929{col 67}{space 3} .3237312
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .1112893{col 26}{space 2} .0151971{col 37}{space 1}    7.32{col 46}{space 3}0.000{col 54}{space 4} .0815034{col 67}{space 3} .1410751
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 4302.67
                                          p = (0.00)
{p 0 4 2}
file {bf}
tfpc1079.dta{rm}
saved
{p_end}
{browse `"tfpc1079.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpc1079.txt""':seeout}
{res}
{col 1}{txt:Panel variable: }{res:psid}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2000}}{txt: to }{res:{bind:2015}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}(81,952 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}      872
{txt}Group variable (id): psid{col 49}Number of groups   = {res}      161
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      5.4
{col 49}{txt}               max = {res}       15

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .3522461{col 26}{space 2} .0332333{col 37}{space 1}   10.60{col 46}{space 3}0.000{col 54}{space 4} .2871101{col 67}{space 3} .4173821
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .2061019{col 26}{space 2} .0520005{col 37}{space 1}    3.96{col 46}{space 3}0.000{col 54}{space 4} .1041829{col 67}{space 3}  .308021
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 94.42
                                          p = (0.00)
{p 0 4 2}
file {bf}
tfpc1080.dta{rm}
saved
{p_end}
{browse `"tfpc1080.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpc1080.txt""':seeout}

{com}. 
. use tfpc1010,clear
{txt}
{com}. append using tfpc1020 tfpc1030 tfpc1040 tfpc1050 tfpc1061 tfpc1062 tfpc1071 tfpc1072 tfpc1073 tfpc1074 tfpc1079 tfpc1080
{txt}(label {bf:{txt}ownership} already defined)
(label {bf:{txt}_merge} already defined)
(label {bf:{txt}importdepend} already defined)
(label {bf:{txt}salesorientation} already defined)
(label {bf:{txt}ownership} already defined)
(label {bf:{txt}_merge} already defined)
(label {bf:{txt}importdepend} already defined)
(label {bf:{txt}salesorientation} already defined)
(label {bf:{txt}ownership} already defined)
(label {bf:{txt}_merge} already defined)
(label {bf:{txt}importdepend} already defined)
(label {bf:{txt}salesorientation} already defined)
(label {bf:{txt}ownership} already defined)
(label {bf:{txt}_merge} already defined)
(label {bf:{txt}importdepend} already defined)
(label {bf:{txt}salesorientation} already defined)
(label {bf:{txt}ownership} already defined)
(label {bf:{txt}_merge} already defined)
(label {bf:{txt}importdepend} already defined)
(label {bf:{txt}salesorientation} already defined)
(label {bf:{txt}ownership} already defined)
(label {bf:{txt}_merge} already defined)
(label {bf:{txt}importdepend} already defined)
(label {bf:{txt}salesorientation} already defined)
(label {bf:{txt}ownership} already defined)
(label {bf:{txt}_merge} already defined)
(label {bf:{txt}importdepend} already defined)
(label {bf:{txt}salesorientation} already defined)
(label {bf:{txt}ownership} already defined)
(label {bf:{txt}_merge} already defined)
(label {bf:{txt}importdepend} already defined)
(label {bf:{txt}salesorientation} already defined)
(label {bf:{txt}ownership} already defined)
(label {bf:{txt}_merge} already defined)
(label {bf:{txt}importdepend} already defined)
(label {bf:{txt}salesorientation} already defined)
(label {bf:{txt}ownership} already defined)
(label {bf:{txt}_merge} already defined)
(label {bf:{txt}importdepend} already defined)
(label {bf:{txt}salesorientation} already defined)
(label {bf:{txt}ownership} already defined)
(label {bf:{txt}_merge} already defined)
(label {bf:{txt}importdepend} already defined)
(label {bf:{txt}salesorientation} already defined)
(label {bf:{txt}ownership} already defined)
(label {bf:{txt}_merge} already defined)
(label {bf:{txt}importdepend} already defined)
(label {bf:{txt}salesorientation} already defined)

{com}. sum mu,det

                             {txt}mu
{hline 61}
      Percentiles      Smallest
 1%    {res} .0551594       .0000278
{txt} 5%    {res} .3182416       .0004226
{txt}10%    {res} .3821436       .0010564       {txt}Obs         {res}     83,507
{txt}25%    {res} .5296357       .0011535       {txt}Sum of wgt. {res}     83,507

{txt}50%    {res} .8850149                      {txt}Mean          {res} 6.159544
                        {txt}Largest       Std. dev.     {res} 166.1139
{txt}75%    {res} 1.945675       8053.682
{txt}90%    {res} 5.051661       14053.63       {txt}Variance      {res} 27593.82
{txt}95%    {res} 9.620064       17554.01       {txt}Skewness      {res} 155.8667
{txt}99%    {res} 58.13654        36772.6       {txt}Kurtosis      {res} 30997.11
{txt}
{com}. //drop if mu < r(p5) | mu > r(p95)
. sum mu,det

                             {txt}mu
{hline 61}
      Percentiles      Smallest
 1%    {res} .0551594       .0000278
{txt} 5%    {res} .3182416       .0004226
{txt}10%    {res} .3821436       .0010564       {txt}Obs         {res}     83,507
{txt}25%    {res} .5296357       .0011535       {txt}Sum of wgt. {res}     83,507

{txt}50%    {res} .8850149                      {txt}Mean          {res} 6.159544
                        {txt}Largest       Std. dev.     {res} 166.1139
{txt}75%    {res} 1.945675       8053.682
{txt}90%    {res} 5.051661       14053.63       {txt}Variance      {res} 27593.82
{txt}95%    {res} 9.620064       17554.01       {txt}Skewness      {res} 155.8667
{txt}99%    {res} 58.13654        36772.6       {txt}Kurtosis      {res} 30997.11
{txt}
{com}. save tfpc,replace
{txt}{p 0 4 2}
file {bf}
tfpc.dta{rm}
saved
{p_end}

{com}. 
. clear all
{res}{txt}
{com}. use pakau
{txt}
{com}. levelsof Disic3,local(idd)
{res}{txt}101 102 103 104 105 106 107 108

{com}. foreach i in `idd' {c -(}
{txt}  2{com}.         clear all
{txt}  3{com}.         use pakau
{txt}  4{com}.         xtset Noobs year
{txt}  5{com}.         //destring disic4,replace
.         keep if Disic3==`i'
{txt}  6{com}.         prodest lva, free(ln) state(lk) proxy(lm) method(lp) fsresidual(om) va
{txt}  7{com}.         predict tfp,omega
{txt}  8{com}.         predict mu,markups inputvar(ln)
{txt}  9{com}.         save tfpd`i',replace
{txt} 10{com}.         outreg2 using tfpd`i'.xls,replace se bdec(3) tdec(3) excel
{txt} 11{com}. 
. {c )-}
{res}
{col 1}{txt:Panel variable: }{res:Noobs}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2017}}{txt: to }{res:{bind:2021}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}(34,619 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}      311
{txt}Group variable (id): Noobs{col 49}Number of groups   = {res}      128
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      2.4
{col 49}{txt}               max = {res}        5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .5988942{col 26}{space 2} .0427711{col 37}{space 1}   14.00{col 46}{space 3}0.000{col 54}{space 4} .5150644{col 67}{space 3}  .682724
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .0518357{col 26}{space 2} .0406841{col 37}{space 1}    1.27{col 46}{space 3}0.203{col 54}{space 4}-.0279037{col 67}{space 3} .1315751
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 32.95
                                          p = (0.00)
{p 0 4 2}
file {bf}
tfpd101.dta{rm}
saved
{p_end}
{browse `"tfpd101.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpd101.txt""':seeout}
{res}
{col 1}{txt:Panel variable: }{res:Noobs}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2017}}{txt: to }{res:{bind:2021}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}(29,465 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}     3562
{txt}Group variable (id): Noobs{col 49}Number of groups   = {res}     1157
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      3.1
{col 49}{txt}               max = {res}        5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .7087719{col 26}{space 2}  .020894{col 37}{space 1}   33.92{col 46}{space 3}0.000{col 54}{space 4} .6678205{col 67}{space 3} .7497233
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .0698914{col 26}{space 2} .0135243{col 37}{space 1}    5.17{col 46}{space 3}0.000{col 54}{space 4} .0433843{col 67}{space 3} .0963986
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 58.59
                                          p = (0.00)
{p 0 4 2}
file {bf}
tfpd102.dta{rm}
saved
{p_end}
{browse `"tfpd102.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpd102.txt""':seeout}
{res}
{col 1}{txt:Panel variable: }{res:Noobs}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2017}}{txt: to }{res:{bind:2021}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}(33,944 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}      839
{txt}Group variable (id): Noobs{col 49}Number of groups   = {res}      286
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      2.9
{col 49}{txt}               max = {res}        5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .6132293{col 26}{space 2} .0616644{col 37}{space 1}    9.94{col 46}{space 3}0.000{col 54}{space 4} .4923693{col 67}{space 3} .7340894
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .0234261{col 26}{space 2} .0403882{col 37}{space 1}    0.58{col 46}{space 3}0.562{col 54}{space 4}-.0557333{col 67}{space 3} .1025855
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 172.50
                                          p = (0.00)
{p 0 4 2}
file {bf}
tfpd103.dta{rm}
saved
{p_end}
{browse `"tfpd103.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpd103.txt""':seeout}
{res}
{col 1}{txt:Panel variable: }{res:Noobs}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2017}}{txt: to }{res:{bind:2021}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}(29,171 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}     2569
{txt}Group variable (id): Noobs{col 49}Number of groups   = {res}      845
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      3.0
{col 49}{txt}               max = {res}        5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .5378713{col 26}{space 2} .0408864{col 37}{space 1}   13.16{col 46}{space 3}0.000{col 54}{space 4} .4577354{col 67}{space 3} .6180073
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .0482524{col 26}{space 2} .0146027{col 37}{space 1}    3.30{col 46}{space 3}0.001{col 54}{space 4} .0196317{col 67}{space 3} .0768731
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 64.11
                                          p = (0.00)
{p 0 4 2}
file {bf}
tfpd104.dta{rm}
saved
{p_end}
{browse `"tfpd104.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpd104.txt""':seeout}
{res}
{col 1}{txt:Panel variable: }{res:Noobs}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2017}}{txt: to }{res:{bind:2021}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}(34,786 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}      209
{txt}Group variable (id): Noobs{col 49}Number of groups   = {res}       84
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      2.5
{col 49}{txt}               max = {res}        5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .3193672{col 26}{space 2} .0900538{col 37}{space 1}    3.55{col 46}{space 3}0.000{col 54}{space 4} .1428651{col 67}{space 3} .4958694
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .2508211{col 26}{space 2} .0728165{col 37}{space 1}    3.44{col 46}{space 3}0.001{col 54}{space 4} .1081033{col 67}{space 3} .3935389
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 8.35
                                          p = (0.00)
{p 0 4 2}
file {bf}
tfpd105.dta{rm}
saved
{p_end}
{browse `"tfpd105.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpd105.txt""':seeout}
{res}
{col 1}{txt:Panel variable: }{res:Noobs}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2017}}{txt: to }{res:{bind:2021}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}(31,257 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}     2596
{txt}Group variable (id): Noobs{col 49}Number of groups   = {res}      961
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      2.7
{col 49}{txt}               max = {res}        5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .5124348{col 26}{space 2} .0226706{col 37}{space 1}   22.60{col 46}{space 3}0.000{col 54}{space 4} .4680012{col 67}{space 3} .5568684
{txt}{space 10}lk {c |}{col 14}{res}{space 2}  .040208{col 26}{space 2} .0329062{col 37}{space 1}    1.22{col 46}{space 3}0.222{col 54}{space 4} -.024287{col 67}{space 3}  .104703
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 80.93
                                          p = (0.00)
(2 missing values generated)
{p 0 4 2}
file {bf}
tfpd106.dta{rm}
saved
{p_end}
{browse `"tfpd106.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpd106.txt""':seeout}
{res}
{col 1}{txt:Panel variable: }{res:Noobs}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2017}}{txt: to }{res:{bind:2021}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}(19,259 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}     9935
{txt}Group variable (id): Noobs{col 49}Number of groups   = {res}     2981
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      3.3
{col 49}{txt}               max = {res}        5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .6893749{col 26}{space 2} .0208182{col 37}{space 1}   33.11{col 46}{space 3}0.000{col 54}{space 4}  .648572{col 67}{space 3} .7301777
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .0603269{col 26}{space 2} .0094831{col 37}{space 1}    6.36{col 46}{space 3}0.000{col 54}{space 4} .0417404{col 67}{space 3} .0789134
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 79.58
                                          p = (0.00)
{p 0 4 2}
file {bf}
tfpd107.dta{rm}
saved
{p_end}
{browse `"tfpd107.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpd107.txt""':seeout}
{res}
{col 1}{txt:Panel variable: }{res:Noobs}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2017}}{txt: to }{res:{bind:2021}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}(34,459 observations deleted)
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}      392
{txt}Group variable (id): Noobs{col 49}Number of groups   = {res}      140
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      2.8
{col 49}{txt}               max = {res}        5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .4922353{col 26}{space 2} .0587983{col 37}{space 1}    8.37{col 46}{space 3}0.000{col 54}{space 4} .3769928{col 67}{space 3} .6074778
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .2171983{col 26}{space 2} .0337781{col 37}{space 1}    6.43{col 46}{space 3}0.000{col 54}{space 4} .1509945{col 67}{space 3} .2834022
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 13.82
                                          p = (0.00)
{p 0 4 2}
file {bf}
tfpd108.dta{rm}
saved
{p_end}
{browse `"tfpd108.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfpd108.txt""':seeout}

{com}. 
. // use tfpd1011,clear
. 
. // append using tfpd1011 tfpd1012 tfpd1013 tfpd1021 tfpd1022 tfpd1029 tfpd1031 tfpd1032 tfpd1033 tfpd1039 tfpd1041 tfpd1042 tfpd1043 tfpd1049 tfpd1051 tfpd1052 tfpd1053 tfpd1059 tfpd1061 tfpd1062 tfpd1063 tfpd1071 tfpd1072 tfpd1073 tfpd1074 tfpd1075 tfpd1076 tfpd1077 tfpd1079 tfpd1080
. 
. use tfpd101,clear
{txt}
{com}. append using tfpd102 tfpd103 tfpd104 tfpd105 tfpd106 tfpd107 tfpd108
{txt}(label {bf:{txt}ownership} already defined)
(label {bf:{txt}importdepend} already defined)
(label {bf:{txt}salesorientation} already defined)
(label {bf:{txt}_merge} already defined)
(label {bf:{txt}ownership} already defined)
(label {bf:{txt}importdepend} already defined)
(label {bf:{txt}salesorientation} already defined)
(label {bf:{txt}_merge} already defined)
(label {bf:{txt}ownership} already defined)
(label {bf:{txt}importdepend} already defined)
(label {bf:{txt}salesorientation} already defined)
(label {bf:{txt}_merge} already defined)
(label {bf:{txt}ownership} already defined)
(label {bf:{txt}importdepend} already defined)
(label {bf:{txt}salesorientation} already defined)
(label {bf:{txt}_merge} already defined)
(label {bf:{txt}ownership} already defined)
(label {bf:{txt}importdepend} already defined)
(label {bf:{txt}salesorientation} already defined)
(label {bf:{txt}_merge} already defined)
(label {bf:{txt}ownership} already defined)
(label {bf:{txt}importdepend} already defined)
(label {bf:{txt}salesorientation} already defined)
(label {bf:{txt}_merge} already defined)
(label {bf:{txt}ownership} already defined)
(label {bf:{txt}importdepend} already defined)
(label {bf:{txt}salesorientation} already defined)
(label {bf:{txt}_merge} already defined)

{com}. 
. sum mu,det

                             {txt}mu
{hline 61}
      Percentiles      Smallest
 1%    {res} .4950048        .004839
{txt} 5%    {res} .7029624       .0109528
{txt}10%    {res} .7810508        .018125       {txt}Obs         {res}     35,278
{txt}25%    {res}  1.10103       .0203687       {txt}Sum of wgt. {res}     35,278

{txt}50%    {res} 2.107759                      {txt}Mean          {res} 6.854257
                        {txt}Largest       Std. dev.     {res} 41.20696
{txt}75%    {res} 4.860591        1654.98
{txt}90%    {res} 11.18688       1699.048       {txt}Variance      {res} 1698.014
{txt}95%    {res} 19.44759       2297.307       {txt}Skewness      {res} 56.32624
{txt}99%    {res} 76.81673       4645.708       {txt}Kurtosis      {res} 5150.167
{txt}
{com}. //drop if mu < r(p5) | mu > r(p95)
. sum mu,det

                             {txt}mu
{hline 61}
      Percentiles      Smallest
 1%    {res} .4950048        .004839
{txt} 5%    {res} .7029624       .0109528
{txt}10%    {res} .7810508        .018125       {txt}Obs         {res}     35,278
{txt}25%    {res}  1.10103       .0203687       {txt}Sum of wgt. {res}     35,278

{txt}50%    {res} 2.107759                      {txt}Mean          {res} 6.854257
                        {txt}Largest       Std. dev.     {res} 41.20696
{txt}75%    {res} 4.860591        1654.98
{txt}90%    {res} 11.18688       1699.048       {txt}Variance      {res} 1698.014
{txt}95%    {res} 19.44759       2297.307       {txt}Skewness      {res} 56.32624
{txt}99%    {res} 76.81673       4645.708       {txt}Kurtosis      {res} 5150.167
{txt}
{com}. save tfpd,replace
{txt}{p 0 4 2}
file {bf}
tfpd.dta{rm}
saved
{p_end}

{com}. 
. // create industry markups ISIC 4 digits
. 
. use tfp1,clear
{txt}
{com}. egen tot=total(output), by(disic4_4 year)
{txt}
{com}. gen sha=output/tot
{txt}
{com}. asgen mui=mu,w(sha) by(disic4_4 year)
{txt}
{com}. asgen tfpi=tfp,w(sha) by(disic4_4 year)
{txt}
{com}. save tfp1,replace
{txt}{p 0 4 2}
file {bf}
tfp1.dta{rm}
saved
{p_end}

{com}. 
. use tfpc,clear
{txt}
{com}. egen tot=total(output), by(disic4_4 year)
{txt}
{com}. gen sha=output/tot
{txt}
{com}. asgen mui=mu,w(sha) by(disic4_4 year)
{txt}
{com}. asgen tfpi=tfp,w(sha) by(disic4_4 year)
{txt}
{com}. save tfpc,replace
{txt}{p 0 4 2}
file {bf}
tfpc.dta{rm}
saved
{p_end}

{com}. 
. use tfp2,clear
{txt}
{com}. egen tot=total(Output), by(Disic4 year)
{txt}
{com}. gen sha=Output/tot
{txt}
{com}. asgen mui=mu,w(sha) by(Disic4 year)
{txt}
{com}. asgen tfpi=tfp,w(sha) by(Disic4 year)
{txt}
{com}. save tfp2,replace
{txt}{p 0 4 2}
file {bf}
tfp2.dta{rm}
saved
{p_end}

{com}. 
. use tfpd,clear
{txt}
{com}. egen tot=total(Output), by(Disic4 year)
{txt}
{com}. gen sha=Output/tot
{txt}
{com}. asgen mui=mu,w(sha) by(Disic4 year)
{txt}
{com}. asgen tfpi=tfp,w(sha) by(Disic4 year)
{txt}
{com}. save tfpd,replace
{txt}{p 0 4 2}
file {bf}
tfpd.dta{rm}
saved
{p_end}

{com}. 
. // Show stats of markups
. 
. use tfpc,clear
{txt}
{com}. tabstat mu if disic4_4==1040, stats(mean sd median p25 p75 min max)

{txt}{ralign 12:Variable} {...}
{c |}      Mean        SD       p50       p25       p75       Min       Max
{hline 13}{c +}{hline 70}
{ralign 12:mu} {...}
{c |}{...}
 {res} 32.04335  485.3594  4.433245  1.463681  7.904108  .0017293   36772.6
{txt}{hline 13}{c BT}{hline 70}

{com}. tabstat mu if disic4_4==1062, stats(mean sd median p25 p75 min max)

{txt}{ralign 12:Variable} {...}
{c |}      Mean        SD       p50       p25       p75       Min       Max
{hline 13}{c +}{hline 70}
{ralign 12:mu} {...}
{c |}{...}
 {res} 3.455416  32.70872  1.046148  .5400679  1.964254  .0027957  1781.638
{txt}{hline 13}{c BT}{hline 70}

{com}. tabstat mu if disic4_4==1072, stats(mean sd median p25 p75 min max)

{txt}{ralign 12:Variable} {...}
{c |}      Mean        SD       p50       p25       p75       Min       Max
{hline 13}{c +}{hline 70}
{ralign 12:mu} {...}
{c |}{...}
 {res} 17.34206  400.5069  1.432736  .7876931  3.584265  .0041659  17554.01
{txt}{hline 13}{c BT}{hline 70}

{com}. 
. use tfpd,clear
{txt}
{com}. tabstat mu if Disic4==1043, stats(mean sd median p25 p75 min max)

{txt}{ralign 12:Variable} {...}
{c |}      Mean        SD       p50       p25       p75       Min       Max
{hline 13}{c +}{hline 70}
{ralign 12:mu} {...}
{c |}{...}
 {res}  13.9099  38.90184  6.461647  2.556549  13.54257  .0567691   1531.83
{txt}{hline 13}{c BT}{hline 70}

{com}. tabstat mu if Disic4==1063, stats(mean sd median p25 p75 min max)

{txt}{ralign 12:Variable} {...}
{c |}      Mean        SD       p50       p25       p75       Min       Max
{hline 13}{c +}{hline 70}
{ralign 12:mu} {...}
{c |}{...}
 {res} 5.715909  24.99717  2.249706  1.071398  5.713231   .018125  811.5804
{txt}{hline 13}{c BT}{hline 70}

{com}. tabstat mu if Disic4==1072, stats(mean sd median p25 p75 min max)

{txt}{ralign 12:Variable} {...}
{c |}      Mean        SD       p50       p25       p75       Min       Max
{hline 13}{c +}{hline 70}
{ralign 12:mu} {...}
{c |}{...}
 {res} 10.33932   58.4052  2.785981  1.312587  5.898136  .2591203  1438.357
{txt}{hline 13}{c BT}{hline 70}

{com}. 
. // treating tfpd as the final data used
. 
. sum pcm,det

                             {txt}pcm
{hline 61}
      Percentiles      Smallest
 1%    {res}-.0921765      -.9954979
{txt} 5%    {res} .0110295      -.9943611
{txt}10%    {res}  .030177      -.9786084       {txt}Obs         {res}     35,280
{txt}25%    {res} .1044739      -.9659943       {txt}Sum of wgt. {res}     35,280

{txt}50%    {res} .2772467                      {txt}Mean          {res} .7523637
                        {txt}Largest       Std. dev.     {res} 8.684604
{txt}75%    {res} .5466564       168.8619
{txt}90%    {res} 1.031018       271.2657       {txt}Variance      {res} 75.42235
{txt}95%    {res} 1.913654       315.0246       {txt}Skewness      {res} 133.4226
{txt}99%    {res} 7.956423       1443.017       {txt}Kurtosis      {res} 21653.91
{txt}
{com}. drop if pcm < r(p5) | pcm > r(p95)
{txt}(3,526 observations deleted)

{com}. sum mu,detail

                             {txt}mu
{hline 61}
      Percentiles      Smallest
 1%    {res} .6015624       .2760082
{txt} 5%    {res} .7412698       .3200222
{txt}10%    {res} .8337162       .3210073       {txt}Obs         {res}     31,752
{txt}25%    {res} 1.153832       .3242759       {txt}Sum of wgt. {res}     31,752

{txt}50%    {res} 2.097423                      {txt}Mean          {res} 6.039495
                        {txt}Largest       Std. dev.     {res} 37.43032
{txt}75%    {res} 4.361569       972.6386
{txt}90%    {res} 9.884013       1070.218       {txt}Variance      {res} 1401.029
{txt}95%    {res} 16.24825       2297.307       {txt}Skewness      {res} 72.80766
{txt}99%    {res} 62.00357       4645.708       {txt}Kurtosis      {res} 7989.258
{txt}
{com}. drop if mu>r(p95)
{txt}(1,589 observations deleted)

{com}. drop if tfp==.
{txt}(12,432 observations deleted)

{com}. asgen pcmi=pcm, w(Output) by(Disic4 year)
{txt}
{com}. la var pcmi "Industry PCM"
{txt}
{com}. drop mui
{txt}
{com}. asgen mui=mu,w(Output) by(Disic4 year)
{txt}
{com}. asgen Dasingi=Dasing,w(Output) by(Disic4 year)
{txt}
{com}. asgen mui3=mu,w(Output) by(Disic3 year)
{txt}
{com}. gen lmui=log(mui)
{txt}
{com}. gen lmu=log(mu)
{txt}
{com}. gen lmui3=log(mui3)
{txt}
{com}. 
. merge m:1 Disic3 year using wpi,gen(swt)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}              10
{txt}{col 9}from master{col 30}{res}               0{txt}  (swt==1)
{col 9}from using{col 30}{res}              10{txt}  (swt==2)

{col 5}Matched{col 30}{res}          17,733{txt}  (swt==3)
{col 5}{hline 41}

{com}. merge m:1 Disic4 year using wpi2,gen(swt2)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}          14,918
{txt}{col 9}from master{col 30}{res}          14,916{txt}  (swt2==1)
{col 9}from using{col 30}{res}               2{txt}  (swt2==2)

{col 5}Matched{col 30}{res}           2,827{txt}  (swt2==3)
{col 5}{hline 41}

{com}. gen lwpi2=log(price)
{txt}(14,916 missing values generated)

{com}. gen lwpi=log(wpi10)
{txt}(2 missing values generated)

{com}. 
. gen tc = Rdnvcu+Rimvcu+Efuvcu+Enpvcu+Ztdvcu+It1vcu
{txt}(12 missing values generated)

{com}. gen ltc=log(tc)
{txt}(12 missing values generated)

{com}. 
. // labeling
. 
. la var Ltlnou "no. of workers"
{txt}
{com}. la var Output "Output"
{txt}
{com}. la var V1115 "Capitsah al"
{txt}
{com}. la var tc "Total cost"
{txt}
{com}. la var Prprex "% output exported"
{txt}
{com}. la var salesor "Sales orientation"
{txt}
{com}. la var tfp "Total factor productivity"
{txt}
{com}. la var wa_cr44d "Industry CR4"
{txt}
{com}. la var wa_hhi4d "Industry HHI"
{txt}
{com}. la var pcm "Price-cost margin"
{txt}
{com}. la var mu "Markups"
{txt}
{com}. la var ln "Log #Workers"
{txt}
{com}. la var birate "Policy rate"
{txt}
{com}. la var cov "COVID-19 Dummy"
{txt}
{com}. la var Dasing "Foreign ownership"
{txt}
{com}. la var lmu "Log of markups"
{txt}
{com}. la var lmui "Log of industry markups"
{txt}
{com}. la var lwpi "log of price index"
{txt}
{com}. la var lwpi2 "log of price index"
{txt}
{com}. la var Disic3 "ISIC-3-digits"
{txt}
{com}. la var Disic2 "ISIC-2-digits"
{txt}
{com}. la var Disic4 "ISIC-4-digits"
{txt}
{com}. la var mui "Industry markups"
{txt}
{com}. 
. save tfpdd,replace
{txt}{p 0 4 2}
file {bf}
tfpdd.dta{rm}
saved
{p_end}

{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\github\foodbi\tfplog.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}17 Nov 2023, 20:39:29
{txt}{.-}
{smcl}
{txt}{sf}{ul off}