{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\github\foodbi\tfplog.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}11 Oct 2023, 13:39:55
{txt}
{com}. /*
> ╔╗─────────╔═══╗╔╗────╔═══╗╔╗─────╔╗
> ║║─────────║╔══╝║║────║╔═╗╠╝╚╗───╔╝╚╗
> ║║──╔══╦══╗║╚══╦╣║╔══╗║╚══╬╗╔╬══╦╩╗╔╝
> ║║─╔╣╔╗║╔╗║║╔══╬╣║║║═╣╚══╗║║║║╔╗║╔╣║
> ║╚═╝║╚╝║╚╝║║║──║║╚╣║═╣║╚═╝║║╚╣╔╗║║║╚╗
> ╚═══╩══╩═╗║╚╝──╚╩═╩══╝╚═══╝╚═╩╝╚╩╝╚═╝
> ───────╔═╝║
> ───────╚══╝
> */
. cd "C:\github\foodbi" // Please change this to the proper working directory
{res}C:\github\foodbi
{txt}
{com}. 
. import excel "C:\github\Foodbi\new_data\use\makro.xlsx", sheet("compile") firstrow clear
{res}{text}(3 vars, 22 obs)

{com}. tsset year
{res}
{p 0 15 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2000}}{txt: to }{res:{bind:2021}}{p_end}
{txt}{col 9}Delta: {res}1 unit
{txt}
{com}. save birate,replace
{txt}{p 0 4 2}
(file {bf}
birate.dta{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
birate.dta{rm}
saved
{p_end}

{com}. 
. use "new_data/use/data0015.dta",clear // Pleace change this with the data in
{txt}
{com}. 
. xtset psid year
{res}
{col 1}{txt:Panel variable: }{res:psid}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:2000}}{txt: to }{res:{bind:2015}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}
{com}. keep if disic2_4==10 // ISIC Rev. 4. For ISIC rev.3, 15
{txt}(4,985 observations deleted)

{com}. 
. gen cost=it1vcu+rdnvcu+rimvcu+efuvcu+eplvcu+enpvcu+zpdvcu+zndvcu
{txt}(1 missing value generated)

{com}. gen c2=rdnvcu+rimvcu+zpdvcu+zndvcu+it1vcu
{txt}
{com}. gen labshare=(zpdvcu+zndvcu)/cost
{txt}(1 missing value generated)

{com}. gen lab2=(zpdvcu+zndvcu)/c2
{txt}
{com}. gen ln=log(zpdvcu+zndvcu)
{txt}(1 missing value generated)

{com}. gen lk=log(v1115)
{txt}(30,867 missing values generated)

{com}. gen lo=log(output)
{txt}
{com}. gen lm=log(rdnvcu+rimvcu)
{txt}(710 missing values generated)

{com}. gen ll=log(ltlnou)
{txt}
{com}. gen lva=log(vtlvcu)
{txt}
{com}. 
. merge m:1 year using birate
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               6
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}               6{txt}  (_merge==2)

{col 5}Matched{col 30}{res}          83,508{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop if psid==. // amid birate 2016++
{txt}(6 observations deleted)

{com}. save pakai,replace
{txt}{p 0 4 2}
file {bf}
pakai.dta{rm}
saved
{p_end}

{com}. 
. prodest lva, free(ln) state(lk) proxy(lm) method(lp) fsresidual(om) va
.{res}....


{txt}lp productivity estimator {col 49}Cobb-Douglas PF

Dependent variable: value added{col 49}Number of obs      = {res}    52357
{txt}Group variable (id): psid{col 49}Number of groups   = {res}     8564
{txt}Time variable (t): year
{col 49}Obs per group: min = {res}        1
{col 49}{txt}               avg = {res}      6.1
{col 49}{txt}               max = {res}       15

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         lva{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}ln {c |}{col 14}{res}{space 2} .4183988{col 26}{space 2} .0068135{col 37}{space 1}   61.41{col 46}{space 3}0.000{col 54}{space 4} .4050446{col 67}{space 3} .4317529
{txt}{space 10}lk {c |}{col 14}{res}{space 2} .1125666{col 26}{space 2} .0033585{col 37}{space 1}   33.52{col 46}{space 3}0.000{col 54}{space 4} .1059841{col 67}{space 3}  .119149
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Wald test on Constant returns to scale: Chi2 = 3294.25
                                          p = (0.00)

{com}. outreg2 using "tfp1.xls",excel replace
{txt}{browse `"tfp1.xls"'}
{browse `"C:\github\foodbi"' :dir}{com} : {txt}{stata `"seeout using "tfp1.txt""':seeout}

{com}. 
. predict mu,markups inputvar(ln)
{txt}(1 missing value generated)

{com}. 
. predict tfp,omega
{txt}
{com}. // REMOVE OUTLIERS DUE TO FUNNY INPUT
. // outliers = 5% bot and 5% top
. sum mu,det

                             {txt}mu
{hline 61}
      Percentiles      Smallest
 1%    {res} .0699072       .0000299
{txt} 5%    {res} .4205703       .0004824
{txt}10%    {res} .4774132       .0014273       {txt}Obs         {res}     83,507
{txt}25%    {res} .6369065       .0015586       {txt}Sum of wgt. {res}     83,507

{txt}50%    {res} 1.062654                      {txt}Mean          {res} 7.063753
                        {txt}Largest       Std. dev.     {res} 189.0395
{txt}75%    {res} 2.147371       8226.549
{txt}90%    {res} 5.802135       14468.67       {txt}Variance      {res} 35735.93
{txt}95%    {res} 10.78892       16730.18       {txt}Skewness      {res} 166.6848
{txt}99%    {res} 66.62843       43776.02       {txt}Kurtosis      {res}  35692.6
{txt}
{com}. drop if mu < r(p5) | mu > r(p95)
{txt}(8,351 observations deleted)

{com}. sum mu,det

                             {txt}mu
{hline 61}
      Percentiles      Smallest
 1%    {res} .4314723       .4205703
{txt} 5%    {res} .4723672       .4205747
{txt}10%    {res} .5199187       .4205963       {txt}Obs         {res}     75,157
{txt}25%    {res}  .668201        .420634       {txt}Sum of wgt. {res}     75,157

{txt}50%    {res} 1.062654                      {txt}Mean          {res} 1.748337
                        {txt}Largest       Std. dev.     {res} 1.811976
{txt}75%    {res} 1.996111       10.77864
{txt}90%    {res} 3.886382       10.78768       {txt}Variance      {res} 3.283258
{txt}95%    {res} 6.015707       10.78864       {txt}Skewness      {res} 2.476296
{txt}99%    {res} 9.361674       10.78892       {txt}Kurtosis      {res}  9.43796
{txt}
{com}. 
. save tfp1, replace
{txt}{p 0 4 2}
file {bf}
tfp1.dta{rm}
saved
{p_end}

{com}. 
. clear all
{res}{txt}
{com}. 
. 
. use mamin_new.dta,clear
{err}{p 0 4 2}
file {bf:{err}mamin_new.dta}
not found
{p_end}
{txt}{search r(601), local:r(601);}

end of do-file

{search r(601), local:r(601);}

{com}. do "C:\github\Foodbi\Parameters.do"
{txt}
{com}. 
. set more off
{txt}
{com}. clear all
{res}{txt}
{com}. cd "C:\github\foodbi" // Please change this to the proper working directory
{res}C:\github\foodbi
{txt}
{com}. //Create dta from excel
. foreach i in 17 18 19 20 21 {c -(}
{txt}  2{com}.     import excel "C:\github\Foodbi\new_data\use\mamin`i'.xlsx", sheet("Data") firstrow clear
{txt}  3{com}.     destring Disic4`i', replace
{txt}  4{com}.         destring Disic2`i', replace
{txt}  5{com}.         destring Dprovi`i', replace
{txt}  6{com}.         destring Dkabup`i', replace
{txt}  7{com}.         save "new_data\use\mamin`i'.dta", replace
{txt}  8{com}. {c )-}
{res}{err}file C:/github/Foodbi/new_data/use/mamin17.xlsx not found
{txt}{search r(601), local:r(601);}

end of do-file

{search r(601), local:r(601);}

{com}. logm close
{err}command {bf}logm{sf} is unrecognized
{txt}{search r(199), local:r(199);}

{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\github\foodbi\tfplog.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}11 Oct 2023, 13:43:23
{txt}{.-}
{smcl}
{txt}{sf}{ul off}